zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t ULIM       : 20;           /*!< Sets the upper limit for the window comparator.                           */
            uint32_t            : 12;
    } WULIM_b;
  } ;

  union {
    __IOM uint32_t WLLIM;                       /*!< Sets the window comparator lower limit                                    */

    struct {
      __IOM uint32_t LLIM       : 20;           /*!< Sets the lower limit for the window comparator.                           */
            uint32_t            : 12;
    } WLLIM_b;
  } ;

  union {
    __IOM uint32_t SCWLIM;                      /*!< Sets the scaling limits for the window comparator                         */

    struct {
      __IOM uint32_t SCWLIMEN   : 1;            /*!< Scale the window limits compare values per precision mode. When
                                                     set to 0x0 (default), the values in the 20-bit limits registers
                                                     will compare directly with the FIFO values regardless of
                                                     the precision mode the slot is configured to. When set
                                                     to 0x1, the compare values will be divided by the difference
                                                     in precision bits while performing the window limit comparisons.          */
            uint32_t            : 31;
    } SCWLIM_b;
  } ;

  union {
    __IOM uint32_t FIFO;                        /*!< The ADC FIFO Register contains the slot number and fifo data
                                                     for the oldest conversion data in the FIFO. The COUNT field
                                                     indicates the total number of valid entries in the FIFO.
                                                     A write to this register will pop one of the FIFO entries
                                                     off the FIFO and decrease the COUNT by 1 if the COUNT is
                                                     greater than zero.                                                        */

    struct {
      __IOM uint32_t DATA       : 20;           /*!< Oldest data in the FIFO.                                                  */
      __IOM uint32_t COUNT      : 8;            /*!< Number of valid entries in the ADC FIFO.                                  */
      __IOM uint32_t SLOTNUM    : 3;            /*!< Slot number associated with this FIFO data.                               */
      __IOM uint32_t RSVD       : 1;            /*!< RESERVED.                                                                 */
    } FIFO_b;
  } ;

  union {
    __IOM uint32_t FIFOPR;                      /*!< This is a Pop Read mirrored copy of the ADCFIFO register with
                                                     the only difference being that reading this register will
                                                     result in a simultaneous FIFO POP which is also achieved
                                                     by writing to the ADCFIFO Register. Note: The DFIFORDEN
                                                     bit must be set in the CFG register for the the destructive
                                                     read to be enabled.                                                       */

    struct {
      __IOM uint32_t DATA       : 20;           /*!< Oldest data in the FIFO.                                                  */
      __IOM uint32_t COUNT      : 8;            /*!< Number of valid entries in the ADC FIFO.                                  */
      __IOM uint32_t SLOTNUMPR  : 3;            /*!< Slot number associated with this FIFO data.                               */
      __IOM uint32_t RSVDPR     : 1;            /*!< RESERVED.                                                                 */
    } FIFOPR_b;
  } ;

  union {
    __IOM uint32_t INTTRIGTIMER;                /*!< Configures the clock, maximum count, and enables the ADC internal
                                                     repeating trigger timer.                                                  */

    struct {
      __IOM uint32_t TIMERMAX   : 10;           /*!< Trigger counter count max, used as initial condition to trigger.
                                                     Also used repeatedly each time counter reaches it to restart
                                                     trigger timer at zero. To update this value, first disable
                                                     the INTTRIGTIMER by setting TIMEREN to DIS, change TIMERMAX,
                                                     and then reenable it INTTRIGTIMER by setting TIMEREN to
                                                     EN again.                                                                 */
            uint32_t            : 6;
      __IOM uint32_t CLKDIV     : 3;            /*!< Configure number of divide-by-2 of clock source as input to
                                                     the trigger counter up to divide-by-32. To update this
                                                     value, first disable the INTTRIGTIMER by setting TIMEREN
                                                     to DIS, change CLKDIV, and then reenable itthe INTTRIGTIMER
                                                     by setting TIMEREN to EN again.                                           */
            uint32_t            : 12;
      __IOM uint32_t TIMEREN    : 1;            /*!< ADC-internal trigger timer enable.                                        */
    } INTTRIGTIMER_b;
  } ;
  __IM  uint32_t  RESERVED[7];

  union {
    __IOM uint32_t ZXCFG;                       /*!< Configures the zero crossing comparator                                   */

    struct {
      __IOM uint32_t ZXEN       : 1;            /*!< Enable the ZX comparator                                                  */
            uint32_t            : 3;
      __IOM uint32_t ZXCHANSEL  : 1;            /*!< Select which slots to use for zero crossing measurement. 0 enables
                                                     zero crossing detection on slots 0 and 2. 1 enables zero
                                                     crossing detection on slots 1 and 3.                                      */
            uint32_t            : 27;
    } ZXCFG_b;
  } ;

  union {
    __IOM uint32_t ZXLIM;                       /*!< Configures the zero crossing comparator limits                            */

