zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t TARGADDRNEXT : 32;         /*!< Next DMA Target Address. This register is not updated with the
                                                     current address of the DMA, but will remain static with
                                                     the original address during the DMA transfer.                             */
    } DMATARGADDRNEXT_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNTNEXT;             /*!< Sets the next DMA total count                                             */

    struct {
            uint32_t            : 2;
      __IOM uint32_t TOTCOUNTNEXT : 16;         /*!< Next Total Transfer Count.                                                */
            uint32_t            : 14;
    } DMATOTCOUNTNEXT_b;
  } ;

  union {
    __IOM uint32_t DMAENNEXTCTRL;               /*!< Enable the next DMA transaction                                           */

    struct {
      __IOM uint32_t DMAENNEXT  : 1;            /*!< SW set this bit after setting up TOTCOUNTNEXT and TARGADDRNEXT
                                                     register fields. HW will then auto-load TOTCOUNTNEXT and
                                                     TARGADDRNEXT values when its current DMA job completes,
                                                     and auto-clear this DMAENNEXT bit. SW can then reload a
                                                     new DMA job with new TOTCOUNTNEXT and TARGADDRNEXT values.                */
            uint32_t            : 31;
    } DMAENNEXTCTRL_b;
  } ;
} ADC_Type;                                     /*!< Size = 672 (0x2a0)                                                        */



/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock Generator (CLKGEN)
  */

typedef struct {                                /*!< CLKGEN Structure                                                          */
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t OCTRL;                       /*!< This register includes controls for autocalibration in addition
                                                     to the RTC and Secure RTC oscillator controls.                            */

    struct {
            uint32_t            : 6;
      __IOM uint32_t RTCOSEL    : 1;            /*!< Selects the Secure RTC oscillator (1=LFRC, 0=XT)                          */
      __IOM uint32_t SECURERTCOSEL : 1;         /*!< Selects the Secure RTC oscillator (1=LFRC, 0=XT)                          */
            uint32_t            : 24;
    } OCTRL_b;
  } ;

  union {
    __IOM uint32_t CLKOUT;                      /*!< This register enables the CLKOUT to the GPIOs, and selects the
                                                     clock source to that.                                                     */

    struct {
      __IOM uint32_t CKSEL      : 6;            /*!< Select the clock signal that will be observed on CLKOUT. For
                                                     the Apollo510 family, the clock frequencies being observed
                                                     are LFRC=900Hz, XT=32KHz, HFRC=48MHz, PLLVCO=250MHz                       */
            uint32_t            : 1;
      __IOM uint32_t CKEN       : 1;            /*!< Enable the CLKOUT signal                                                  */
      __IOM uint32_t AOCLKFORCEEN : 1;          /*!< Force AO_CLK to enable for measurement                                    */
            uint32_t            : 23;
    } CLKOUT_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t HFADJ;                       /*!< This register controls the HFRC adjustment. The HFRC clock can
                                                     change with temperature and process corners, and this register
                                                     controls the HFRC adjustment logic which reduces the fluctuations
                                                     to the clock.                                                             */

    struct {
      __IOM uint32_t HFADJEN    : 1;            /*!< HFRC adjustment control                                                   */
      __IOM uint32_t HFADJCK    : 3;            /*!< Repeat period for HFRC adjustment                                         */
            uint32_t            : 4;
      __IOM uint32_t HFXTADJ    : 12;           /*!< Target HFRC adjustment value.                                             */
      __IOM uint32_t HFWARMUP   : 1;            /*!< XT warmup period for HFRC adjustment                                      */
      __IOM uint32_t HFADJGAIN  : 3;            /*!< Gain control for HFRC adjustment                                          */
      __IOM uint32_t HFADJMAXDELTA : 5;         /*!< Maximum delta for HF Adjustments. 0=Disabled, 1-31=maximum delta
                                                     step                                                                      */
            uint32_t            : 3;
    } HFADJ_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t CLOCKENSTAT;                 /*!< This register provides the enable status to all the peripheral
                                                     clocks. These status bits change frequently and should
                                                     not be relied on to provide consistent readings.                          */

    struct {
            uint32_t            : 21;
      __IOM uint32_t STCLKEN    : 1;            /*!< The System Tick clock is enabled                                          */
      __IOM uint32_t MCUCLKEN   : 1;            /*!< The MCU clock is enabled                                                  */
      __IOM uint32_t I3CREFCLKEN : 1;           /*!< The I3C reference clock is enabled                                        */
      __IOM uint32_t AXICLKEN   : 1;            /*!< The AXI clock is enabled                                                  */
      __IOM uint32_t SECURERTCOSEL : 1;         /*!< Secure RTC uses XT or LFRC                                                */
      __IOM uint32_t PXTALCLKEN : 1;            /*!< At least one peripheral clock relying on low-speed XTAL is on             */
      __IOM uint32_t PHFRCCLKEN : 1;            /*!< At least one peripheral clock relying on HFRC is on                       */
      __IOM uint32_t HFADJEN    : 1;            /*!< HFADJ circuit is enabled                                                  */
      __IOM uint32_t RTCOSEL    : 1;            /*!< RTC uses XT or LFRC                                                       */
      __IOM uint32_t XTALCLKOUTEN : 1;          /*!< Low-speed XTAL output clock is on                                         */
      __IOM uint32_t HFRCCLKEN  : 1;            /*!< HFRC oscillator clock is on                                               */
    } CLOCKENSTAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN2STAT;                /*!< This is a continuation of the clock enable status. These status
                                                     bits change frequently and should not be relied on to provide
                                                     consistent readings.                                                      */

