zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t GFXCORECLKEN : 1;          /*!< Enable for the GFX CORE clock through clkgen                              */
      __IOM uint32_t GFXCORECLKSEL : 1;         /*!< selection for GFX CORE clock. This defaults to HFRC_96MHz. That's
                                                     the only choice.                                                          */
      __IOM uint32_t STCLKFORCEON : 1;          /*!< Force the ST clock to be always on                                        */
      __IOM uint32_t PMUCLKFORCEON : 1;         /*!< Force the PMU clock to be always on (unused)                              */
      __IOM uint32_t DBGCLKFORCEON : 1;         /*!< Force the DBG clock to be always on (unused)                              */
      __IOM uint32_t IWICCLKFORCEON : 1;        /*!< Force the IWIC clock to be always on (unused)                             */
      __IOM uint32_t MCUCLKFORCEON : 1;         /*!< Force the MCU clock to be always on (unused)                              */
      __IOM uint32_t DISPCTRLCLKEN : 1;         /*!< Enable the 96MHz display controller clock                                 */
      __IOM uint32_t XTHSMUXSEL : 1;            /*!< Clock select between high speed crystal oscillator and external
                                                     reference clock                                                           */
      __IOM uint32_t PLLDIVEN   : 1;            /*!< Request enable of the PLL post dividers                                   */
      __IOM uint32_t PLLVCOEN   : 1;            /*!< Request enable of the PLL VCO                                             */
      __IOM uint32_t I3CCLKEN   : 1;            /*!< Enable the I3C clock                                                      */
            uint32_t            : 20;
    } CLKCTRL_b;
  } ;
} CLKGEN_Type;                                  /*!< Size = 292 (0x124)                                                        */



/* =========================================================================================================================== */
/* ================                                          CM55IPC                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter CPU communication (CM55IPC)
  */

typedef struct {                                /*!< CM55IPC Structure                                                         */

  union {
    __IOM uint32_t M2DDATA;                     /*!< CM55 to CM4 message data                                                  */

    struct {
      __IOM uint32_t M2DMESSAGE : 32;           /*!< CM55 to CM4 message data                                                  */
    } M2DDATA_b;
  } ;

  union {
    __IOM uint32_t D2MDATA;                     /*!< CM4 to CM55 message data                                                  */

    struct {
      __IOM uint32_t D2MMESSAGE : 32;           /*!< CM4 to CM55 message data                                                  */
    } D2MDATA_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< Channels status                                                           */

    struct {
      __IOM uint32_t D2MEMPTY   : 1;            /*!< CM4 to CM55 message data FIFO is empty                                    */
      __IOM uint32_t D2MFULL    : 1;            /*!< CM4 to CM55 message data FIFO is full                                     */
      __IOM uint32_t D2MTHRESHOLDACTIVE : 1;    /*!< CM4 to CM55 pending data is over threshold                                */
            uint32_t            : 1;
      __IOM uint32_t D2MPEND    : 6;            /*!< CM4 to CM55 pending data number                                           */
            uint32_t            : 6;
      __IOM uint32_t M2DEMPTY   : 1;            /*!< CM55 to CM4 message data FIFO is empty                                    */
      __IOM uint32_t M2DFULL    : 1;            /*!< CM55 to CM4 message data FIFO is full                                     */
      __IOM uint32_t M2DTHRESHOLDACTIVE : 1;    /*!< CM55 to CM4 pending data is over threshold                                */
            uint32_t            : 1;
      __IOM uint32_t M2DPEND    : 6;            /*!< CM55 to CM4 pending data number                                           */
            uint32_t            : 6;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t M2DIT;                       /*!< CM55 to CM4 channel interrupt threshold                                   */

    struct {
      __IOM uint32_t M2DTHRESHOLD : 5;          /*!< CM55 to CM4 message data threshold. Valid values: 31 to 1                 */
            uint32_t            : 27;
    } M2DIT_b;
  } ;

  union {
    __IOM uint32_t M2DIS;                       /*!< CM55 to CM4 channel interrupt status                                      */

    struct {
      __IOM uint32_t M2DTHRESHOLDIRQ : 1;       /*!< CM55 to CM4 message threshold interrupt                                   */
      __IOM uint32_t M2DERRORIRQ : 1;           /*!< CM55 to CM4 channel error interrupt                                       */
            uint32_t            : 30;
    } M2DIS_b;
  } ;

  union {
    __IOM uint32_t M2DIE;                       /*!< CM55 to CM4 channel interrupt enable                                      */

    struct {
      __IOM uint32_t M2DTHRESHOLDIRQEN : 1;     /*!< CM55 to CM4 message threshold interrupt enable                            */
      __IOM uint32_t M2DERRORIRQEN : 1;         /*!< CM55 to CM4 channel error interrupt enable                                */
            uint32_t            : 30;
    } M2DIE_b;
  } ;

  union {
    __IOM uint32_t D2MERROR;                    /*!< CM4 to CM55 channel error                                                 */

