zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t D2MEMPTYERROR : 1;         /*!< CM4 to CM55 message data FIFO underflow. Write '1' to clear
                                                     this bit                                                                  */
      __IOM uint32_t D2MFULLERROR : 1;          /*!< CM4 to CM55 message data FIFO overflow. Write '1' to clear this
                                                     bit                                                                       */
      __IOM uint32_t M2DFULLERROR : 1;          /*!< CM55 to CM4 message data FIFO overflow. Write '1' to clear this
                                                     bit                                                                       */
      __IOM uint32_t IPCINIT    : 1;            /*!< IPC is (re)initialized. Write '1' to clear this bit                       */
            uint32_t            : 28;
    } D2MERROR_b;
  } ;

  union {
    __IOM uint32_t D2MIT;                       /*!< CM4 to CM55 channel interrupt threshold                                   */

    struct {
      __IOM uint32_t D2MTHRESHOLD : 5;          /*!< CM4 to CM55 message data threshold. Valid values: 31 to 1                 */
            uint32_t            : 27;
    } D2MIT_b;
  } ;

  union {
    __IOM uint32_t D2MIS;                       /*!< CM4 to CM55 channel interrupt status                                      */

    struct {
      __IOM uint32_t D2MTHRESHOLDIRQ : 1;       /*!< CM4 to CM55 message threshold interrupt. Write '1' to clear
                                                     this bit                                                                  */
      __IOM uint32_t D2MERRORIRQ : 1;           /*!< CM4 to CM55 channel error interrupt. Write '1' to clear this
                                                     bit                                                                       */
            uint32_t            : 30;
    } D2MIS_b;
  } ;

  union {
    __IOM uint32_t D2MIE;                       /*!< CM4 to CM55 channel interrupt enable                                      */

    struct {
      __IOM uint32_t D2MTHRESHOLDIRQEN : 1;     /*!< CM4 to CM55 message threshold interrupt enable                            */
      __IOM uint32_t D2MERRORIRQEN : 1;         /*!< CM4 to CM55 channel error interrupt enable                                */
            uint32_t            : 30;
    } D2MIE_b;
  } ;
} CM55IPC_Type;                                 /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Peripheral CRM (CRM)
  */

typedef struct {                                /*!< CRM Structure                                                             */
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t ADCCRM;                      /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t ADCCLKEN   : 1;            /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t ADCCLKACTIVE : 1;          /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
      __IOM uint32_t ADCRSTN    : 1;            /*!< Reset ADC APB and ADC Modules. (0: Assert reset; 1: De-assert
                                                     reset;)                                                                   */
      __IOM uint32_t ADCCRMRSTN : 1;            /*!< Reset ADC CRM, ADC APB and ADC Modules. (0: Assert reset; 1:
                                                     De-assert reset;)                                                         */
      __IOM uint32_t ADCCLKSEL  : 1;            /*!< Source Clock Select                                                       */
            uint32_t            : 3;
      __IOM uint32_t ADCCLKDIV  : 2;            /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 22;
    } ADCCRM_b;
  } ;

  union {
    __IOM uint32_t APBDISPCRM;                  /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t APBDISPCLKEN : 1;          /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t APBDISPCLKACTIVE : 1;      /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
      __IOM uint32_t APBDISPRSTN : 1;           /*!< Reset DISP APB and DISP Modules. (0: Assert reset; 1: De-assert
                                                     reset;)                                                                   */
      __IOM uint32_t APBDISPCRMRSTN : 1;        /*!< Reset DISP CRM, DISP APB and DISP Modules. (0: Assert reset;
                                                     1: De-assert reset;)                                                      */
            uint32_t            : 28;
    } APBDISPCRM_b;
  } ;

  union {
    __IOM uint32_t APBDISPPHYCRM;               /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t APBDISPPHYCLKEN : 1;       /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t APBDISPPHYCLKACTIVE : 1;   /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
      __IOM uint32_t APBDISPPHYRSTN : 1;        /*!< Reset DISPPHY APB and DISPPHY Modules. (0: Assert reset; 1:
                                                     De-assert reset;)                                                         */
      __IOM uint32_t APBDISPPHYCRMRSTN : 1;     /*!< Reset DISPPHY CRM, DISPPHY APB and DISPPHY Modules. (0: Assert
                                                     reset; 1: De-assert reset;)                                               */
            uint32_t            : 28;
    } APBDISPPHYCRM_b;
  } ;

  union {
    __IOM uint32_t APBUARTCRM;                  /*!< Clock and Reset Controls configurations                                   */

