zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t EHRVALID   : 1;            /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t AUTOCORRERR : 1;           /*!< Cannot be cleared by SW! Only RNG reset clears this bit.                  */
      __IOM uint32_t CRNGTERR   : 1;            /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t VNERR      : 1;            /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t RNGWATCHDOG : 1;           /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t RNGDMADONE : 1;            /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
            uint32_t            : 10;
      __IOM uint32_t RESEEDINGDONE : 1;         /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t INSTANTIATIONDONE : 1;     /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t FINALUPDATEDONE : 1;       /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t OUTPUTREADY : 1;           /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t RESEEDCNTRFULL : 1;        /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t RESEEDCNTRTOP40 : 1;       /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t PRNGCRNGTERR : 1;          /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t REQSIZE    : 1;            /*!< Writing value 0x1 - clears corresponding bit in RNGISR                    */
      __IOM uint32_t KATERR     : 1;            /*!< Cannot be cleared by SW! Only RNG reset clears this bit.                  */
      __IOM uint32_t WHICHKATERR : 2;           /*!< Cannot be cleared by SW! Only RNG reset clears this bit.                  */
            uint32_t            : 5;
    } RNGICR_b;
  } ;

  union {
    __IOM uint32_t TRNGCONFIG;                  /*!< This register handles TRNG configuration                                  */

    struct {
      __IOM uint32_t RNDSRCSEL  : 2;            /*!< Defines the length of the oscillator ring (= the number of inverters)
                                                     out of four possible selections.                                          */
      __IOM uint32_t SOPSEL     : 1;            /*!< Secure Output Port selection:                                             */
            uint32_t            : 29;
    } TRNGCONFIG_b;
  } ;

  union {
    __IOM uint32_t TRNGVALID;                   /*!< This register indicates that the TRNG data is valid.                      */

    struct {
      __IOM uint32_t EHRVALID   : 1;            /*!< 0x1 indicates that collection of bits in the TRNG is completed,
                                                     and data can be read from the EHR_DATA register.                          */
            uint32_t            : 31;
    } TRNGVALID_b;
  } ;

  union {
    __IOM uint32_t EHRDATA0;                    /*!< This register contains the data collected in the TRNG[31_0].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[31_0]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA0_b;
  } ;

  union {
    __IOM uint32_t EHRDATA1;                    /*!< This register contains the data collected in the TRNG[63_32].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[63_32]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA1_b;
  } ;

  union {
    __IOM uint32_t EHRDATA2;                    /*!< This register contains the data collected in the TRNG[95_64].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[95_64]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA2_b;
  } ;

  union {
    __IOM uint32_t EHRDATA3;                    /*!< This register contains the data collected in the TRNG[127_96].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[127_96]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA3_b;
  } ;

  union {
    __IOM uint32_t EHRDATA4;                    /*!< This register contains the data collected in the TRNG[159_128].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

