zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t AESCTR03   : 32;           /*!< bits 127:96 of AES_CTR0 register.                                         */
    } AESCTR03_b;
  } ;

  union {
    __IOM uint32_t AESBUSY;                     /*!< This register is set when the AES core is active                          */

    struct {
      __IOM uint32_t AESBUSY    : 1;            /*!< AES_BUSY register. This register is set when the AES core is
                                                     active                                                                    */
            uint32_t            : 31;
    } AESBUSY_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t AESSK;                       /*!< writing to this address causes sampling of the HW key to the
                                                     AES_KEY0 register                                                         */

    struct {
      __IOM uint32_t AESSK      : 1;            /*!< writing to this address causes sampling of the HW key to the
                                                     AES_KEY0 register                                                         */
            uint32_t            : 31;
    } AESSK_b;
  } ;

  union {
    __IOM uint32_t AESCMACINIT;                 /*!< Writing to this address triggers the AES engine generating of
                                                     K1 and K2 for AES CMAC operations. Note: This is a special
                                                     register, affected by internal logic. Test result of this
                                                     register is NA.                                                           */

    struct {
      __IOM uint32_t AESCMACINIT : 1;           /*!< Writing to this address starts the generating of K1 and K2 for
                                                     AES CMAC operations                                                       */
            uint32_t            : 31;
    } AESCMACINIT_b;
  } ;
  __IM  uint32_t  RESERVED11[13];

  union {
    __IOM uint32_t AESSK1;                      /*!< writing to this address causes sampling of the HW key to the
                                                     AES_KEY1 register                                                         */

    struct {
      __IOM uint32_t AESSK1     : 1;            /*!< writing to this address causes sampling of the HW key to the
                                                     AES_KEY1 register                                                         */
            uint32_t            : 31;
    } AESSK1_b;
  } ;
  __IM  uint32_t  RESERVED12;

  union {
    __IOM uint32_t AESREMAININGBYTES;           /*!< This register should be set with the amount of remaining bytes
                                                     until the end of the current AES operation. The AES engine
                                                     counts down from this value to determine the last _ one
                                                     before last blocks in AES CMAC, XTS AES and AES CCM.                      */

    struct {
      __IOM uint32_t AESREMAININGBYTES : 32;    /*!< This register should be set with the amount of remaining bytes
                                                     until the end of the current AES operation. The AES engine
                                                     counts down from this value to determine the last _ one
                                                     before last blocks in AES CMAC, XTS AES and AES CCM.                      */
    } AESREMAININGBYTES_b;
  } ;

  union {
    __IOM uint32_t AESCONTROL;                  /*!< This register holds the configuration of the AES engine. Note:
                                                     This is a special register, affected by internal logic.
                                                     Test result of this register is NA.                                       */

    struct {
      __IOM uint32_t DECKEY0    : 1;            /*!< This field determines whether the AES performs Decrypt_Encrypt
                                                     operations, in non-tunneling operations:                                  */
      __IOM uint32_t MODE0ISCBCCTS : 1;         /*!< If MODE_KEY0 is set to 3b001 (CBC), and this field is set -
                                                     the mode is CBC-CTS. In addition, If MODE_KEY0 is set to
                                                     3b010 (CTR), and this field is set - the mode is GCTR.                    */
      __IOM uint32_t MODEKEY0   : 3;            /*!< This field determines the AES mode in non tunneling operations,
                                                     and the AES mode of the first stage in tunneling operations:              */
      __IOM uint32_t MODEKEY1   : 3;            /*!< This field determines the AES mode of the second stage operation
                                                     in tunneling operations:                                                  */
      __IOM uint32_t CBCISESSIV : 1;            /*!< If MODE_KEY0 is set to 3b001 (CBC), and this field is set -
                                                     the mode is CBC with ESSIV.                                               */
            uint32_t            : 1;
      __IOM uint32_t AESTUNNELISON : 1;         /*!< This field determines whether the AES performs dual-tunnel operations
                                                     or standard non-tunneling operations:                                     */
      __IOM uint32_t CBCISBITLOCKER : 1;        /*!< If MODE_KEY0 is set to 3b001 (CBC), and this field is set -
                                                     the mode isBITLOCKER.                                                     */
      __IOM uint32_t NKKEY0     : 2;            /*!< This field determines the AES Key length in non tunneling operations,
                                                     and the AES key length of the first stage in tunneling
                                                     operations:                                                               */
      __IOM uint32_t NKKEY1     : 2;            /*!< This field determines the AES key length of the second stage
                                                     operation in tunneling operations:                                        */
            uint32_t            : 6;
      __IOM uint32_t AESTUNNEL1DECRYPT : 1;     /*!< This field determines whether the second tunnel stage performs
                                                     encrypt or decrypt operation :                                            */
      __IOM uint32_t AESTUNB1USESPADDEDDATAIN : 1;/*!< This field determines, for tunneling operations, the data that
                                                     is fed to the second tunneling stage:                                     */
      __IOM uint32_t AESTUNNEL0ENCRYPT : 1;     /*!< This field determines whether the first tunnel stage performs
                                                     encrypt or decrypt operation :                                            */
      __IOM uint32_t AESOUTPUTMIDTUNNELDATA : 1;/*!< This fields determines whether the AES output is the result
                                                     of the first or second tunneling stage:                                   */
      __IOM uint32_t AESTUNNELB1PADEN : 1;      /*!< This field determines whether the input data to the second tunnel
                                                     stage is padded with zeroes (according to the remaining_bytes
                                                     value) or not:                                                            */
            uint32_t            : 1;
      __IOM uint32_t AESOUTMIDTUNTOHASH : 1;    /*!< This field determines for AES-TO-HASH-AND-DOUT tunneling operations,
                                                     whether the AES outputs to the HASH the result of the first
                                                     or the second tunneling stage:                                            */
      __IOM uint32_t AESXORCRYPTOKEY : 1;       /*!< This field determines the value that is written to AES_KEY0,
                                                     when AES_SK is kicked:                                                    */
            uint32_t            : 1;
      __IOM uint32_t DIRECTACCESS : 1;          /*!< Using direct access and not the din-dout interface                        */
    } AESCONTROL_b;
  } ;
  __IM  uint32_t  RESERVED13;

  union {
    __IOM uint32_t AESHWFLAGS;                  /*!< This register holds the pre-synthesis HW flag configuration
                                                     of the AES engine                                                         */

