zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t HASHH4     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH4_b;
  } ;

  union {
    __IOM uint32_t HASHH5;                      /*!< H5 data. can only be written in the following HASH_CONTROL modes:
                                                     SHA224 SHA256 SHA384 SHA512                                               */

    struct {
      __IOM uint32_t HASHH5     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH5_b;
  } ;

  union {
    __IOM uint32_t HASHH6;                      /*!< H6 data. can only be written in the following HASH_CONTROL modes:
                                                     SHA224 SHA256 SHA384 SHA512                                               */

    struct {
      __IOM uint32_t HASHH6     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH6_b;
  } ;

  union {
    __IOM uint32_t HASHH7;                      /*!< H7 data. can only be written in the following HASH_CONTROL modes:
                                                     SHA224 SHA256 SHA384 SHA512                                               */

    struct {
      __IOM uint32_t HASHH7     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH7_b;
  } ;

  union {
    __IOM uint32_t HASHH8;                      /*!< H8 data. can only be written in the following HASH_CONTROL modes:
                                                     SHA384 SHA512                                                             */

    struct {
      __IOM uint32_t HASHH8     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH8_b;
  } ;
  __IM  uint32_t  RESERVED19[8];

  union {
    __IOM uint32_t AUTOHWPADDING;               /*!< HW padding automatically activated by engine. For the special
                                                     case of ZERO bytes data vector this register should not
                                                     be used! instead use HASH_PAD_CFG                                         */

    struct {
      __IOM uint32_t EN         : 1;            /*!< 0x1 - Enable Automatic HW padding (No need for SW intervention
                                                     by writing PAD_CFG). Note: Not supported for 0 bytes !
                                                     Note: Disable this register when HASH op is done                          */
            uint32_t            : 31;
    } AUTOHWPADDING_b;
  } ;

  union {
    __IOM uint32_t HASHXORDIN;                  /*!< This register is always xored with the input to the hash engine,it
                                                     should be 0 if xored is not reqiured .                                    */

    struct {
      __IOM uint32_t HASHXORDATA : 32;          /*!< This register holds the value to be xor-ed with hash input data.          */
    } HASHXORDIN_b;
  } ;
  __IM  uint32_t  RESERVED20[2];

  union {
    __IOM uint32_t LOADINITSTATE;               /*!< Indication to HASH that the following data is to be loaded into
                                                     initial value registers in HASH(H0:H15) or IV to AES MAC                  */

    struct {
      __IOM uint32_t LOAD       : 1;            /*!< Load data to initial state registers. digest_iv for hash_aes_mac.
                                                     When done loading data this bit should be reset                           */
            uint32_t            : 31;
    } LOADINITSTATE_b;
  } ;
  __IM  uint32_t  RESERVED21[3];

  union {
    __IOM uint32_t HASHSELAESMAC;               /*!< select the AES MAC module rather than the hash module                     */

    struct {
      __IOM uint32_t HASHSELAESMAC : 1;         /*!< Hash or AES MAC module select.                                            */
      __IOM uint32_t GHASHSEL   : 1;            /*!< GHASH select.                                                             */
            uint32_t            : 30;
    } HASHSELAESMAC_b;
  } ;
  __IM  uint32_t  RESERVED22[66];

  union {
    __IOM uint32_t HASHVERSION;                 /*!< HASH VERSION Register                                                     */

    struct {
      __IOM uint32_t FIXES      : 8;            /*!< Fixes field.                                                              */
      __IOM uint32_t MINORVERSIONNUMBER : 4;    /*!< minor version number                                                      */
      __IOM uint32_t MAJORVERSIONNUMBER : 4;    /*!< major version number                                                      */
            uint32_t            : 16;
    } HASHVERSION_b;
  } ;
  __IM  uint32_t  RESERVED23[3];

  union {
    __IOM uint32_t HASHCONTROL;                 /*!< Selects which HASH mode to run                                            */

    struct {
      __IOM uint32_t MODE01     : 2;            /*!< bits 1:0 of the HASH mode field. The hash mode field possible
                                                     values are:                                                               */
            uint32_t            : 1;
      __IOM uint32_t MODE3      : 1;            /*!< bit 3 of the HASH mode field. The hash mode field possible values
                                                     are:4b0000 - MD5 if present 0x0001 SHA 1 4b0010 - SHA-256
                                                     4b1010 - SHA-224                                                          */
            uint32_t            : 28;
    } HASHCONTROL_b;
  } ;

  union {
    __IOM uint32_t HASHPADEN;                   /*!< Enables the hash hw padding.                                              */

    struct {
      __IOM uint32_t EN         : 1;            /*!< 0x1 : Enable generation of padding by HW Pad block. 0x0 : Disable
                                                     generation of padding by HW Pad block.                                    */
            uint32_t            : 31;
    } HASHPADEN_b;
  } ;

  union {
    __IOM uint32_t HASHPADCFG;                  /*!< This is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

