zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t NVMISIDLEREG : 1;          /*!< Indicates whether the NVM manager finishes its operation, calculates
                                                     the LCS, reads the HW keys, compares the number of zeros
                                                     and clears the keys                                                       */
            uint32_t            : 31;
    } NVMISIDLE_b;
  } ;

  union {
    __IOM uint32_t LCSREG;                      /*!< The lifecycle state register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t LCSREG     : 3;            /*!< Indicates the LCS (Lifecycle State) value.                                */
            uint32_t            : 5;
      __IOM uint32_t ERRORKDRZEROCNT : 1;       /*!< Indication that the number of zeroes in the loaded KDR is not
                                                     equal to the value set in the manufacture flag.                           */
      __IOM uint32_t ERRORPROVZEROCNT : 1;      /*!< Indication that the number of zeroes in the loaded KCP is not
                                                     equal to the value set in the OEM flag.                                   */
      __IOM uint32_t ERRORKCEZEROCNT : 1;       /*!< Indication that the number of zeroes in the loaded KCE is not
                                                     equal to the value set in the OEM flag.                                   */
      __IOM uint32_t ERRORKPICVZEROCNT : 1;     /*!< Indication that the number of zeroes in the loaded KPICV is
                                                     not equal to the value set in the manufacture flag.                       */
      __IOM uint32_t ERRORKCEICVZEROCNT : 1;    /*!< Indication that the number of zeroes in the loaded KCEICV is
                                                     not equal to the value set in the manufacture flag.                       */
            uint32_t            : 19;
    } LCSREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKDRREG;            /*!< This register interface is used to update the RKEK(KDR) registers
                                                     when the device is in CM or DM mode , it is Write-once
                                                     (per warm boot) in RMA LCS, The RKEK is updated by shifting
                                                     .                                                                         */

    struct {
      __IOM uint32_t HOSTSHADOWKDRREG : 1;      /*!< This field is used to update the KDR registers when the device
                                                     is in CM , DM or RMA mode, The KDR is updated by shifting
                                                     .                                                                         */
            uint32_t            : 31;
    } HOSTSHADOWKDRREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCPREG;            /*!< This register interface is used to update the KCP registers
                                                     when the device is in CM or DM mode, The KCP is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKCPREG : 1;      /*!< This field is used to update the KCP registers when the device
                                                     is in CM or DM mode, The KCP is updated by shifting                       */
            uint32_t            : 31;
    } HOSTSHADOWKCPREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCEREG;            /*!< This register interface is used to update the KCE registers
                                                     when the device is in CM or DM mode, The KCE is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKCEREG : 1;      /*!< This field is used to update the KCE registers when the device
                                                     is in CM or DM mode, The KCE is updated by shifting                       */
            uint32_t            : 31;
    } HOSTSHADOWKCEREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKPICVREG;          /*!< This register interface is used to update the KPICV registers
                                                     when the device is in CM or DM mode, The KPICV is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKPICVREG : 1;    /*!< This field is used to update the KPICV registers when the device
                                                     is in CM or DM mode, The KPICV is updated by shifting                     */
            uint32_t            : 31;
    } HOSTSHADOWKPICVREG_b;
  } ;

  union {
    __IOM uint32_t HOSTSHADOWKCEICVREG;         /*!< This register interface is used to update the KCEICV registers
                                                     when the device is in CM or DM mode, The KCEICV is updated
                                                     by shifting                                                               */

    struct {
      __IOM uint32_t HOSTSHADOWKCEICVREG : 1;   /*!< This field is used to update the KCEICV registers when the device
                                                     is in CM or DM mode, The KCEICV is updated by shifting                    */
            uint32_t            : 31;
    } HOSTSHADOWKCEICVREG_b;
  } ;

  union {
    __IOM uint32_t OTPADDRWIDTHDEF;             /*!< OTP_ADDR_WIDTH parameter, that will define the integrated OTP
                                                     address width (address in words). The supported sizes are
                                                     6 (for 2 Kbits),7,8,9,11 (for 64 Kbits). The default value
                                                     in the provided RTL will be 6.Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

