zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t ALPHACOLOR : 8;            /*!< Color alpha is used as background color                                   */
      __IOM uint32_t BLUECOLOR  : 8;            /*!< Color blue is used as background color                                    */
      __IOM uint32_t GREENCOLOR : 8;            /*!< Color green is used as background color                                   */
      __IOM uint32_t REDCOLOR   : 8;            /*!< Color red is used as background color                                     */
    } BGCOLOR_b;
  } ;

  union {
    __IOM uint32_t RESXY;                       /*!< Specifies the main X and Y resolutions.                                   */

    struct {
      __IOM uint32_t YRES       : 16;           /*!< Value of Y resolution in pixels                                           */
      __IOM uint32_t XRES       : 16;           /*!< Value of X resolution in pixels                                           */
    } RESXY_b;
  } ;

  union {
    __IOM uint32_t REGPLAY;                     /*!< Write any value to this register at the end of the programming
                                                     sequence to trigger the NemaDC                                            */

    struct {
      __IOM uint32_t PLAY       : 32;           /*!< Trigger the frame generation process                                      */
    } REGPLAY_b;
  } ;

  union {
    __IOM uint32_t FRONTPORCHXY;                /*!< Specifies the X and Y dimensions for the Front Porch.                     */

    struct {
      __IOM uint32_t FLINES     : 16;           /*!< Specify the number of lines for the front porch Y dimension               */
      __IOM uint32_t FPCLKCYCLES : 16;          /*!< Specify the pixel clock cycles for the front porch X dimension            */
    } FRONTPORCHXY_b;
  } ;

  union {
    __IOM uint32_t BLANKINGXY;                  /*!< Specifies the X and Y dimensions for the Blanking Period.                 */

    struct {
      __IOM uint32_t VSYNCLINES : 16;           /*!< Specify the VSYNC lines for the Y dimension blanking period               */
      __IOM uint32_t HSYNCPULSE : 16;           /*!< Specify the HSYNC pulse length for the X dimension blanking
                                                     period                                                                    */
    } BLANKINGXY_b;
  } ;

  union {
    __IOM uint32_t BACKPORCHXY;                 /*!< Specifies the X and Y dimensions for the Back Porch.                      */

    struct {
      __IOM uint32_t BLINES     : 16;           /*!< Specify the number of lines for the back porch Y dimension                */
      __IOM uint32_t BPCLKCYCLES : 16;          /*!< Specify the pixel clock cycles for the back porch X dimension             */
    } BACKPORCHXY_b;
  } ;

  union {
    __IOM uint32_t CURSORXY;                    /*!< Specifies the cursor's start X and Y coordinates.                         */

    struct {
      __IOM uint32_t CURSORY    : 16;           /*!< Specify cursor's Y dimension                                              */
      __IOM uint32_t CURSORX    : 16;           /*!< Specify cursor's X dimension                                              */
    } CURSORXY_b;
  } ;

  union {
    __IOM uint32_t STARTXY;                     /*!< Specifies the start position of the very first frame                      */

    struct {
      __IOM uint32_t STARTY     : 16;           /*!< Specify frames's Y dimension                                              */
      __IOM uint32_t STARTX     : 16;           /*!< Specify frames's X dimension                                              */
    } STARTXY_b;
  } ;

  union {
    __IOM uint32_t DBICFG;                      /*!< Register for the configuration DBI Type-B interface and the
                                                     activation of SPI 3-wire or 4-wire interfaces.                            */

    struct {
      __IOM uint32_t DBICOLORFMT : 3;           /*!< Set the color format for DBI interface                                    */
      __IOM uint32_t DATAWDORDER : 3;           /*!< Set the data order of the 8-bit data word:                                */
      __IOM uint32_t TYPEBWIDTH : 3;            /*!< Set DBI Type-B interface width (8, 9 or 16 bits) and the serial
                                                     interface:                                                                */
      __IOM uint32_t SPIMODE    : 2;            /*!< Set mode of operation SPI/DualSPI/QuadSPI/QuardSPI DDR.                   */
      __IOM uint32_t BACKPRESSUREEN : 1;        /*!< When set to 1, back pressure support is enabled (not currently
                                                     supported)                                                                */
      __IOM uint32_t RSVD12     : 4;            /*!< This field is reserved.                                                   */
      __IOM uint32_t INVHRZLINE : 1;            /*!< When set to 1, inverts the bit-order of the horizontal line
                                                     address (used along with DBI_CFG[17] register bit)                        */
      __IOM uint32_t BINDCMDS   : 1;            /*!< When set to 1, binds the store commands with the RGB data and
                                                     two-byte address is sent with each horizontal line                        */
      __IOM uint32_t RSVD18     : 4;            /*!< This field is reserved.                                                   */
      __IOM uint32_t SPI4       : 1;            /*!< When set to 1, SPI 4-wire interface is enabled                            */
      __IOM uint32_t SPI3       : 1;            /*!< When set to 1, SPI 3-wire interface is enabled                            */
      __IOM uint32_t INVPIXORDER : 1;           /*!< Invert pixel order.                                                       */
      __IOM uint32_t RESXLOW    : 1;            /*!< When set to 1, drives RESX signal low to reset DBI Type-B interface       */
      __IOM uint32_t RSVD26     : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t DBIBTEEN   : 1;            /*!< When set to 1, the DBIB_TE signal is enabled                              */
      __IOM uint32_t CSXSET     : 1;            /*!< Sets the value of DBIB_CSX signal:                                        */
      __IOM uint32_t CSXCFG     : 1;            /*!< When set to 1, the value of the CSX signal of the DBI interface
                                                     can be configured from the DBI_CFG[29] register bit                       */
      __IOM uint32_t DBIINTACT  : 1;            /*!< When set to 1, the DBI interface is activated                             */
    } DBICFG_b;
  } ;

  union {
    __IOM uint32_t DCGPIO;                      /*!< General Purpose register: read/write GPIO external pins.                  */

