zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t HORZFTPCNT : 16;           /*!< Minimum HFP period should be sufficient to transmit RGB Data
                                                     packet footer (2 bytes) + Blanking packet overhead (6 bytes)
                                                     +adjustable count (16 bytes) for non burst mode; For other
                                                     lane counts Minimum value = (RGB Data packet footer(2 bytes)
                                                     + Blanking packet overhead(6 bytes)) / (lane_count) + adjustable
                                                     count(16 bytes) For burst mode, Minimum HFP period should
                                                     be sufficient to transmit Blanking packet overhead(6 bytes)
                                                     +adjustable count (16 bytes) for one lane for other lane
                                                     counts Minimum value = ( Blanking packet overhead(6 bytes))
                                                     / (lane_count) + adjustable count(16 bytes) Min value -
                                                     8 in decimal for non-burst mode (accounted with zero payload
                                                     for blanking packet) for one lane Min value - 6 in decimal
                                                     for burst mode for one lane Max value - any 12 bit value
                                                     greater than the minimum value based on DPI resolution;
                                                     Minimum HFP period should be sufficient to transmit                       */
            uint32_t            : 16;
    } HORIZFPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t HORZACTIVEAREACNT;           /*!< Horizontal active area count / time for active image data /
                                                     Horizontal Address                                                        */

    struct {
      __IOM uint32_t HORACTCNT  : 16;           /*!< Shows the horizontal active area value in terms of txbyteclkhs.
                                                     In Non Burst Mode, Count equal to RGB word count value
                                                     In Burst Mode, RGB pixel packets are time compressed, leaving
                                                     more time during a scan line for LP mode (saving power)
                                                     or for multiplexing other transmissions onto the DSI link.
                                                     Hence, the count equals the time in txbyteclkhs for sending
                                                     time compressed RGB pixels plus the time needed for moving
                                                     to power save mode or the time needed for secondary channel
                                                     to use the DSI link. But if the left out time for moving
                                                     to low power mode is less than 8 txbyteclkhs (2txbyteclkhs
                                                     for RGB data packet footer and 6txbyteclkhs for a blanking
                                                     packet with zero payload), then this count will be added
                                                     to the HFPs count for one lane.                                           */
            uint32_t            : 16;
    } HORZACTIVEAREACNT_b;
  } ;

  union {
    __IOM uint32_t VSYNCCNT;                    /*!< Shows the vertical sync value                                             */

    struct {
      __IOM uint32_t VSC        : 16;           /*!< Shows the vertical sync value in terms of lines. Min value -
                                                     2 Max value - any 12 bit value greater than 2 based on
                                                     DPI resolution                                                            */
            uint32_t            : 16;
    } VSYNCCNT_b;
  } ;

  union {
    __IOM uint32_t VERTBKPORCHCNT;              /*!< Shows the vertical back porch value                                       */

    struct {
      __IOM uint32_t VBPSC      : 16;           /*!< Shows the vertical back porch value in terms of lines. Min value
                                                     - 1; Max value - any 12 bit value greater than 1 based
                                                     on DPI resolution                                                         */
            uint32_t            : 16;
    } VERTBKPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t VERTFPORCHCNT;               /*!< Shows the vertical front porch value                                      */

    struct {
      __IOM uint32_t VFPSC      : 16;           /*!< Shows the vertical front porch value in terms of lines. Min
                                                     value - 1; Max value - any 12 bit value greater than 1
                                                     based on DPI resolution                                                   */
            uint32_t            : 16;
    } VERTFPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t DATALANEHILOSWCNT;           /*!< High speed to low power or Low power to high speed switching
                                                     time                                                                      */

    struct {
      __IOM uint32_t DATALHLSWCNT : 16;         /*!< High speed to low power or Low power to high speed power or
                                                     Low switching time in terms byte clock (txbyteclkhs). This
                                                     power to high speed switch count value is based on the
                                                     byte clock (txbyteclkhs) and low power clock frequency
                                                     (txclkesc); Data lane Switch count = 4 * Tlpx + programmed
                                                     THS_prep + programmed THS_zero + 4 byteclk Tlpx = Low power
                                                     clock equivalence in of terms byte clock programmed in
                                                     AHB reg 68h; THS_prep = programmed value of dln_cnt_hs_prep
                                                     in AHB Reg 6ch bit (7:0) THS_zero = programmed value of
                                                     dln_cnt_hs_zero in AHB Reg 6ch bit (15:8) Programmable
                                                     count should be equal or greater than this value. Typical
                                                     value x96 Number of byte clocks required to switch from
                                                     low power mode to high speed mode after txrequesths is
                                                     asserted.                                                                 */
            uint32_t            : 16;
    } DATALANEHILOSWCNT_b;
  } ;

  union {
    __IOM uint32_t DPI;                         /*!< DPI control register.                                                     */

