zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL13   : 4;            /*!< Function select for GPIO pin 13                                           */
      __IOM uint32_t INPEN13    : 1;            /*!< Input enable for GPIO 13                                                  */
      __IOM uint32_t RDZERO13   : 1;            /*!< Return 0 for read data on GPIO 13                                         */
      __IOM uint32_t IRPTEN13   : 2;            /*!< Interrupt enable for GPIO 13                                              */
      __IOM uint32_t OUTCFG13   : 2;            /*!< Pin IO mode selection for GPIO pin 13                                     */
      __IOM uint32_t DS13       : 2;            /*!< Drive strength selection for GPIO 13                                      */
      __IOM uint32_t SR13       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG13  : 3;            /*!< Pullup/Pulldown configuration for GPIO 13                                 */
      __IOM uint32_t NCESRC13   : 5;            /*!< IOMSTR Chip Select 13, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL13   : 1;            /*!< Polarity select for NCE for GPIO 13                                       */
      __IOM uint32_t TIMERSEL13 : 1;            /*!< Select if CT13 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN13     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN13     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG13_b;
  } ;

  union {
    __IOM uint32_t PINCFG14;                    /*!< Controls the operation of GPIO pin 14.                                    */

    struct {
      __IOM uint32_t FNCSEL14   : 4;            /*!< Function select for GPIO pin 14                                           */
      __IOM uint32_t INPEN14    : 1;            /*!< Input enable for GPIO 14                                                  */
      __IOM uint32_t RDZERO14   : 1;            /*!< Return 0 for read data on GPIO 14                                         */
      __IOM uint32_t IRPTEN14   : 2;            /*!< Interrupt enable for GPIO 14                                              */
      __IOM uint32_t OUTCFG14   : 2;            /*!< Pin IO mode selection for GPIO pin 14                                     */
      __IOM uint32_t DS14       : 2;            /*!< Drive strength selection for GPIO 14                                      */
      __IOM uint32_t SR14       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG14  : 3;            /*!< Pullup/Pulldown configuration for GPIO 14                                 */
      __IOM uint32_t NCESRC14   : 5;            /*!< IOMSTR Chip Select 14, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL14   : 1;            /*!< Polarity select for NCE for GPIO 14                                       */
      __IOM uint32_t TIMERSEL14 : 1;            /*!< Select if CT14 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN14     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN14     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG14_b;
  } ;

  union {
    __IOM uint32_t PINCFG15;                    /*!< Controls the operation of GPIO pin 15.                                    */

    struct {
      __IOM uint32_t FNCSEL15   : 4;            /*!< Function select for GPIO pin 15                                           */
      __IOM uint32_t INPEN15    : 1;            /*!< Input enable for GPIO 15                                                  */
      __IOM uint32_t RDZERO15   : 1;            /*!< Return 0 for read data on GPIO 15                                         */
      __IOM uint32_t IRPTEN15   : 2;            /*!< Interrupt enable for GPIO 15                                              */
      __IOM uint32_t OUTCFG15   : 2;            /*!< Pin IO mode selection for GPIO pin 15                                     */
      __IOM uint32_t DS15       : 2;            /*!< Drive strength selection for GPIO 15                                      */
      __IOM uint32_t SR15       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG15  : 3;            /*!< Pullup/Pulldown configuration for GPIO 15                                 */
      __IOM uint32_t NCESRC15   : 5;            /*!< IOMSTR Chip Select 15, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL15   : 1;            /*!< Polarity select for NCE for GPIO 15                                       */
      __IOM uint32_t TIMERSEL15 : 1;            /*!< Select if CT15 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN15     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN15     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG15_b;
  } ;

  union {
    __IOM uint32_t PINCFG16;                    /*!< Controls the operation of GPIO pin 16.                                    */

