zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL31   : 4;            /*!< Function select for GPIO pin 31                                           */
      __IOM uint32_t INPEN31    : 1;            /*!< Input enable for GPIO 31                                                  */
      __IOM uint32_t RDZERO31   : 1;            /*!< Return 0 for read data on GPIO 31                                         */
      __IOM uint32_t IRPTEN31   : 2;            /*!< Interrupt enable for GPIO 31                                              */
      __IOM uint32_t OUTCFG31   : 2;            /*!< Pin IO mode selection for GPIO pin 31                                     */
      __IOM uint32_t DS31       : 2;            /*!< Drive strength selection for GPIO 31                                      */
      __IOM uint32_t SR31       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG31  : 3;            /*!< Pullup/Pulldown configuration for GPIO 31                                 */
      __IOM uint32_t NCESRC31   : 5;            /*!< IOMSTR Chip Select 31, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL31   : 1;            /*!< Polarity select for NCE for GPIO 31                                       */
      __IOM uint32_t TIMERSEL31 : 1;            /*!< Select if CT31 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN31     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN31     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG31 : 3;           /*!< Pullup/Pulldown configuration for GPIO 31 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG31_b;
  } ;

  union {
    __IOM uint32_t PINCFG32;                    /*!< Controls the operation of GPIO pin 32.                                    */

    struct {
      __IOM uint32_t FNCSEL32   : 4;            /*!< Function select for GPIO pin 32                                           */
      __IOM uint32_t INPEN32    : 1;            /*!< Input enable for GPIO 32                                                  */
      __IOM uint32_t RDZERO32   : 1;            /*!< Return 0 for read data on GPIO 32                                         */
      __IOM uint32_t IRPTEN32   : 2;            /*!< Interrupt enable for GPIO 32                                              */
      __IOM uint32_t OUTCFG32   : 2;            /*!< Pin IO mode selection for GPIO pin 32                                     */
      __IOM uint32_t DS32       : 2;            /*!< Drive strength selection for GPIO 32                                      */
      __IOM uint32_t SR32       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG32  : 3;            /*!< Pullup/Pulldown configuration for GPIO 32                                 */
      __IOM uint32_t NCESRC32   : 5;            /*!< IOMSTR Chip Select 32, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL32   : 1;            /*!< Polarity select for NCE for GPIO 32                                       */
      __IOM uint32_t TIMERSEL32 : 1;            /*!< Select if CT32 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN32     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN32     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG32 : 3;           /*!< Pullup/Pulldown configuration for GPIO 32 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG32_b;
  } ;

  union {
    __IOM uint32_t PINCFG33;                    /*!< Controls the operation of GPIO pin 33.                                    */

    struct {
      __IOM uint32_t FNCSEL33   : 4;            /*!< Function select for GPIO pin 33                                           */
      __IOM uint32_t INPEN33    : 1;            /*!< Input enable for GPIO 33                                                  */
      __IOM uint32_t RDZERO33   : 1;            /*!< Return 0 for read data on GPIO 33                                         */
      __IOM uint32_t IRPTEN33   : 2;            /*!< Interrupt enable for GPIO 33                                              */
      __IOM uint32_t OUTCFG33   : 2;            /*!< Pin IO mode selection for GPIO pin 33                                     */
      __IOM uint32_t DS33       : 2;            /*!< Drive strength selection for GPIO 33                                      */
      __IOM uint32_t SR33       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG33  : 3;            /*!< Pullup/Pulldown configuration for GPIO 33                                 */
      __IOM uint32_t NCESRC33   : 5;            /*!< IOMSTR Chip Select 33, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL33   : 1;            /*!< Polarity select for NCE for GPIO 33                                       */
      __IOM uint32_t TIMERSEL33 : 1;            /*!< Select if CT33 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN33     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN33     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG33 : 3;           /*!< Pullup/Pulldown configuration for GPIO 33 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG33_b;
  } ;

  union {
    __IOM uint32_t PINCFG34;                    /*!< Controls the operation of GPIO pin 34.                                    */

