zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL34   : 4;            /*!< Function select for GPIO pin 34                                           */
      __IOM uint32_t INPEN34    : 1;            /*!< Input enable for GPIO 34                                                  */
      __IOM uint32_t RDZERO34   : 1;            /*!< Return 0 for read data on GPIO 34                                         */
      __IOM uint32_t IRPTEN34   : 2;            /*!< Interrupt enable for GPIO 34                                              */
      __IOM uint32_t OUTCFG34   : 2;            /*!< Pin IO mode selection for GPIO pin 34                                     */
      __IOM uint32_t DS34       : 2;            /*!< Drive strength selection for GPIO 34                                      */
      __IOM uint32_t SR34       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG34  : 3;            /*!< Pullup/Pulldown configuration for GPIO 34                                 */
      __IOM uint32_t NCESRC34   : 5;            /*!< IOMSTR Chip Select 34, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL34   : 1;            /*!< Polarity select for NCE for GPIO 34                                       */
      __IOM uint32_t TIMERSEL34 : 1;            /*!< Select if CT34 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN34     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN34     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG34 : 3;           /*!< Pullup/Pulldown configuration for GPIO 34 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG34_b;
  } ;

  union {
    __IOM uint32_t PINCFG35;                    /*!< Controls the operation of GPIO pin 35.                                    */

    struct {
      __IOM uint32_t FNCSEL35   : 4;            /*!< Function select for GPIO pin 35                                           */
      __IOM uint32_t INPEN35    : 1;            /*!< Input enable for GPIO 35                                                  */
      __IOM uint32_t RDZERO35   : 1;            /*!< Return 0 for read data on GPIO 35                                         */
      __IOM uint32_t IRPTEN35   : 2;            /*!< Interrupt enable for GPIO 35                                              */
      __IOM uint32_t OUTCFG35   : 2;            /*!< Pin IO mode selection for GPIO pin 35                                     */
      __IOM uint32_t DS35       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 35                   */
      __IOM uint32_t SR35       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG35  : 3;            /*!< Pullup/Pulldown configuration for GPIO 35                                 */
      __IOM uint32_t NCESRC35   : 5;            /*!< IOMSTR Chip Select 35, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL35   : 1;            /*!< Polarity select for NCE for GPIO 35                                       */
      __IOM uint32_t TIMERSEL35 : 1;            /*!< Select if CT35 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN35     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN35     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG35 : 3;           /*!< Pullup/Pulldown configuration for GPIO 35 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG35_b;
  } ;

  union {
    __IOM uint32_t PINCFG36;                    /*!< Controls the operation of GPIO pin 36.                                    */

    struct {
      __IOM uint32_t FNCSEL36   : 4;            /*!< Function select for GPIO pin 36                                           */
      __IOM uint32_t INPEN36    : 1;            /*!< Input enable for GPIO 36                                                  */
      __IOM uint32_t RDZERO36   : 1;            /*!< Return 0 for read data on GPIO 36                                         */
      __IOM uint32_t IRPTEN36   : 2;            /*!< Interrupt enable for GPIO 36                                              */
      __IOM uint32_t OUTCFG36   : 2;            /*!< Pin IO mode selection for GPIO pin 36                                     */
      __IOM uint32_t DS36       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 36                   */
      __IOM uint32_t SR36       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG36  : 3;            /*!< Pullup/Pulldown configuration for GPIO 36                                 */
      __IOM uint32_t NCESRC36   : 5;            /*!< IOMSTR Chip Select 36, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL36   : 1;            /*!< Polarity select for NCE for GPIO 36                                       */
      __IOM uint32_t TIMERSEL36 : 1;            /*!< Select if CT36 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN36     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN36     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG36 : 3;           /*!< Pullup/Pulldown configuration for GPIO 36 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG36_b;
  } ;

  union {
    __IOM uint32_t PINCFG37;                    /*!< Controls the operation of GPIO pin 37.                                    */

