zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL55   : 4;            /*!< Function select for GPIO pin 55                                           */
      __IOM uint32_t INPEN55    : 1;            /*!< Input enable for GPIO 55                                                  */
      __IOM uint32_t RDZERO55   : 1;            /*!< Return 0 for read data on GPIO 55                                         */
      __IOM uint32_t IRPTEN55   : 2;            /*!< Interrupt enable for GPIO 55                                              */
      __IOM uint32_t OUTCFG55   : 2;            /*!< Pin IO mode selection for GPIO pin 55                                     */
      __IOM uint32_t DS55       : 2;            /*!< Drive strength selection for GPIO 55                                      */
      __IOM uint32_t SR55       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG55  : 3;            /*!< Pullup/Pulldown configuration for GPIO 55                                 */
      __IOM uint32_t NCESRC55   : 5;            /*!< IOMSTR Chip Select 55, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL55   : 1;            /*!< Polarity select for NCE for GPIO 55                                       */
      __IOM uint32_t TIMERSEL55 : 1;            /*!< Select if CT55 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN55     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN55     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG55 : 3;           /*!< Pullup/Pulldown configuration for GPIO 55 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG55_b;
  } ;

  union {
    __IOM uint32_t PINCFG56;                    /*!< Controls the operation of GPIO pin 56.                                    */

    struct {
      __IOM uint32_t FNCSEL56   : 4;            /*!< Function select for GPIO pin 56                                           */
      __IOM uint32_t INPEN56    : 1;            /*!< Input enable for GPIO 56                                                  */
      __IOM uint32_t RDZERO56   : 1;            /*!< Return 0 for read data on GPIO 56                                         */
      __IOM uint32_t IRPTEN56   : 2;            /*!< Interrupt enable for GPIO 56                                              */
      __IOM uint32_t OUTCFG56   : 2;            /*!< Pin IO mode selection for GPIO pin 56                                     */
      __IOM uint32_t DS56       : 2;            /*!< Drive strength selection for GPIO 56                                      */
      __IOM uint32_t SR56       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG56  : 3;            /*!< Pullup/Pulldown configuration for GPIO 56                                 */
      __IOM uint32_t NCESRC56   : 5;            /*!< IOMSTR Chip Select 56, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL56   : 1;            /*!< Polarity select for NCE for GPIO 56                                       */
      __IOM uint32_t TIMERSEL56 : 1;            /*!< Select if CT56 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN56     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN56     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG56 : 3;           /*!< Pullup/Pulldown configuration for GPIO 56 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG56_b;
  } ;

  union {
    __IOM uint32_t PINCFG57;                    /*!< Controls the operation of GPIO pin 57.                                    */

    struct {
      __IOM uint32_t FNCSEL57   : 4;            /*!< Function select for GPIO pin 57                                           */
      __IOM uint32_t INPEN57    : 1;            /*!< Input enable for GPIO 57                                                  */
      __IOM uint32_t RDZERO57   : 1;            /*!< Return 0 for read data on GPIO 57                                         */
      __IOM uint32_t IRPTEN57   : 2;            /*!< Interrupt enable for GPIO 57                                              */
      __IOM uint32_t OUTCFG57   : 2;            /*!< Pin IO mode selection for GPIO pin 57                                     */
      __IOM uint32_t DS57       : 2;            /*!< Drive strength selection for GPIO 57                                      */
      __IOM uint32_t SR57       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG57  : 3;            /*!< Pullup/Pulldown configuration for GPIO 57                                 */
      __IOM uint32_t NCESRC57   : 5;            /*!< IOMSTR Chip Select 57, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL57   : 1;            /*!< Polarity select for NCE for GPIO 57                                       */
      __IOM uint32_t TIMERSEL57 : 1;            /*!< Select if CT57 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN57     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN57     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG57 : 3;           /*!< Pullup/Pulldown configuration for GPIO 57 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG57_b;
  } ;

  union {
    __IOM uint32_t PINCFG58;                    /*!< Controls the operation of GPIO pin 58.                                    */

