zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL64   : 4;            /*!< Function select for GPIO pin 64                                           */
      __IOM uint32_t INPEN64    : 1;            /*!< Input enable for GPIO 64                                                  */
      __IOM uint32_t RDZERO64   : 1;            /*!< Return 0 for read data on GPIO 64                                         */
      __IOM uint32_t IRPTEN64   : 2;            /*!< Interrupt enable for GPIO 64                                              */
      __IOM uint32_t OUTCFG64   : 2;            /*!< Pin IO mode selection for GPIO pin 64                                     */
      __IOM uint32_t DS64       : 2;            /*!< Drive strength selection for GPIO 64                                      */
      __IOM uint32_t SR64       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG64  : 3;            /*!< Pullup/Pulldown configuration for GPIO 64                                 */
      __IOM uint32_t NCESRC64   : 5;            /*!< IOMSTR Chip Select 64, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL64   : 1;            /*!< Polarity select for NCE for GPIO 64                                       */
      __IOM uint32_t TIMERSEL64 : 1;            /*!< Select if CT64 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN64     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN64     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG64 : 3;           /*!< Pullup/Pulldown configuration for GPIO 64 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG64_b;
  } ;

  union {
    __IOM uint32_t PINCFG65;                    /*!< Controls the operation of GPIO pin 65.                                    */

    struct {
      __IOM uint32_t FNCSEL65   : 4;            /*!< Function select for GPIO pin 65                                           */
      __IOM uint32_t INPEN65    : 1;            /*!< Input enable for GPIO 65                                                  */
      __IOM uint32_t RDZERO65   : 1;            /*!< Return 0 for read data on GPIO 65                                         */
      __IOM uint32_t IRPTEN65   : 2;            /*!< Interrupt enable for GPIO 65                                              */
      __IOM uint32_t OUTCFG65   : 2;            /*!< Pin IO mode selection for GPIO pin 65                                     */
      __IOM uint32_t DS65       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 65                   */
      __IOM uint32_t SR65       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG65  : 3;            /*!< Pullup/Pulldown configuration for GPIO 65                                 */
      __IOM uint32_t NCESRC65   : 5;            /*!< IOMSTR Chip Select 65, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL65   : 1;            /*!< Polarity select for NCE for GPIO 65                                       */
      __IOM uint32_t TIMERSEL65 : 1;            /*!< Select if CT65 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN65     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN65     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG65 : 3;           /*!< Pullup/Pulldown configuration for GPIO 65 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG65_b;
  } ;

  union {
    __IOM uint32_t PINCFG66;                    /*!< Controls the operation of GPIO pin 66.                                    */

    struct {
      __IOM uint32_t FNCSEL66   : 4;            /*!< Function select for GPIO pin 66                                           */
      __IOM uint32_t INPEN66    : 1;            /*!< Input enable for GPIO 66                                                  */
      __IOM uint32_t RDZERO66   : 1;            /*!< Return 0 for read data on GPIO 66                                         */
      __IOM uint32_t IRPTEN66   : 2;            /*!< Interrupt enable for GPIO 66                                              */
      __IOM uint32_t OUTCFG66   : 2;            /*!< Pin IO mode selection for GPIO pin 66                                     */
      __IOM uint32_t DS66       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 66                   */
      __IOM uint32_t SR66       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG66  : 3;            /*!< Pullup/Pulldown configuration for GPIO 66                                 */
      __IOM uint32_t NCESRC66   : 5;            /*!< IOMSTR Chip Select 66, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL66   : 1;            /*!< Polarity select for NCE for GPIO 66                                       */
      __IOM uint32_t TIMERSEL66 : 1;            /*!< Select if CT66 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN66     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN66     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG66 : 3;           /*!< Pullup/Pulldown configuration for GPIO 66 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG66_b;
  } ;

  union {
    __IOM uint32_t PINCFG67;                    /*!< Controls the operation of GPIO pin 67.                                    */

