zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL67   : 4;            /*!< Function select for GPIO pin 67                                           */
      __IOM uint32_t INPEN67    : 1;            /*!< Input enable for GPIO 67                                                  */
      __IOM uint32_t RDZERO67   : 1;            /*!< Return 0 for read data on GPIO 67                                         */
      __IOM uint32_t IRPTEN67   : 2;            /*!< Interrupt enable for GPIO 67                                              */
      __IOM uint32_t OUTCFG67   : 2;            /*!< Pin IO mode selection for GPIO pin 67                                     */
      __IOM uint32_t DS67       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 67                   */
      __IOM uint32_t SR67       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG67  : 3;            /*!< Pullup/Pulldown configuration for GPIO 67                                 */
      __IOM uint32_t NCESRC67   : 5;            /*!< IOMSTR Chip Select 67, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL67   : 1;            /*!< Polarity select for NCE for GPIO 67                                       */
      __IOM uint32_t TIMERSEL67 : 1;            /*!< Select if CT67 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN67     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN67     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG67 : 3;           /*!< Pullup/Pulldown configuration for GPIO 67 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG67_b;
  } ;

  union {
    __IOM uint32_t PINCFG68;                    /*!< Controls the operation of GPIO pin 68.                                    */

    struct {
      __IOM uint32_t FNCSEL68   : 4;            /*!< Function select for GPIO pin 68                                           */
      __IOM uint32_t INPEN68    : 1;            /*!< Input enable for GPIO 68                                                  */
      __IOM uint32_t RDZERO68   : 1;            /*!< Return 0 for read data on GPIO 68                                         */
      __IOM uint32_t IRPTEN68   : 2;            /*!< Interrupt enable for GPIO 68                                              */
      __IOM uint32_t OUTCFG68   : 2;            /*!< Pin IO mode selection for GPIO pin 68                                     */
      __IOM uint32_t DS68       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 68                   */
      __IOM uint32_t SR68       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG68  : 3;            /*!< Pullup/Pulldown configuration for GPIO 68                                 */
      __IOM uint32_t NCESRC68   : 5;            /*!< IOMSTR Chip Select 68, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL68   : 1;            /*!< Polarity select for NCE for GPIO 68                                       */
      __IOM uint32_t TIMERSEL68 : 1;            /*!< Select if CT68 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN68     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN68     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG68 : 3;           /*!< Pullup/Pulldown configuration for GPIO 68 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG68_b;
  } ;

  union {
    __IOM uint32_t PINCFG69;                    /*!< Controls the operation of GPIO pin 69.                                    */

    struct {
      __IOM uint32_t FNCSEL69   : 4;            /*!< Function select for GPIO pin 69                                           */
      __IOM uint32_t INPEN69    : 1;            /*!< Input enable for GPIO 69                                                  */
      __IOM uint32_t RDZERO69   : 1;            /*!< Return 0 for read data on GPIO 69                                         */
      __IOM uint32_t IRPTEN69   : 2;            /*!< Interrupt enable for GPIO 69                                              */
      __IOM uint32_t OUTCFG69   : 2;            /*!< Pin IO mode selection for GPIO pin 69                                     */
      __IOM uint32_t DS69       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 69                   */
      __IOM uint32_t SR69       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG69  : 3;            /*!< Pullup/Pulldown configuration for GPIO 69                                 */
      __IOM uint32_t NCESRC69   : 5;            /*!< IOMSTR Chip Select 69, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL69   : 1;            /*!< Polarity select for NCE for GPIO 69                                       */
      __IOM uint32_t TIMERSEL69 : 1;            /*!< Select if CT69 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN69     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN69     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG69 : 3;           /*!< Pullup/Pulldown configuration for GPIO 69 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG69_b;
  } ;

  union {
    __IOM uint32_t PINCFG70;                    /*!< Controls the operation of GPIO pin 70.                                    */

