zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL70   : 4;            /*!< Function select for GPIO pin 70                                           */
      __IOM uint32_t INPEN70    : 1;            /*!< Input enable for GPIO 70                                                  */
      __IOM uint32_t RDZERO70   : 1;            /*!< Return 0 for read data on GPIO 70                                         */
      __IOM uint32_t IRPTEN70   : 2;            /*!< Interrupt enable for GPIO 70                                              */
      __IOM uint32_t OUTCFG70   : 2;            /*!< Pin IO mode selection for GPIO pin 70                                     */
      __IOM uint32_t DS70       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 70                   */
      __IOM uint32_t SR70       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG70  : 3;            /*!< Pullup/Pulldown configuration for GPIO 70                                 */
      __IOM uint32_t NCESRC70   : 5;            /*!< IOMSTR Chip Select 70, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL70   : 1;            /*!< Polarity select for NCE for GPIO 70                                       */
      __IOM uint32_t TIMERSEL70 : 1;            /*!< Select if CT70 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN70     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN70     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG70 : 3;           /*!< Pullup/Pulldown configuration for GPIO 70 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG70_b;
  } ;

  union {
    __IOM uint32_t PINCFG71;                    /*!< Controls the operation of GPIO pin 71.                                    */

    struct {
      __IOM uint32_t FNCSEL71   : 4;            /*!< Function select for GPIO pin 71                                           */
      __IOM uint32_t INPEN71    : 1;            /*!< Input enable for GPIO 71                                                  */
      __IOM uint32_t RDZERO71   : 1;            /*!< Return 0 for read data on GPIO 71                                         */
      __IOM uint32_t IRPTEN71   : 2;            /*!< Interrupt enable for GPIO 71                                              */
      __IOM uint32_t OUTCFG71   : 2;            /*!< Pin IO mode selection for GPIO pin 71                                     */
      __IOM uint32_t DS71       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 71                   */
      __IOM uint32_t SR71       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG71  : 3;            /*!< Pullup/Pulldown configuration for GPIO 71                                 */
      __IOM uint32_t NCESRC71   : 5;            /*!< IOMSTR Chip Select 71, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL71   : 1;            /*!< Polarity select for NCE for GPIO 71                                       */
      __IOM uint32_t TIMERSEL71 : 1;            /*!< Select if CT71 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN71     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN71     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG71 : 3;           /*!< Pullup/Pulldown configuration for GPIO 71 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG71_b;
  } ;

  union {
    __IOM uint32_t PINCFG72;                    /*!< Controls the operation of GPIO pin 72.                                    */

    struct {
      __IOM uint32_t FNCSEL72   : 4;            /*!< Function select for GPIO pin 72                                           */
      __IOM uint32_t INPEN72    : 1;            /*!< Input enable for GPIO 72                                                  */
      __IOM uint32_t RDZERO72   : 1;            /*!< Return 0 for read data on GPIO 72                                         */
      __IOM uint32_t IRPTEN72   : 2;            /*!< Interrupt enable for GPIO 72                                              */
      __IOM uint32_t OUTCFG72   : 2;            /*!< Pin IO mode selection for GPIO pin 72                                     */
      __IOM uint32_t DS72       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 72                   */
      __IOM uint32_t SR72       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG72  : 3;            /*!< Pullup/Pulldown configuration for GPIO 72                                 */
      __IOM uint32_t NCESRC72   : 5;            /*!< IOMSTR Chip Select 72, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL72   : 1;            /*!< Polarity select for NCE for GPIO 72                                       */
      __IOM uint32_t TIMERSEL72 : 1;            /*!< Select if CT72 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN72     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN72     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG72 : 3;           /*!< Pullup/Pulldown configuration for GPIO 72 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG72_b;
  } ;

  union {
    __IOM uint32_t PINCFG73;                    /*!< Controls the operation of GPIO pin 73.                                    */

