zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL79   : 4;            /*!< Function select for GPIO pin 79                                           */
      __IOM uint32_t INPEN79    : 1;            /*!< Input enable for GPIO 79                                                  */
      __IOM uint32_t RDZERO79   : 1;            /*!< Return 0 for read data on GPIO 79                                         */
      __IOM uint32_t IRPTEN79   : 2;            /*!< Interrupt enable for GPIO 79                                              */
      __IOM uint32_t OUTCFG79   : 2;            /*!< Pin IO mode selection for GPIO pin 79                                     */
      __IOM uint32_t DS79       : 2;            /*!< Drive strength selection for GPIO 79                                      */
      __IOM uint32_t SR79       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG79  : 3;            /*!< Pullup/Pulldown configuration for GPIO 79                                 */
      __IOM uint32_t NCESRC79   : 5;            /*!< IOMSTR Chip Select 79, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL79   : 1;            /*!< Polarity select for NCE for GPIO 79                                       */
      __IOM uint32_t TIMERSEL79 : 1;            /*!< Select if CT79 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN79     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN79     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG79 : 3;           /*!< Pullup/Pulldown configuration for GPIO 79 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG79_b;
  } ;

  union {
    __IOM uint32_t PINCFG80;                    /*!< Controls the operation of GPIO pin 80.                                    */

    struct {
      __IOM uint32_t FNCSEL80   : 4;            /*!< Function select for GPIO pin 80                                           */
      __IOM uint32_t INPEN80    : 1;            /*!< Input enable for GPIO 80                                                  */
      __IOM uint32_t RDZERO80   : 1;            /*!< Return 0 for read data on GPIO 80                                         */
      __IOM uint32_t IRPTEN80   : 2;            /*!< Interrupt enable for GPIO 80                                              */
      __IOM uint32_t OUTCFG80   : 2;            /*!< Pin IO mode selection for GPIO pin 80                                     */
      __IOM uint32_t DS80       : 2;            /*!< Drive strength selection for GPIO 80                                      */
      __IOM uint32_t SR80       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG80  : 3;            /*!< Pullup/Pulldown configuration for GPIO 80                                 */
      __IOM uint32_t NCESRC80   : 5;            /*!< IOMSTR Chip Select 80, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL80   : 1;            /*!< Polarity select for NCE for GPIO 80                                       */
      __IOM uint32_t TIMERSEL80 : 1;            /*!< Select if CT80 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN80     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN80     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG80 : 3;           /*!< Pullup/Pulldown configuration for GPIO 80 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG80_b;
  } ;

  union {
    __IOM uint32_t PINCFG81;                    /*!< Controls the operation of GPIO pin 81.                                    */

    struct {
      __IOM uint32_t FNCSEL81   : 4;            /*!< Function select for GPIO pin 81                                           */
      __IOM uint32_t INPEN81    : 1;            /*!< Input enable for GPIO 81                                                  */
      __IOM uint32_t RDZERO81   : 1;            /*!< Return 0 for read data on GPIO 81                                         */
      __IOM uint32_t IRPTEN81   : 2;            /*!< Interrupt enable for GPIO 81                                              */
      __IOM uint32_t OUTCFG81   : 2;            /*!< Pin IO mode selection for GPIO pin 81                                     */
      __IOM uint32_t DS81       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 81                   */
      __IOM uint32_t SR81       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG81  : 3;            /*!< Pullup/Pulldown configuration for GPIO 81                                 */
      __IOM uint32_t NCESRC81   : 5;            /*!< IOMSTR Chip Select 81, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL81   : 1;            /*!< Polarity select for NCE for GPIO 81                                       */
      __IOM uint32_t TIMERSEL81 : 1;            /*!< Select if CT81 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN81     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN81     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG81 : 3;           /*!< Pullup/Pulldown configuration for GPIO 81 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG81_b;
  } ;

  union {
    __IOM uint32_t PINCFG82;                    /*!< Controls the operation of GPIO pin 82.                                    */

