zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL106  : 4;            /*!< Function select for GPIO pin 106                                          */
      __IOM uint32_t INPEN106   : 1;            /*!< Input enable for GPIO 106                                                 */
      __IOM uint32_t RDZERO106  : 1;            /*!< Return 0 for read data on GPIO 106                                        */
      __IOM uint32_t IRPTEN106  : 2;            /*!< Interrupt enable for GPIO 106                                             */
      __IOM uint32_t OUTCFG106  : 2;            /*!< Pin IO mode selection for GPIO pin 106                                    */
      __IOM uint32_t DS106      : 2;            /*!< Drive strength selection for GPIO 106                                     */
      __IOM uint32_t SR106      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG106 : 3;            /*!< Pullup/Pulldown configuration for GPIO 106                                */
      __IOM uint32_t NCESRC106  : 5;            /*!< IOMSTR Chip Select 106, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL106  : 1;            /*!< Polarity select for NCE for GPIO 106                                      */
      __IOM uint32_t TIMERSEL106 : 1;           /*!< Select if CT106 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN106    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN106    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG106 : 3;          /*!< Pullup/Pulldown configuration for GPIO 106 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG106_b;
  } ;

  union {
    __IOM uint32_t PINCFG107;                   /*!< Controls the operation of GPIO pin 107.                                   */

    struct {
      __IOM uint32_t FNCSEL107  : 4;            /*!< Function select for GPIO pin 107                                          */
      __IOM uint32_t INPEN107   : 1;            /*!< Input enable for GPIO 107                                                 */
      __IOM uint32_t RDZERO107  : 1;            /*!< Return 0 for read data on GPIO 107                                        */
      __IOM uint32_t IRPTEN107  : 2;            /*!< Interrupt enable for GPIO 107                                             */
      __IOM uint32_t OUTCFG107  : 2;            /*!< Pin IO mode selection for GPIO pin 107                                    */
      __IOM uint32_t DS107      : 2;            /*!< Drive strength selection for GPIO 107                                     */
      __IOM uint32_t SR107      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG107 : 3;            /*!< Pullup/Pulldown configuration for GPIO 107                                */
      __IOM uint32_t NCESRC107  : 5;            /*!< IOMSTR Chip Select 107, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL107  : 1;            /*!< Polarity select for NCE for GPIO 107                                      */
      __IOM uint32_t TIMERSEL107 : 1;           /*!< Select if CT107 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN107    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN107    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG107 : 3;          /*!< Pullup/Pulldown configuration for GPIO 107 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG107_b;
  } ;

  union {
    __IOM uint32_t PINCFG108;                   /*!< Controls the operation of GPIO pin 108.                                   */

    struct {
      __IOM uint32_t FNCSEL108  : 4;            /*!< Function select for GPIO pin 108                                          */
      __IOM uint32_t INPEN108   : 1;            /*!< Input enable for GPIO 108                                                 */
      __IOM uint32_t RDZERO108  : 1;            /*!< Return 0 for read data on GPIO 108                                        */
      __IOM uint32_t IRPTEN108  : 2;            /*!< Interrupt enable for GPIO 108                                             */
      __IOM uint32_t OUTCFG108  : 2;            /*!< Pin IO mode selection for GPIO pin 108                                    */
      __IOM uint32_t DS108      : 2;            /*!< Drive strength selection for GPIO 108                                     */
      __IOM uint32_t SR108      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG108 : 3;            /*!< Pullup/Pulldown configuration for GPIO 108                                */
      __IOM uint32_t NCESRC108  : 5;            /*!< IOMSTR Chip Select 108, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL108  : 1;            /*!< Polarity select for NCE for GPIO 108                                      */
      __IOM uint32_t TIMERSEL108 : 1;           /*!< Select if CT108 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN108    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN108    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG108 : 3;          /*!< Pullup/Pulldown configuration for GPIO 108 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG108_b;
  } ;

  union {
    __IOM uint32_t PINCFG109;                   /*!< Controls the operation of GPIO pin 109.                                   */

