zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL109  : 4;            /*!< Function select for GPIO pin 109                                          */
      __IOM uint32_t INPEN109   : 1;            /*!< Input enable for GPIO 109                                                 */
      __IOM uint32_t RDZERO109  : 1;            /*!< Return 0 for read data on GPIO 109                                        */
      __IOM uint32_t IRPTEN109  : 2;            /*!< Interrupt enable for GPIO 109                                             */
      __IOM uint32_t OUTCFG109  : 2;            /*!< Pin IO mode selection for GPIO pin 109                                    */
      __IOM uint32_t DS109      : 2;            /*!< Drive strength selection for GPIO 109                                     */
      __IOM uint32_t SR109      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG109 : 3;            /*!< Pullup/Pulldown configuration for GPIO 109                                */
      __IOM uint32_t NCESRC109  : 5;            /*!< IOMSTR Chip Select 109, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL109  : 1;            /*!< Polarity select for NCE for GPIO 109                                      */
      __IOM uint32_t TIMERSEL109 : 1;           /*!< Select if CT109 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN109    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN109    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG109 : 3;          /*!< Pullup/Pulldown configuration for GPIO 109 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG109_b;
  } ;

  union {
    __IOM uint32_t PINCFG110;                   /*!< Controls the operation of GPIO pin 110.                                   */

    struct {
      __IOM uint32_t FNCSEL110  : 4;            /*!< Function select for GPIO pin 110                                          */
      __IOM uint32_t INPEN110   : 1;            /*!< Input enable for GPIO 110                                                 */
      __IOM uint32_t RDZERO110  : 1;            /*!< Return 0 for read data on GPIO 110                                        */
      __IOM uint32_t IRPTEN110  : 2;            /*!< Interrupt enable for GPIO 110                                             */
      __IOM uint32_t OUTCFG110  : 2;            /*!< Pin IO mode selection for GPIO pin 110                                    */
      __IOM uint32_t DS110      : 2;            /*!< Drive strength selection for GPIO 110                                     */
      __IOM uint32_t SR110      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG110 : 3;            /*!< Pullup/Pulldown configuration for GPIO 110                                */
      __IOM uint32_t NCESRC110  : 5;            /*!< IOMSTR Chip Select 110, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL110  : 1;            /*!< Polarity select for NCE for GPIO 110                                      */
      __IOM uint32_t TIMERSEL110 : 1;           /*!< Select if CT110 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN110    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN110    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG110 : 3;          /*!< Pullup/Pulldown configuration for GPIO 110 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG110_b;
  } ;

  union {
    __IOM uint32_t PINCFG111;                   /*!< Controls the operation of GPIO pin 111.                                   */

    struct {
      __IOM uint32_t FNCSEL111  : 4;            /*!< Function select for GPIO pin 111                                          */
      __IOM uint32_t INPEN111   : 1;            /*!< Input enable for GPIO 111                                                 */
      __IOM uint32_t RDZERO111  : 1;            /*!< Return 0 for read data on GPIO 111                                        */
      __IOM uint32_t IRPTEN111  : 2;            /*!< Interrupt enable for GPIO 111                                             */
      __IOM uint32_t OUTCFG111  : 2;            /*!< Pin IO mode selection for GPIO pin 111                                    */
      __IOM uint32_t DS111      : 2;            /*!< Drive strength selection for GPIO 111                                     */
      __IOM uint32_t SR111      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG111 : 3;            /*!< Pullup/Pulldown configuration for GPIO 111                                */
      __IOM uint32_t NCESRC111  : 5;            /*!< IOMSTR Chip Select 111, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL111  : 1;            /*!< Polarity select for NCE for GPIO 111                                      */
      __IOM uint32_t TIMERSEL111 : 1;           /*!< Select if CT111 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN111    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN111    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG111 : 3;          /*!< Pullup/Pulldown configuration for GPIO 111 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG111_b;
  } ;

  union {
    __IOM uint32_t PINCFG112;                   /*!< Controls the operation of GPIO pin 112.                                   */

