zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL112  : 4;            /*!< Function select for GPIO pin 112                                          */
      __IOM uint32_t INPEN112   : 1;            /*!< Input enable for GPIO 112                                                 */
      __IOM uint32_t RDZERO112  : 1;            /*!< Return 0 for read data on GPIO 112                                        */
      __IOM uint32_t IRPTEN112  : 2;            /*!< Interrupt enable for GPIO 112                                             */
      __IOM uint32_t OUTCFG112  : 2;            /*!< Pin IO mode selection for GPIO pin 112                                    */
      __IOM uint32_t DS112      : 2;            /*!< Drive strength control for High Speed GPIO width ODT 112                  */
      __IOM uint32_t SR112      : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG112 : 3;            /*!< Pullup/Pulldown configuration for GPIO 112                                */
      __IOM uint32_t NCESRC112  : 5;            /*!< IOMSTR Chip Select 112, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL112  : 1;            /*!< Polarity select for NCE for GPIO 112                                      */
      __IOM uint32_t TIMERSEL112 : 1;           /*!< Select if CT112 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN112    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN112    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG112 : 3;          /*!< Pullup/Pulldown configuration for GPIO 112 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG112_b;
  } ;

  union {
    __IOM uint32_t PINCFG113;                   /*!< Controls the operation of GPIO pin 113.                                   */

    struct {
      __IOM uint32_t FNCSEL113  : 4;            /*!< Function select for GPIO pin 113                                          */
      __IOM uint32_t INPEN113   : 1;            /*!< Input enable for GPIO 113                                                 */
      __IOM uint32_t RDZERO113  : 1;            /*!< Return 0 for read data on GPIO 113                                        */
      __IOM uint32_t IRPTEN113  : 2;            /*!< Interrupt enable for GPIO 113                                             */
      __IOM uint32_t OUTCFG113  : 2;            /*!< Pin IO mode selection for GPIO pin 113                                    */
      __IOM uint32_t DS113      : 2;            /*!< Drive strength selection for GPIO 113                                     */
      __IOM uint32_t SR113      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG113 : 3;            /*!< Pullup/Pulldown configuration for GPIO 113                                */
      __IOM uint32_t NCESRC113  : 5;            /*!< IOMSTR Chip Select 113, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL113  : 1;            /*!< Polarity select for NCE for GPIO 113                                      */
      __IOM uint32_t TIMERSEL113 : 1;           /*!< Select if CT113 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN113    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN113    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG113 : 3;          /*!< Pullup/Pulldown configuration for GPIO 113 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG113_b;
  } ;

  union {
    __IOM uint32_t PINCFG114;                   /*!< Controls the operation of GPIO pin 114.                                   */

    struct {
      __IOM uint32_t FNCSEL114  : 4;            /*!< Function select for GPIO pin 114                                          */
      __IOM uint32_t INPEN114   : 1;            /*!< Input enable for GPIO 114                                                 */
      __IOM uint32_t RDZERO114  : 1;            /*!< Return 0 for read data on GPIO 114                                        */
      __IOM uint32_t IRPTEN114  : 2;            /*!< Interrupt enable for GPIO 114                                             */
      __IOM uint32_t OUTCFG114  : 2;            /*!< Pin IO mode selection for GPIO pin 114                                    */
      __IOM uint32_t DS114      : 2;            /*!< Drive strength selection for GPIO 114                                     */
      __IOM uint32_t SR114      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG114 : 3;            /*!< Pullup/Pulldown configuration for GPIO 114                                */
      __IOM uint32_t NCESRC114  : 5;            /*!< IOMSTR Chip Select 114, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL114  : 1;            /*!< Polarity select for NCE for GPIO 114                                      */
      __IOM uint32_t TIMERSEL114 : 1;           /*!< Select if CT114 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN114    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN114    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG114 : 3;          /*!< Pullup/Pulldown configuration for GPIO 114 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG114_b;
  } ;

  union {
    __IOM uint32_t PINCFG115;                   /*!< Controls the operation of GPIO pin 115.                                   */

