zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL115  : 4;            /*!< Function select for GPIO pin 115                                          */
      __IOM uint32_t INPEN115   : 1;            /*!< Input enable for GPIO 115                                                 */
      __IOM uint32_t RDZERO115  : 1;            /*!< Return 0 for read data on GPIO 115                                        */
      __IOM uint32_t IRPTEN115  : 2;            /*!< Interrupt enable for GPIO 115                                             */
      __IOM uint32_t OUTCFG115  : 2;            /*!< Pin IO mode selection for GPIO pin 115                                    */
      __IOM uint32_t DS115      : 2;            /*!< Drive strength selection for GPIO 115                                     */
      __IOM uint32_t SR115      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG115 : 3;            /*!< Pullup/Pulldown configuration for GPIO 115                                */
      __IOM uint32_t NCESRC115  : 5;            /*!< IOMSTR Chip Select 115, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL115  : 1;            /*!< Polarity select for NCE for GPIO 115                                      */
      __IOM uint32_t TIMERSEL115 : 1;           /*!< Select if CT115 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN115    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN115    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG115 : 3;          /*!< Pullup/Pulldown configuration for GPIO 115 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG115_b;
  } ;

  union {
    __IOM uint32_t PINCFG116;                   /*!< Controls the operation of GPIO pin 116.                                   */

    struct {
      __IOM uint32_t FNCSEL116  : 4;            /*!< Function select for GPIO pin 116                                          */
      __IOM uint32_t INPEN116   : 1;            /*!< Input enable for GPIO 116                                                 */
      __IOM uint32_t RDZERO116  : 1;            /*!< Return 0 for read data on GPIO 116                                        */
      __IOM uint32_t IRPTEN116  : 2;            /*!< Interrupt enable for GPIO 116                                             */
      __IOM uint32_t OUTCFG116  : 2;            /*!< Pin IO mode selection for GPIO pin 116                                    */
      __IOM uint32_t DS116      : 2;            /*!< Drive strength selection for GPIO 116                                     */
      __IOM uint32_t SR116      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG116 : 3;            /*!< Pullup/Pulldown configuration for GPIO 116                                */
      __IOM uint32_t NCESRC116  : 5;            /*!< IOMSTR Chip Select 116, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL116  : 1;            /*!< Polarity select for NCE for GPIO 116                                      */
      __IOM uint32_t TIMERSEL116 : 1;           /*!< Select if CT116 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN116    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN116    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG116 : 3;          /*!< Pullup/Pulldown configuration for GPIO 116 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG116_b;
  } ;

  union {
    __IOM uint32_t PINCFG117;                   /*!< Controls the operation of GPIO pin 117.                                   */

    struct {
      __IOM uint32_t FNCSEL117  : 4;            /*!< Function select for GPIO pin 117                                          */
      __IOM uint32_t INPEN117   : 1;            /*!< Input enable for GPIO 117                                                 */
      __IOM uint32_t RDZERO117  : 1;            /*!< Return 0 for read data on GPIO 117                                        */
      __IOM uint32_t IRPTEN117  : 2;            /*!< Interrupt enable for GPIO 117                                             */
      __IOM uint32_t OUTCFG117  : 2;            /*!< Pin IO mode selection for GPIO pin 117                                    */
      __IOM uint32_t DS117      : 2;            /*!< Drive strength selection for GPIO 117                                     */
      __IOM uint32_t SR117      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG117 : 3;            /*!< Pullup/Pulldown configuration for GPIO 117                                */
      __IOM uint32_t NCESRC117  : 5;            /*!< IOMSTR Chip Select 117, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL117  : 1;            /*!< Polarity select for NCE for GPIO 117                                      */
      __IOM uint32_t TIMERSEL117 : 1;           /*!< Select if CT117 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN117    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN117    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG117 : 3;          /*!< Pullup/Pulldown configuration for GPIO 117 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG117_b;
  } ;

  union {
    __IOM uint32_t PINCFG118;                   /*!< Controls the operation of GPIO pin 118.                                   */

