zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FNCSEL118  : 4;            /*!< Function select for GPIO pin 118                                          */
      __IOM uint32_t INPEN118   : 1;            /*!< Input enable for GPIO 118                                                 */
      __IOM uint32_t RDZERO118  : 1;            /*!< Return 0 for read data on GPIO 118                                        */
      __IOM uint32_t IRPTEN118  : 2;            /*!< Interrupt enable for GPIO 118                                             */
      __IOM uint32_t OUTCFG118  : 2;            /*!< Pin IO mode selection for GPIO pin 118                                    */
      __IOM uint32_t DS118      : 2;            /*!< Drive strength selection for GPIO 118                                     */
      __IOM uint32_t SR118      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG118 : 3;            /*!< Pullup/Pulldown configuration for GPIO 118                                */
      __IOM uint32_t NCESRC118  : 5;            /*!< IOMSTR Chip Select 118, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL118  : 1;            /*!< Polarity select for NCE for GPIO 118                                      */
      __IOM uint32_t TIMERSEL118 : 1;           /*!< Select if CT118 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN118    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN118    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG118 : 3;          /*!< Pullup/Pulldown configuration for GPIO 118 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG118_b;
  } ;

  union {
    __IOM uint32_t PINCFG119;                   /*!< Controls the operation of GPIO pin 119.                                   */

    struct {
      __IOM uint32_t FNCSEL119  : 4;            /*!< Function select for GPIO pin 119                                          */
      __IOM uint32_t INPEN119   : 1;            /*!< Input enable for GPIO 119                                                 */
      __IOM uint32_t RDZERO119  : 1;            /*!< Return 0 for read data on GPIO 119                                        */
      __IOM uint32_t IRPTEN119  : 2;            /*!< Interrupt enable for GPIO 119                                             */
      __IOM uint32_t OUTCFG119  : 2;            /*!< Pin IO mode selection for GPIO pin 119                                    */
      __IOM uint32_t DS119      : 2;            /*!< Drive strength selection for GPIO 119                                     */
      __IOM uint32_t SR119      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG119 : 3;            /*!< Pullup/Pulldown configuration for GPIO 119                                */
      __IOM uint32_t NCESRC119  : 5;            /*!< IOMSTR Chip Select 119, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL119  : 1;            /*!< Polarity select for NCE for GPIO 119                                      */
      __IOM uint32_t TIMERSEL119 : 1;           /*!< Select if CT119 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN119    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN119    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG119 : 3;          /*!< Pullup/Pulldown configuration for GPIO 119 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG119_b;
  } ;
  __IM  uint32_t  RESERVED[136];

  union {
    __IOM uint32_t PADKEY;                      /*!< Lock state of the PINCFG and GPIO configuration registers. Write
                                                     a value of 0x73 to unlock write access to the PAD and GPIO.               */

    struct {
      __IOM uint32_t PADKEY     : 32;           /*!< Key register value.                                                       */
    } PADKEY_b;
  } ;

  union {
    __IOM uint32_t RD0;                         /*!< GPIO Input 0 (31-0)                                                       */

    struct {
      __IOM uint32_t RD0        : 32;           /*!< GPIO31-0 Reads pin state - read only. Returns the pad pin state
                                                     for pins 31-0 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD0_b;
  } ;

  union {
    __IOM uint32_t RD1;                         /*!< GPIO Input 1 (63-32)                                                      */

