zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t IOM1IRQ    : 7;            /*!< IOM1 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM1IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM2IRQ;                     /*!< IOM2 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM2IRQ    : 7;            /*!< IOM2 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM2IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM3IRQ;                     /*!< IOM3 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM3IRQ    : 7;            /*!< IOM3 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM3IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM4IRQ;                     /*!< IOM4 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM4IRQ    : 7;            /*!< IOM4 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM4IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM5IRQ;                     /*!< IOM5 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM5IRQ    : 7;            /*!< IOM5 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM5IRQ_b;
  } ;

  union {
    __IOM uint32_t SDIF0CDWP;                   /*!< SDIF0 CD and WP Select.                                                   */

    struct {
      __IOM uint32_t SDIF0CD    : 7;            /*!< SDIF0 CD pad select                                                       */
            uint32_t            : 1;
      __IOM uint32_t SDIF0WP    : 7;            /*!< SDIF0 WP pad select.                                                      */
            uint32_t            : 17;
    } SDIF0CDWP_b;
  } ;

  union {
    __IOM uint32_t SDIF1CDWP;                   /*!< SDIF1 CD and WP Select.                                                   */

    struct {
      __IOM uint32_t SDIF1CD    : 7;            /*!< SDIF1 CD pad select                                                       */
            uint32_t            : 1;
      __IOM uint32_t SDIF1WP    : 7;            /*!< SDIF1 WP pad select.                                                      */
            uint32_t            : 17;
    } SDIF1CDWP_b;
  } ;

  union {
    __IOM uint32_t OBSDATA;                     /*!< GPIO Observation mode sample                                              */

    struct {
      __IOM uint32_t OBSDATA    : 16;           /*!< Sample of the data output on the GPIO observation port. May
                                                     have async sampling issues, as the data is not synronized
                                                     to the read operation. Intended for debug purposes only.                  */
            uint32_t            : 16;
    } OBSDATA_b;
  } ;

  union {
    __IOM uint32_t IEOBS0;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 31-0 sent to the pad.                                                */

    struct {
      __IOM uint32_t IEDATA0    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS0_b;
  } ;

  union {
    __IOM uint32_t IEOBS1;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 63-32 sent to the pad.                                               */

    struct {
      __IOM uint32_t IEDATA1    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS1_b;
  } ;

  union {
    __IOM uint32_t IEOBS2;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 95-64 sent to the pad.                                               */

    struct {
      __IOM uint32_t IEDATA2    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS2_b;
  } ;

  union {
    __IOM uint32_t IEOBS3;                      /*!< Read only. Reflects the value of the input enable signals for
                                                     pads 127-96 sent to the pad.                                              */

    struct {
      __IOM uint32_t IEDATA3    : 32;           /*!< 1 indicates the input_en is active and the value of the pad
                                                     will be trasmitted to the internal logic within the device.               */
    } IEOBS3_b;
  } ;

  union {
    __IOM uint32_t OEOBS0;                      /*!< Read only. Reflects the value of the output enable signals for
                                                     pads 31-0 sent to the pad.                                                */

    struct {
      __IOM uint32_t OEDATA0    : 32;           /*!< The signal is negative active, and a value of 0 indicates the
                                                     output_en_ is active and the MCU will be driving the pad.                 */
    } OEOBS0_b;
  } ;

  union {
    __IOM uint32_t OEOBS1;                      /*!< Read only. Reflects the value of the output enable signals for
                                                     pads 63-32 sent to the pad.                                               */

