zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MCUN0GPIO0 : 1;            /*!< GPIO0 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO1 : 1;            /*!< GPIO1 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO2 : 1;            /*!< GPIO2 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO3 : 1;            /*!< GPIO3 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO4 : 1;            /*!< GPIO4 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO5 : 1;            /*!< GPIO5 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO6 : 1;            /*!< GPIO6 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO7 : 1;            /*!< GPIO7 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO8 : 1;            /*!< GPIO8 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO9 : 1;            /*!< GPIO9 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO10 : 1;           /*!< GPIO10 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO11 : 1;           /*!< GPIO11 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO12 : 1;           /*!< GPIO12 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO13 : 1;           /*!< GPIO13 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO14 : 1;           /*!< GPIO14 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO15 : 1;           /*!< GPIO15 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO16 : 1;           /*!< GPIO16 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO17 : 1;           /*!< GPIO17 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO18 : 1;           /*!< GPIO18 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO19 : 1;           /*!< GPIO19 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO20 : 1;           /*!< GPIO20 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO21 : 1;           /*!< GPIO21 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO22 : 1;           /*!< GPIO22 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO23 : 1;           /*!< GPIO23 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO24 : 1;           /*!< GPIO24 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO25 : 1;           /*!< GPIO25 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO26 : 1;           /*!< GPIO26 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO27 : 1;           /*!< GPIO27 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO28 : 1;           /*!< GPIO28 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO29 : 1;           /*!< GPIO29 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO30 : 1;           /*!< GPIO30 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO31 : 1;           /*!< GPIO31 MCU N0-priority interrupt                                          */
    } MCUN0INT0STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT0CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN0GPIO0 : 1;            /*!< GPIO0 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO1 : 1;            /*!< GPIO1 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO2 : 1;            /*!< GPIO2 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO3 : 1;            /*!< GPIO3 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO4 : 1;            /*!< GPIO4 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO5 : 1;            /*!< GPIO5 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO6 : 1;            /*!< GPIO6 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO7 : 1;            /*!< GPIO7 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO8 : 1;            /*!< GPIO8 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO9 : 1;            /*!< GPIO9 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO10 : 1;           /*!< GPIO10 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO11 : 1;           /*!< GPIO11 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO12 : 1;           /*!< GPIO12 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO13 : 1;           /*!< GPIO13 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO14 : 1;           /*!< GPIO14 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO15 : 1;           /*!< GPIO15 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO16 : 1;           /*!< GPIO16 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO17 : 1;           /*!< GPIO17 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO18 : 1;           /*!< GPIO18 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO19 : 1;           /*!< GPIO19 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO20 : 1;           /*!< GPIO20 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO21 : 1;           /*!< GPIO21 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO22 : 1;           /*!< GPIO22 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO23 : 1;           /*!< GPIO23 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO24 : 1;           /*!< GPIO24 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO25 : 1;           /*!< GPIO25 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO26 : 1;           /*!< GPIO26 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO27 : 1;           /*!< GPIO27 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO28 : 1;           /*!< GPIO28 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO29 : 1;           /*!< GPIO29 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO30 : 1;           /*!< GPIO30 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO31 : 1;           /*!< GPIO31 MCU N0-priority interrupt                                          */
    } MCUN0INT0CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT0SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

