zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MCUN0GPIO0 : 1;            /*!< GPIO0 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO1 : 1;            /*!< GPIO1 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO2 : 1;            /*!< GPIO2 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO3 : 1;            /*!< GPIO3 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO4 : 1;            /*!< GPIO4 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO5 : 1;            /*!< GPIO5 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO6 : 1;            /*!< GPIO6 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO7 : 1;            /*!< GPIO7 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO8 : 1;            /*!< GPIO8 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO9 : 1;            /*!< GPIO9 MCU N0-priority interrupt                                           */
      __IOM uint32_t MCUN0GPIO10 : 1;           /*!< GPIO10 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO11 : 1;           /*!< GPIO11 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO12 : 1;           /*!< GPIO12 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO13 : 1;           /*!< GPIO13 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO14 : 1;           /*!< GPIO14 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO15 : 1;           /*!< GPIO15 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO16 : 1;           /*!< GPIO16 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO17 : 1;           /*!< GPIO17 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO18 : 1;           /*!< GPIO18 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO19 : 1;           /*!< GPIO19 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO20 : 1;           /*!< GPIO20 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO21 : 1;           /*!< GPIO21 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO22 : 1;           /*!< GPIO22 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO23 : 1;           /*!< GPIO23 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO24 : 1;           /*!< GPIO24 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO25 : 1;           /*!< GPIO25 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO26 : 1;           /*!< GPIO26 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO27 : 1;           /*!< GPIO27 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO28 : 1;           /*!< GPIO28 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO29 : 1;           /*!< GPIO29 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO30 : 1;           /*!< GPIO30 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO31 : 1;           /*!< GPIO31 MCU N0-priority interrupt                                          */
    } MCUN0INT0SET_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT1EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN0GPIO32 : 1;           /*!< GPIO32 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO33 : 1;           /*!< GPIO33 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO34 : 1;           /*!< GPIO34 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO35 : 1;           /*!< GPIO35 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO36 : 1;           /*!< GPIO36 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO37 : 1;           /*!< GPIO37 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO38 : 1;           /*!< GPIO38 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO39 : 1;           /*!< GPIO39 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO40 : 1;           /*!< GPIO40 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO41 : 1;           /*!< GPIO41 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO42 : 1;           /*!< GPIO42 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO43 : 1;           /*!< GPIO43 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO44 : 1;           /*!< GPIO44 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO45 : 1;           /*!< GPIO45 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO46 : 1;           /*!< GPIO46 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO47 : 1;           /*!< GPIO47 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO48 : 1;           /*!< GPIO48 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO49 : 1;           /*!< GPIO49 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO50 : 1;           /*!< GPIO50 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO51 : 1;           /*!< GPIO51 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO52 : 1;           /*!< GPIO52 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO53 : 1;           /*!< GPIO53 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO54 : 1;           /*!< GPIO54 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO55 : 1;           /*!< GPIO55 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO56 : 1;           /*!< GPIO56 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO57 : 1;           /*!< GPIO57 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO58 : 1;           /*!< GPIO58 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO59 : 1;           /*!< GPIO59 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO60 : 1;           /*!< GPIO60 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO61 : 1;           /*!< GPIO61 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO62 : 1;           /*!< GPIO62 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO63 : 1;           /*!< GPIO63 MCU N0-priority interrupt                                          */
    } MCUN0INT1EN_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT1STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

