zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MCUN0GPIO64 : 1;           /*!< GPIO64 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO65 : 1;           /*!< GPIO65 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO66 : 1;           /*!< GPIO66 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO67 : 1;           /*!< GPIO67 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO68 : 1;           /*!< GPIO68 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO69 : 1;           /*!< GPIO69 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO70 : 1;           /*!< GPIO70 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO71 : 1;           /*!< GPIO71 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO72 : 1;           /*!< GPIO72 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO73 : 1;           /*!< GPIO73 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO74 : 1;           /*!< GPIO74 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO75 : 1;           /*!< GPIO75 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO76 : 1;           /*!< GPIO76 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO77 : 1;           /*!< GPIO77 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO78 : 1;           /*!< GPIO78 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO79 : 1;           /*!< GPIO79 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO80 : 1;           /*!< GPIO80 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO81 : 1;           /*!< GPIO81 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO82 : 1;           /*!< GPIO82 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO83 : 1;           /*!< GPIO83 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO84 : 1;           /*!< GPIO84 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO85 : 1;           /*!< GPIO85 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO86 : 1;           /*!< GPIO86 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO87 : 1;           /*!< GPIO87 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO88 : 1;           /*!< GPIO88 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO89 : 1;           /*!< GPIO89 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO90 : 1;           /*!< GPIO90 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO91 : 1;           /*!< GPIO91 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO92 : 1;           /*!< GPIO92 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO93 : 1;           /*!< GPIO93 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO94 : 1;           /*!< GPIO94 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO95 : 1;           /*!< GPIO95 MCU N0-priority interrupt                                          */
    } MCUN0INT2STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT2CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN0GPIO64 : 1;           /*!< GPIO64 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO65 : 1;           /*!< GPIO65 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO66 : 1;           /*!< GPIO66 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO67 : 1;           /*!< GPIO67 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO68 : 1;           /*!< GPIO68 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO69 : 1;           /*!< GPIO69 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO70 : 1;           /*!< GPIO70 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO71 : 1;           /*!< GPIO71 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO72 : 1;           /*!< GPIO72 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO73 : 1;           /*!< GPIO73 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO74 : 1;           /*!< GPIO74 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO75 : 1;           /*!< GPIO75 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO76 : 1;           /*!< GPIO76 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO77 : 1;           /*!< GPIO77 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO78 : 1;           /*!< GPIO78 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO79 : 1;           /*!< GPIO79 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO80 : 1;           /*!< GPIO80 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO81 : 1;           /*!< GPIO81 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO82 : 1;           /*!< GPIO82 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO83 : 1;           /*!< GPIO83 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO84 : 1;           /*!< GPIO84 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO85 : 1;           /*!< GPIO85 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO86 : 1;           /*!< GPIO86 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO87 : 1;           /*!< GPIO87 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO88 : 1;           /*!< GPIO88 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO89 : 1;           /*!< GPIO89 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO90 : 1;           /*!< GPIO90 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO91 : 1;           /*!< GPIO91 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO92 : 1;           /*!< GPIO92 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO93 : 1;           /*!< GPIO93 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO94 : 1;           /*!< GPIO94 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO95 : 1;           /*!< GPIO95 MCU N0-priority interrupt                                          */
    } MCUN0INT2CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT2SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

