zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MCUN0GPIO96 : 1;           /*!< GPIO96 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO97 : 1;           /*!< GPIO97 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO98 : 1;           /*!< GPIO98 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO99 : 1;           /*!< GPIO99 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO100 : 1;          /*!< GPIO100 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO101 : 1;          /*!< GPIO101 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO102 : 1;          /*!< GPIO102 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO103 : 1;          /*!< GPIO103 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO104 : 1;          /*!< GPIO104 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO105 : 1;          /*!< GPIO105 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO106 : 1;          /*!< GPIO106 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO107 : 1;          /*!< GPIO107 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO108 : 1;          /*!< GPIO108 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO109 : 1;          /*!< GPIO109 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO110 : 1;          /*!< GPIO110 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO111 : 1;          /*!< GPIO111 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO112 : 1;          /*!< GPIO112 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO113 : 1;          /*!< GPIO113 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO114 : 1;          /*!< GPIO114 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO115 : 1;          /*!< GPIO115 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO116 : 1;          /*!< GPIO116 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO117 : 1;          /*!< GPIO117 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO118 : 1;          /*!< GPIO118 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO119 : 1;          /*!< GPIO119 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO120 : 1;          /*!< GPIO120 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO121 : 1;          /*!< GPIO121 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO122 : 1;          /*!< GPIO122 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO123 : 1;          /*!< GPIO123 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO124 : 1;          /*!< GPIO124 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO125 : 1;          /*!< GPIO125 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO126 : 1;          /*!< GPIO126 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO127 : 1;          /*!< GPIO127 MCU N0-priority interrupt                                         */
    } MCUN0INT3STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT3CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN0GPIO96 : 1;           /*!< GPIO96 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO97 : 1;           /*!< GPIO97 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO98 : 1;           /*!< GPIO98 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO99 : 1;           /*!< GPIO99 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO100 : 1;          /*!< GPIO100 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO101 : 1;          /*!< GPIO101 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO102 : 1;          /*!< GPIO102 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO103 : 1;          /*!< GPIO103 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO104 : 1;          /*!< GPIO104 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO105 : 1;          /*!< GPIO105 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO106 : 1;          /*!< GPIO106 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO107 : 1;          /*!< GPIO107 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO108 : 1;          /*!< GPIO108 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO109 : 1;          /*!< GPIO109 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO110 : 1;          /*!< GPIO110 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO111 : 1;          /*!< GPIO111 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO112 : 1;          /*!< GPIO112 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO113 : 1;          /*!< GPIO113 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO114 : 1;          /*!< GPIO114 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO115 : 1;          /*!< GPIO115 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO116 : 1;          /*!< GPIO116 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO117 : 1;          /*!< GPIO117 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO118 : 1;          /*!< GPIO118 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO119 : 1;          /*!< GPIO119 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO120 : 1;          /*!< GPIO120 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO121 : 1;          /*!< GPIO121 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO122 : 1;          /*!< GPIO122 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO123 : 1;          /*!< GPIO123 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO124 : 1;          /*!< GPIO124 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO125 : 1;          /*!< GPIO125 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO126 : 1;          /*!< GPIO126 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO127 : 1;          /*!< GPIO127 MCU N0-priority interrupt                                         */
    } MCUN0INT3CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT3SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

