zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MCUN1GPIO64 : 1;           /*!< GPIO64 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO65 : 1;           /*!< GPIO65 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO66 : 1;           /*!< GPIO66 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO67 : 1;           /*!< GPIO67 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO68 : 1;           /*!< GPIO68 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO69 : 1;           /*!< GPIO69 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO70 : 1;           /*!< GPIO70 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO71 : 1;           /*!< GPIO71 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO72 : 1;           /*!< GPIO72 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO73 : 1;           /*!< GPIO73 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO74 : 1;           /*!< GPIO74 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO75 : 1;           /*!< GPIO75 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO76 : 1;           /*!< GPIO76 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO77 : 1;           /*!< GPIO77 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO78 : 1;           /*!< GPIO78 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO79 : 1;           /*!< GPIO79 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO80 : 1;           /*!< GPIO80 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO81 : 1;           /*!< GPIO81 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO82 : 1;           /*!< GPIO82 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO83 : 1;           /*!< GPIO83 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO84 : 1;           /*!< GPIO84 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO85 : 1;           /*!< GPIO85 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO86 : 1;           /*!< GPIO86 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO87 : 1;           /*!< GPIO87 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO88 : 1;           /*!< GPIO88 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO89 : 1;           /*!< GPIO89 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO90 : 1;           /*!< GPIO90 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO91 : 1;           /*!< GPIO91 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO92 : 1;           /*!< GPIO92 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO93 : 1;           /*!< GPIO93 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO94 : 1;           /*!< GPIO94 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO95 : 1;           /*!< GPIO95 MCU N1-priority interrupt                                          */
    } MCUN1INT2SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT3EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO96 : 1;           /*!< GPIO96 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO97 : 1;           /*!< GPIO97 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO98 : 1;           /*!< GPIO98 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO99 : 1;           /*!< GPIO99 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO100 : 1;          /*!< GPIO100 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO101 : 1;          /*!< GPIO101 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO102 : 1;          /*!< GPIO102 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO103 : 1;          /*!< GPIO103 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO104 : 1;          /*!< GPIO104 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO105 : 1;          /*!< GPIO105 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO106 : 1;          /*!< GPIO106 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO107 : 1;          /*!< GPIO107 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO108 : 1;          /*!< GPIO108 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO109 : 1;          /*!< GPIO109 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO110 : 1;          /*!< GPIO110 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO111 : 1;          /*!< GPIO111 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO112 : 1;          /*!< GPIO112 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO113 : 1;          /*!< GPIO113 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO114 : 1;          /*!< GPIO114 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO115 : 1;          /*!< GPIO115 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO116 : 1;          /*!< GPIO116 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO117 : 1;          /*!< GPIO117 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO118 : 1;          /*!< GPIO118 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO119 : 1;          /*!< GPIO119 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO120 : 1;          /*!< GPIO120 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO121 : 1;          /*!< GPIO121 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO122 : 1;          /*!< GPIO122 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO123 : 1;          /*!< GPIO123 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO124 : 1;          /*!< GPIO124 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO125 : 1;          /*!< GPIO125 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO126 : 1;          /*!< GPIO126 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO127 : 1;          /*!< GPIO127 MCU N1-priority interrupt                                         */
    } MCUN1INT3EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT3STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

