zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MCUN1GPIO96 : 1;           /*!< GPIO96 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO97 : 1;           /*!< GPIO97 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO98 : 1;           /*!< GPIO98 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO99 : 1;           /*!< GPIO99 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO100 : 1;          /*!< GPIO100 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO101 : 1;          /*!< GPIO101 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO102 : 1;          /*!< GPIO102 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO103 : 1;          /*!< GPIO103 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO104 : 1;          /*!< GPIO104 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO105 : 1;          /*!< GPIO105 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO106 : 1;          /*!< GPIO106 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO107 : 1;          /*!< GPIO107 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO108 : 1;          /*!< GPIO108 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO109 : 1;          /*!< GPIO109 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO110 : 1;          /*!< GPIO110 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO111 : 1;          /*!< GPIO111 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO112 : 1;          /*!< GPIO112 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO113 : 1;          /*!< GPIO113 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO114 : 1;          /*!< GPIO114 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO115 : 1;          /*!< GPIO115 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO116 : 1;          /*!< GPIO116 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO117 : 1;          /*!< GPIO117 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO118 : 1;          /*!< GPIO118 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO119 : 1;          /*!< GPIO119 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO120 : 1;          /*!< GPIO120 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO121 : 1;          /*!< GPIO121 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO122 : 1;          /*!< GPIO122 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO123 : 1;          /*!< GPIO123 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO124 : 1;          /*!< GPIO124 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO125 : 1;          /*!< GPIO125 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO126 : 1;          /*!< GPIO126 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO127 : 1;          /*!< GPIO127 MCU N1-priority interrupt                                         */
    } MCUN1INT3SET_b;
  } ;
} GPIO_Type;                                    /*!< Size = 1344 (0x540)                                                       */



/* =========================================================================================================================== */
/* ================                                            GPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Graphics Processing Unit (GPU)
  */

typedef struct {                                /*!< GPU Structure                                                             */

  union {
    __IOM uint32_t TEX0BASE;                    /*!< Base address of the drawing surface 0 (must be word aligned).             */

    struct {
      __IOM uint32_t Base       : 32;           /*!< Address 0: base address of the drawing surface 0 (must be word
                                                     aligned).                                                                 */
    } TEX0BASE_b;
  } ;

  union {
    __IOM uint32_t TEX0STRIDE;                  /*!< Image 0 mode and stride.                                                  */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< image stride (signed) distance in bytes from one scanline to
                                                     another                                                                   */
      __IOM uint32_t IMGMODE    : 8;            /*!< Image Mode                                                                */
      __IOM uint32_t IMGFMT     : 8;            /*!< Image Format                                                              */
    } TEX0STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX0RES;                     /*!< Image 0 resolution.                                                       */

