zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< DMA Enable for RX channel. Setting this bit to EN will start
                                                     the DMA operation. This should be the last DMA related
                                                     register set prior to issuing the command                                 */
      __IOM uint32_t RXDMAPRI   : 1;            /*!< Sets the Priority of the RXDMA request                                    */
            uint32_t            : 2;
      __IOM uint32_t TXDMAEN    : 1;            /*!< DMA Enable for TX channel. Setting this bit to EN will start
                                                     the DMA operation. This should be the last DMA related
                                                     register set prior to issuing the command                                 */
      __IOM uint32_t TXDMAPRI   : 1;            /*!< Sets the Priority of the TXDMA request                                    */
            uint32_t            : 2;
      __IOM uint32_t TXREQCNT   : 8;            /*!< Number of blocks of samples transferred before asserting the
                                                     TXREQCNT interrupt signal. A block is 8 samples. The interrupt
                                                     will assert if enabled and after TXREQCNT blocks of data
                                                     has been transferred to the I2S module from the device.
                                                     A value of 0 will cause the assertion of the interrupt
                                                     for every block of transfer done.                                         */
      __IOM uint32_t RXREQCNT   : 8;            /*!< Number of blocks of samples transferred before asserting the
                                                     RXREQCNT interrupt signal. A block is 8 samples. The interrupt
                                                     will assert if enabled and after RXREQCNT blocks of data
                                                     has been transferred from the I2S into the device. A value
                                                     of 0 will cause the assertion of the interrupt for every
                                                     block of transfer done.                                                   */
      __IOM uint32_t NEXTDMAEN  : 1;            /*!< Enable next DMA job auto-load feature                                     */
            uint32_t            : 7;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t RXDMATOTCNT;                 /*!< Contains the total count of samples to be stored for the current
                                                     RX DMA operation. This register is updated as DMA beats
                                                     complete.                                                                 */

    struct {
      __IOM uint32_t RXTOTCNT   : 12;           /*!< Number of 32b audio samples to transfer for RX DMA.                       */
            uint32_t            : 20;
    } RXDMATOTCNT_b;
  } ;

  union {
    __IOM uint32_t RXDMAADDR;                   /*!< The address which the DMA operation will store the incoming
                                                     audio samples. This address is updated as the samples are
                                                     stored.                                                                   */

    struct {
      __IOM uint32_t RXTARGADDR : 32;           /*!< Address bits of the target byte address for source of RX write
                                                     DMA.                                                                      */
    } RXDMAADDR_b;
  } ;

  union {
    __IOM uint32_t RXDMASTAT;                   /*!< Status of the RX DMA operation currently in progress.                     */

    struct {
      __IOM uint32_t RXDMATIP   : 1;            /*!< RX DMA Transfer In Progress indicator. 1 will indicate that
                                                     a DMA transfer is active. The DMA transfer may be waiting
                                                     on data, transferring data, or waiting for priority.All
                                                     of these will be indicated with a 1. A 0 will indicate
                                                     that the DMA is fully complete and no further transactions
                                                     will be done. This bit is read only.                                      */
      __IOM uint32_t RXDMACPL   : 1;            /*!< RX DMA Transfer Complete. This signals the end of the DMA operation.
                                                     This bit can be cleared by writing to 0, and will also
                                                     be cleared when a new DMA is started.                                     */
      __IOM uint32_t RXDMAERR   : 1;            /*!< RX DMA Error. This active high bit signals an error was encountered
                                                     during the DMA operation. The bit can be cleared by writing
                                                     to 0. Once set, this bit will remain set until cleared
                                                     by software.                                                              */
            uint32_t            : 29;
    } RXDMASTAT_b;
  } ;

  union {
    __IOM uint32_t TXDMATOTCNT;                 /*!< Contains the total count of samples to be read and transmitted
                                                     for the current TX DMA operation. This register is updated
                                                     as DMA beats complete.                                                    */

    struct {
      __IOM uint32_t TXTOTCNT   : 12;           /*!< Number of 32b audio samples to transmit                                   */
            uint32_t            : 20;
    } TXDMATOTCNT_b;
  } ;

  union {
    __IOM uint32_t TXDMAADDR;                   /*!< The address which the DMA operation will fetch the audio samples.
                                                     This address is updated as the samples are stored.                        */

