zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRSTATEN : 1;   /*!< Host Controller Internal Error Status Enable Enables the corresponding
                                                     interrupt bit. When set to 1'b1, HC_INTERNAL_ERR_STAT interrupts
                                                     shall be logged.                                                          */
      __IOM uint32_t HCSEQCANCELSTATEN : 1;     /*!< Host Controller Cancelled Transaction Sequence Enable Enables
                                                     the corresponding interrupt bit. When set to 1'b1, HC_SEQ_CANCEL_STAT_EN
                                                     interrupts shall be logged.                                               */
      __IOM uint32_t HCWARNCMDSEQSTALLSTATEN : 1;/*!< Host Controller Command Sequence Stall/Timeout Status Enable.
                                                     Enables the corresponding interrupt bit. When set to 1'b1,
                                                     interrupts for the corresponding interrupt bits in register
                                                     INTR_STATUS shall be logged.                                              */
      __IOM uint32_t HCERRCMDSEQTIMEOUTSTATEN : 1;/*!< Host Controller Command Sequence Stall/Timeout Status Enable.
                                                     Enables the corresponding interrupt bit. When set to 1'b1,
                                                     interrupts for the corresponding interrupt bits in register
                                                     INTR_STATUS shall be logged.                                              */
            uint32_t            : 18;
    } INTRSTATUSENABLE_b;
  } ;

  union {
    __IOM uint32_t INTRSIGNALENABLE;            /*!< Interrupt Signal Enable register is used to enable reporting
                                                     of outstnding interrupts received by Host Controller.                     */

    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRSIGNALEN : 1; /*!< Host Controller Internal Error Signal Enable When set to 1'b1
                                                     and field HC_INTERNAL_ERR_SIGNAL_STAT is set; the Host
                                                     Controller asserts an interrupt to the Host.                              */
      __IOM uint32_t HCSEQCANCELSIGNALEN : 1;   /*!< Host Controller Cancelled Transaction Sequence Signal Enable
                                                     When set to 1'b1 and field HC_SEQ_CANCEL_STAT is set; the
                                                     Host Controller asserts an interrupt to the Host.                         */
      __IOM uint32_t HCWARNCMDSEQSTALLSIGNALEN : 1;/*!< Host Controller Command Sequence Stall/Timeout Signal Enable.
                                                     When set to 1'b1 and the corresponding field in register
                                                     INTR_STATUS is set, the Host Controller asserts an interrupt
                                                     to the Host.                                                              */
      __IOM uint32_t HCERRCMDSEQTIMEOUTSIGNALEN : 1;/*!< Host Controller Command Sequence Stall/Timeout Signal Enable.
                                                     When set to 1'b1 and the corresponding field in register
                                                     INTR_STATUS is set, the Host Controller asserts an interrupt
                                                     to the Host.                                                              */
            uint32_t            : 18;
    } INTRSIGNALENABLE_b;
  } ;

  union {
    __IOM uint32_t INTRFORCE;                   /*!< Interrupt Force Register is used to force specific interrupt.
                                                     This register can be used for debug purposes.                             */

    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRFORCE : 1;    /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt to be sent to Host, if the corresponding fields
                                                     are set in registers INTR_STATUS_ENABLE and INTR_SIGNAL_ENABLE            */
      __IOM uint32_t HCSEQCANCELFORCE : 1;      /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt to be sent to Host, if the corresponding fields
                                                     are set in registers INTR_STATUS_ENABLE and INTR_SIGNAL_ENABLE            */
      __IOM uint32_t HCWARNCMDSEQSTALLFORCE : 1;/*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt to be sent to Host, if the corresponding fields
                                                     are set in registers INTR_STATUS_ENABLE and INTR_SIGNAL_ENABLE            */
      __IOM uint32_t HCERRCMDSEQTIMEOUTFORCE : 1;/*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt to be sent to Host, if the corresponding fields
                                                     are set in registers INTR_STATUS_ENABLE and INTR_SIGNAL_ENABLE            */
            uint32_t            : 18;
    } INTRFORCE_b;
  } ;

  union {
    __IOM uint32_t DATSECTIONOFFSET;            /*!< Device Address Table Pointer register is used to store DAT offset
                                                     and size.                                                                 */

    struct {
      __IOM uint32_t DATTABLEOFFSET : 12;       /*!< DAT Table Offset Offset of the DAT relative to the BASE address
                                                     of the current HCI. If the Host Controller does not support
                                                     implementing the DAT in registers (thereby forcing the
                                                     Software to provide the Device Context in memory), then
                                                     it should indicate this by setting this field to 12h000.                  */
      __IOM uint32_t DATTABLESIZE : 7;          /*!< DAT Table Size Size of the DAT, in entries. The total DAT table
                                                     size is DATENTRYSIZE*DATTABLESIZE                                         */
            uint32_t            : 9;
      __IOM uint32_t DATENTRYSIZE : 4;          /*!< DAT Entry Size. Size of individual entry in thr DAT table, in
                                                     DWORDs. Values: 0x0: DAT table entry size in 2 DWORDs.
                                                     0x1 - 0x15: Reserved for future.                                          */
    } DATSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t DCTSECTIONOFFSET;            /*!< Device Characteristics Table Pointer is used to store DCT offset
                                                     and size                                                                  */

