zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t DCTTABLEOFFSET : 12;       /*!< DCT Table Offset Offset of the DCT relative to the BASE address
                                                     of the current HCI. If the Host Controller does not support
                                                     implementing the DCT in registers, thereby forcing the
                                                     Software to provide the Device Context, then it should
                                                     indicate this by providing this field to 12h000.                          */
      __IOM uint32_t DCTTABLESIZE : 7;          /*!< DCT Table Size Size of the DCT, in entries. The total DCT table
                                                     size is DCTENTRYSIZE*DCTTABLESIZE.                                        */
      __IOM uint32_t DCTTABLEINDEX : 5;         /*!< DCT Table Index Current index of the DCT, which is used as the
                                                     starting index for the I3C ENTDAA CCC. Once the complete
                                                     characteristics of device that won the arbitration are
                                                     written to the DCT (during ENTDAA using Address Assignment
                                                     Command) this index is incremented by 1. If needed, the
                                                     software may override starting DCT index by setting this
                                                     field.                                                                    */
            uint32_t            : 4;
      __IOM uint32_t DCTENTRYSIZE : 4;          /*!< DCT Entry Sie. Size of individual entry in the DCT table, in
                                                     DWORDs. Values: 0x0: DCT table entry size is 4 DWORDs.
                                                     0x1 - 0x15: Reserved for future use.                                      */
    } DCTSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t RINGHEADERSSECTIONOFFSET;    /*!< Ring Headers Section Offset                                               */

    struct {
      __IOM uint32_t RHSECTIONOFFSET : 16;      /*!< Ring Headers Section Offset. Offset of Ring Headers register
                                                     section of the Register Map, relative to BASE address of
                                                     the current HCI. A value of 0 indicates that the section
                                                     is not implemented.                                                       */
            uint32_t            : 16;
    } RINGHEADERSSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t PIOSECTIONOFFSET;            /*!< PIO Section Offset register.                                              */

    struct {
      __IOM uint32_t PIOSECTIONOFFSET : 16;     /*!< PIO Section Offset. Offset of PIO registers section of the Register
                                                     Map, relative to BASE address of the current HCI. A value
                                                     of 0 indicates the PIO section is not implemented.                        */
            uint32_t            : 16;
    } PIOSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t EXTCAPSSECTIONOFFSET;        /*!< Extended Capabilities Section Offset                                      */

    struct {
      __IOM uint32_t EXTCAPSSECTIONOFFSET : 16; /*!< Extended Capabilities Section Offset. Offset of the Extended
                                                     Capabilities registers section of the register map, relative
                                                     to the BASE address of the current HCI. A value of 0 in
                                                     this field indicates that the Extended Capabilities section
                                                     is not implemented.                                                       */
            uint32_t            : 16;
    } EXTCAPSSECTIONOFFSET_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t INTCTRLCMDSEN;               /*!< Internal Control Command Subtype Support                                  */

    struct {
      __IOM uint32_t ICCSUPPORT : 1;            /*!< Internal Control Commands Supported. Values: 0x1: Some or all
                                                     Internal Control Command sub-commands are supported. 0x0:
                                                     Illegal value, do not use.                                                */
      __IOM uint32_t MIPICMDSSUPPORTED : 15;    /*!< MIPI Alliance Commands Supported The Host Controller provides
                                                     a read-only bitmask of the Internal Control Command subcommands
                                                     that are supported (see Section 8.4.5 and Table 97). Each
                                                     value of field MIPI_CMD greater than 0 (as defined in Table
                                                     97) that is supported for an Internal Control Command shall
                                                     have the corresponding bit position set to a value of 1'b1.
                                                     Example: Bit 4 shall be set to 1'b1, since the Target Reset
                                                     Pattern Command (i.e., MIPI_CMD=0x4) is required to be
                                                     supported. Bit 5 shall be set to 1'b1, since at least some
                                                     of the Controller SDA Recovery or Bus Reset Procedures
                                                     (i.e., MIPI_CMD=0x5) are required to be supported. Note:-
                                                     SDA Recovery is not implemented in the current IP version
                                                     This will be added as mandatory feature.                                  */
            uint32_t            : 16;
    } INTCTRLCMDSEN_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t IBINOTIFYCTRL;               /*!< The IBI Notify Control Register enables or disables event notifications
                                                     for the IBI Queue/Ring.                                                   */

