zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t NOTIFYHJREJECTED : 1;      /*!< Notify Rejected Hot-Join Control. Enables or disables reporting
                                                     rejection of individual Hot Join requests. Values: 0x0:
                                                     DISABLED: Do not pass rejected IBI Status to IBI Queue,
                                                     if the incoming Hot- Join request is NACKed and is auto-
                                                     disabled based on field HOT_JOIN_CTRL of HC_CONTROL. 0x1:
                                                     ENABLED: Pass rejected IBI Status to the IBI Queue, if
                                                     the incoming Hot Join request is NACKed and is auto-disabled
                                                     based on field HOT_JOIN_CTRL of HC_CONTROL.                               */
      __IOM uint32_t NOTIFYCRREJECTED : 1;      /*!< Notify Rejected Controller-role Request Control. Enables or
                                                     disables reporting rejection of individual Master Requests.
                                                     Values: 0x0: DISABLED: Do not pass rejected IBI Status
                                                     to IBI Queue/Ring, if the incoming Controller-role Request
                                                     is NACKed and is auto- disabled based on the CRR_REJECT
                                                     field in relevant DAT entry. 0x1: ENABLED: Pass rejected
                                                     IBI Status to the IBI Queue, if the incoming Controller-role
                                                     Request is NACKed and is auto-disabled based on the CRR_REJECT
                                                     field in relevant DAT entry.                                              */
            uint32_t            : 1;
      __IOM uint32_t NOTIFYIBIREJECTED : 1;     /*!< Notify Rejected In-Band Interrupt Request Control. Enables or
                                                     disables reporting rejection of In-Band Interrupt Requests
                                                     (IBIs). Values: 0x0: DISABLED: Do not pass rejected IBI
                                                     Status to the IBI Queue/Rings, if the incoming IBI is NACKed
                                                     and is auto- disabled based on IBI_REJECT field in relevant
                                                     DAT entry. 0x1: ENABLED: Pass rejected IBI Status to the
                                                     IBI Queue/Rings, if the incoming IBI is NACKed and is auto-disabled
                                                     based on IBI_REJECT field in relevant DAT entry.                          */
            uint32_t            : 28;
    } IBINOTIFYCTRL_b;
  } ;
  __IM  uint32_t  RESERVED3[105];

  union {
    __IOM uint32_t DAT0;                        /*!< Device Address Table 0                                                    */

    struct {
      __IOM uint32_t STATICADDRESS : 7;         /*!< Device Static Address I3C / I2C Static Address                            */
            uint32_t            : 5;
      __IOM uint32_t IBIPAYLOAD : 1;            /*!< Device IBI Payload. Indicates whether IBIs from this Device
                                                     have a Data Payload. This field reflects the IBI Payload
                                                     bit in the Devices Bus Characteristics Register (BCR).
                                                     During IBI handling for this Device, the Master shall use
                                                     this field to determine whether or not to drive reception
                                                     of the IBI Data Payload. Data continuation is indicated
                                                     by the T-Bit. Values: 0x0: NO_PAYLOAD: IBIs from this Device
                                                     do not carry a Data Payload 1'b1: PAYLOAD: IBIs from this
                                                     Device do carry a Data Payload                                            */
      __IOM uint32_t IBIREJECT  : 1;            /*!< Device In-Band Interrupt Request Reject. Controls whether this
                                                     Device, when operating in the Master role, will accept
                                                     vs. reject In_Band Interrupt Requests from the Target Device
                                                     indicated by this DAT entry. Values: 0x0: ACCEPT: ACK the
                                                     IBI Requests from this Target 0x1: REJECT: NACK the IBI
                                                     and send the auto-disable CCC                                             */
      __IOM uint32_t MRREJECT   : 1;            /*!< Device In-Band Master Request Reject. Controls whether this
                                                     Device, when operating in the Current Master role, shall
                                                     accept vs. reject Mastership requests from the Secondary
                                                     Master Device indicsted in the DAT entry. This bit is only
                                                     valid if the Host Controller declares Non-Current Master
                                                     Capability. Values: 0x0: ACCEPT: ACK Mastership Requests
                                                     from teh Secondary Master. 1'b1: REJECT: NACK Mastership
                                                     Requests and send the auto- disable CCC                                   */
      __IOM uint32_t TS         : 1;            /*!< Device IBI Timestamp. Enables or disables IBI timestamping for
                                                     a specific Device. Note: The IBI Status Descriptor for
                                                     each IBI event indicates whether or not the individual
                                                     IBI event was actually timestamped. Values: 0x0: NO_TS:
                                                     The Master shall not timestamp IBIs from this Device with
                                                     Master Timestamps. 0x1: TS: The Master shall timestamp
                                                     IBIs for this Device with Master Timestamps                               */
      __IOM uint32_t DAT0DYNAMICADDRESS : 8;    /*!< Device I3C Dynamic Address. Bits [22:16]: Shall contain the
                                                     Dynamic Address. A Dynamic Address of 7'h00 indicates that
                                                     thsi DAT entry is disabled. Bit [23]: is the Parity Bit,
                                                     per the I3C Specification, computed and updated by the
                                                     software Driver.                                                          */
            uint32_t            : 2;
      __IOM uint32_t RINGID     : 3;            /*!< Device Ring Group ID. Used to send an IBI from a specific Device
                                                     to the appropriate Ring Bundle.                                           */
      __IOM uint32_t DEVNACKRETRYCNT : 2;       /*!< Device NACK Retry Count Device-specific retry count. Values:
                                                     0x0: No retries on NACK (does not apply to Direct CCCs
                                                     0x1-0x3: Up to 1-3 Retries on NACK.                                       */
      __IOM uint32_t DEVICE     : 1;            /*!< Device Type Values: 0x0: I3C: I3C Device 0x1: I2C: I2C Device             */
    } DAT0_b;
  } ;

  union {
    __IOM uint32_t DAT1;                        /*!< Device Address Table 1                                                    */

