zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t AUTOCMDMASK : 8;           /*!< Device Auto-Command Mask Mask for the IBI Mandatory Byte that
                                                     will trigger an Auto-Command Read transaction on the I3C
                                                     Bus.                                                                      */
      __IOM uint32_t AUTOCMDVALUE : 8;          /*!< Device Auto-Command IBI Mandatory Byte Value Value of the IBI
                                                     Mandatory Byte that will trigger an Auto-Command Read transaction
                                                     on the I3C Bus                                                            */
      __IOM uint32_t AUTOCMDMODE : 3;           /*!< Device Auto-Command Mode Indicates the mode and speed for the
                                                     Auto- Command Read. This field is only valid for the Device
                                                     in I3C Mode (see the DEVICE field in the DAT Table entry
                                                     indexed by field DEV_INDEX). Values for I3C Mode: 0x0:
                                                     I3C SDR0 Standard SDR Speed, fSCL Max (12.5MHz) 0x1: I3C
                                                     SDR1 8 MHz sustainable data rate 0x2: I3C SDR2 6 MHz sustainable
                                                     data rate 0x3: I3C SDR3 4 MHz sustainable data rate 0x4:
                                                     I3C SDR4 2 MHz sustainable data rate 0x5: I3C HDR-TS HDR-Ternary
                                                     Mode. Selection of HDR- TSP vs. HDR-TSL depends on the
                                                     value of register HC_CONTROL, field I2C_SLAVE_PRESENT.
                                                     0x6: I3C HDR-DDR HDR- Double Data Rate Mode 0x7: Reserved                 */
      __IOM uint32_t AUTOCMDHDRCODE : 8;        /*!< Device Auto-Command HDR Command Code Specifies Auto-Command
                                                     Read Command Code. Only valid if Read is executed in HDR
                                                     Mode. If value is below 0x80, then the Host Controller
                                                     shall use 0x80 for HDR Command Code.                                      */
            uint32_t            : 5;
    } DAT1_b;
  } ;
  __IM  uint32_t  RESERVED4[62];

  union {
    __IOM uint32_t DCT0;                        /*!< Device Characteristics Table 0                                            */

    struct {
      __IOM uint32_t DCT0PID    : 32;           /*!< Device Provisional ID High Bits [48:16] of Devices I3C PID.               */
    } DCT0_b;
  } ;

  union {
    __IOM uint32_t DCT1;                        /*!< Device Characteristics Table 1                                            */

    struct {
      __IOM uint32_t DCT1PID    : 16;           /*!< Device Provisional ID Low Bits [15:0] of Devices I3C PID.                 */
            uint32_t            : 16;
    } DCT1_b;
  } ;

  union {
    __IOM uint32_t DCT2;                        /*!< Device Characteristics Table 2                                            */

    struct {
      __IOM uint32_t DCR        : 8;            /*!< Device DCR Value of Devices I3C Device Characteristics Register.          */
      __IOM uint32_t BCR        : 8;            /*!< Device BCR Value of Devices I3C Bus Characteristics Register.             */
            uint32_t            : 16;
    } DCT2_b;
  } ;

  union {
    __IOM uint32_t DCT3;                        /*!< Device Characteristics Table 3                                            */

    struct {
      __IOM uint32_t DCT3DYNAMICADDRESS : 8;    /*!< Device I3C Dynamic Address Includes Parity Bit.                           */
            uint32_t            : 24;
    } DCT3_b;
  } ;
  __IM  uint32_t  RESERVED5[124];

  union {
    __IOM uint32_t COMMANDQUEUEPORT;            /*!< COMMAND_QUEUE_PORT                                                        */

    struct {
      __IOM uint32_t CQDATA     : 32;           /*!< Data for command queue                                                    */
    } COMMANDQUEUEPORT_b;
  } ;

  union {
    __IOM uint32_t RESPONSEQUEUEPORT;           /*!< RESPONSE_QUEUE_PORT                                                       */

    struct {
      __IOM uint32_t RQDATA     : 32;           /*!< Data read from response queue.                                            */
    } RESPONSEQUEUEPORT_b;
  } ;

  union {
    __IOM uint32_t XFERDATAPORT;                /*!< XFER_DATA_PORT                                                            */

    struct {
      __IOM uint32_t XFERDATA   : 32;           /*!< Data read from Rx Data Buffer. The Receive data port is mapped
                                                     to the RxData Buffer. The Receive data is always packed
                                                     in 4-byte aligned and stored in the Rx-Data Buffer. If
                                                     the command length is not aligned to the 4-bytes, then
                                                     there will be unused bytes in the end location of the transfer
                                                     bytes. Data written to Tx Data Buffer. The Transmit Data
                                                     port is mapped to the Tx-Data Buffer. The transmit data
                                                     should always be packed in 4-byte aligned and written to
                                                     the Transmit data port register. If the Command length
                                                     is not aligned to the 4-bytes, then there will be unused
                                                     bytes in the end location of the transfer bytes.                          */
    } XFERDATAPORT_b;
  } ;

  union {
    __IOM uint32_t IBIPORT;                     /*!< IBI_PORT                                                                  */

