zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t CRQUEUESIZE : 8;           /*!< Command/Response Queue Size Zero-based size, in Command Descriptor
                                                     / Response Descriptor in entries. Note that the Command
                                                     Descriptor size is two DWORDs, and the Response Descriptor
                                                     size is one DWORD. Values: 2 255 DWORDs                                   */
      __IOM uint32_t IBI        : 8;            /*!< R IMPL IBI Size Zero-based size of IBI Status / IBI Data Payload
                                                     entries, in DWORDs. This field sets the maximum valid index
                                                     for programming both IBI Status and IBI Threshold, because
                                                     IBI Status Descriptor entries and IBI Data Payload entries
                                                     are both put to the same Queue. Values: 2 255 DWORDs                      */
      __IOM uint32_t RXDATABUFFERSIZE : 8;      /*!< Receive Data Buffer Size In DWORDs Values: 0x0: 2 DWORDs 0x1:
                                                     4 DWORDs 0x2: 8 DWORDs 0x3: 16 DWORDs 0x4: 32 DWORDs 0x5:
                                                     64 DWORDs 0x6: 128 DWORDs 0x7: 256 DWORDs                                 */
      __IOM uint32_t TXDATABUFFERSIZE : 8;      /*!< Transmit Data Buffer Size In DWORDs Values: 0x0: 2 DWORDs 0x1:
                                                     4 DWORDs 0x2: 8 DWORDs 0x3: 16 DWORDs 0x4: 32 DWORDs 0x5:
                                                     64 DWORDs 0x6: 128 DWORDs 0x7: 256 DWORDs                                 */
    } QUEUESIZECTRL_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t PIOINTRSTATUS;               /*!< PIO_INTR_STATUS                                                           */

    struct {
      __IOM uint32_t TXTHLDSTAT : 1;            /*!< Tx Data Buffer Threshold Status The Host Controller shall set
                                                     this bit to 1'b1 when the number of entries in the Tx Data
                                                     Queue is LE the TX_BUF_THLD threshold (see register DATA_BUFFER_THLD_CTRL
                                                     . The Host Controller shall automatically clear this field
                                                     to 1'b0 when the number of Tx Data Queue entries exceeds
                                                     the TX_BUF_THOLD threshold.                                               */
      __IOM uint32_t RXTHLDSTAT : 1;            /*!< Rx Data Buffer Threshold Status The Host Controller shall set
                                                     this bit to 1'b1 when the number of entries in the Rx Data
                                                     Queue is GE the RX_BUF_THLD threshold (see register DATA_BUFFER_THLD_CTRL
                                                     . The Host Controller shall automatically clear this field
                                                     to 1'b0 when the number of Rx Data Queue entries falls
                                                     below the RX_BUF_THLD threshold.                                          */
      __IOM uint32_t IBISTATUSTHLDSTAT : 1;     /*!< IBI Status Threshold Status The Host Controller shall set this
                                                     bit to 1'b1 when the number of IBI Status Entries in the
                                                     IBI Queue reaches the IBI_STATUS_THLD threshold (see register
                                                     QUEUE_THLD_CTRL). The Host Controller shall automatically
                                                     clear this field to 1'b0 when the number of IBI Status
                                                     entries in the IBI Queue falls below the IBI_STATUS_THLD
                                                     threshold as a result of application reads.                               */
      __IOM uint32_t CMDQUEUEREADYSTAT : 1;     /*!< Command Queue Ready Status The Host Controller shall set this
                                                     bit to 1'b1 when the number of Command Queue entries is
                                                     LE the CMD_EMPTY_BUF_THLD threshold (see register QUEUE_THLD_CTRL).
                                                     The Host Controller shall automatically clear this field
                                                     to 1'b0 when the number of Command Queue entries exceeds
                                                     the RESP_BUF_THLD threshold.                                              */
      __IOM uint32_t RESPREADYSTAT : 1;         /*!< Response Ready Status The Host Controller shall set this bit
                                                     to 1'b1 when the number of Response Queue entries is GE
                                                     the RESP_BUF_THLD threshold (see register QUEUE_THLD_CTRL).
                                                     The Host Controller shall automatically clear this field
                                                     to 1'b0 when the number of Response Queue entries falls
                                                     below the RESP_BUF_THLD threshold.                                        */
      __IOM uint32_t PIOTRANSFERABORTSTAT : 1;  /*!< Transfer Abort Status The Host Controller shall set this bit
                                                     to 1'b1 when any transfer is aborted. To clear, write 1'b0
                                                     to this bit.                                                              */
            uint32_t            : 3;
      __IOM uint32_t PIOTRANSFERERRSTAT : 1;    /*!< Transfer Error Status The Host Controller shall set this bit
                                                     to 1'b1 when any transfer error occurs on the I3C Bus.
                                                     The Error Type for this error shall be available in the
                                                     Response structure corresponding to this transfer/command.
                                                     To clear, write 1'b0 to this bit.                                         */
            uint32_t            : 22;
    } PIOINTRSTATUS_b;
  } ;

  union {
    __IOM uint32_t PIOINTRSTATUSENABLE;         /*!< PIO_INTR_STATUS_ENABLE                                                    */

