zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t TXTHLDSTATEN : 1;          /*!< When set to 1'b1, enables interrupt status logging for TX_THLD_STAT       */
      __IOM uint32_t RXTHLDSTATEN : 1;          /*!< When set to 1'b1, enables interrupt status logging for RX_THLD_STAT       */
      __IOM uint32_t IBISTATUSTHLDSTATEN : 1;   /*!< When set to 1'b1, enables interrupt status logging for IBI_STATUS_THLD_STAT */
      __IOM uint32_t CMDQUEUEREADYSTATEN : 1;   /*!< When set to 1'b1, enables interrupt status logging for CMD_QUEUE_READY_STAT */
      __IOM uint32_t RESPREADYSTATEN : 1;       /*!< When set to 1'b1, enables interrupt status logging for RESP_READY_STAT    */
      __IOM uint32_t PIOTRANSFERABORTSTATEN : 1;/*!< When set to 1'b1, enables interrupt status logging for TRANSFER_ABORT_STAT */
            uint32_t            : 3;
      __IOM uint32_t PIOTRANSFERERRSTATEN : 1;  /*!< When set to 1'b1, enables interrupt status logging for TRANSFER_ERR_STAT  */
            uint32_t            : 22;
    } PIOINTRSTATUSENABLE_b;
  } ;

  union {
    __IOM uint32_t PIOINTRSIGNALENABLE;         /*!< PIO_INTR_SIGNAL_ENABLE                                                    */

    struct {
      __IOM uint32_t TXTHLDSIGNALEN : 1;        /*!< When set to 1'b1 AND field TX_THLD_STAT is set, asserts interrupt
                                                     to Host.                                                                  */
      __IOM uint32_t RXTHLDSIGNALEN : 1;        /*!< When set to 1'b1 AND field RX_THLD_STAT is set, asserts interrupt
                                                     to Host.                                                                  */
      __IOM uint32_t IBITHLDSIGNALEN : 1;       /*!< When set to 1'b1 AND field IBI_THLD_STAT is set, asserts interrupt
                                                     to Host.                                                                  */
      __IOM uint32_t CMDQUEUEREADYSIGNALEN : 1; /*!< When set to 1'b1 AND field CMD_QUEUE_READY_STAT is set, asserts
                                                     interrupt to Host.                                                        */
      __IOM uint32_t RESPREADYSIGNALEN : 1;     /*!< When set to 1'b1 AND field RESP_READY_STAT is set, asserts interrupt
                                                     to Host.                                                                  */
      __IOM uint32_t PIOTRANSFERABORTSIGNALEN : 1;/*!< When set to 1'b1 AND field TRANSFER_ABORT_STAT is set, asserts
                                                     interrupt to Host.                                                        */
            uint32_t            : 3;
      __IOM uint32_t PIOTRANSFERERRSIGNALEN : 1;/*!< When set to 1'b1 AND field TRANSFER_ERR_STAT is set, asserts
                                                     interrupt to Host.                                                        */
            uint32_t            : 22;
    } PIOINTRSIGNALENABLE_b;
  } ;

  union {
    __IOM uint32_t PIOINTRFORCE;                /*!< PIO_INTR_FORCE                                                            */

    struct {
      __IOM uint32_t TXTHLDFORCE : 1;           /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t RXTHLDFORCE : 1;           /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t IBITHLDFORCE : 1;          /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t CMDQUEUEREADYFORCE : 1;    /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t RESPREADYFORCE : 1;        /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
      __IOM uint32_t PIOTRANSFERABORTFORCE : 1; /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
            uint32_t            : 3;
      __IOM uint32_t PIOTRANSFERERRFORCE : 1;   /*!< For software testing, when set to 1'b1, forces the corresponding
                                                     interrupt, subject to INTR_STAT_EN and INTR_SIGNAL_EN configuration.      */
            uint32_t            : 22;
    } PIOINTRFORCE_b;
  } ;
  __IM  uint32_t  RESERVED7[8];

  union {
    __IOM uint32_t RHSCONTROL;                  /*!< Ring Headers Preamble Register states how many rings the host
                                                     controller hardware supports and how many rings are enabled
                                                     by the driver                                                             */

    struct {
      __IOM uint32_t MAXHEADERCOUNT : 4;        /*!< Driver Maximum Header Count. Maximum number of Ring Headers
                                                     currently enabled by the software. When changing this value,
                                                     all Ring Bundles (Ring Headers) must be in Disabled state.
                                                     Note: The software may enable fewer Ring Bundles than the
                                                     MAX_HEADER_COUNT_CAPABILITY hardware maximum. Valid Values:
                                                     0-8                                                                       */
      __IOM uint32_t MAXHEADERCOUNTCAPABILITY : 4;/*!< HC Maximum Header Count. Maximum number of Ring Bundles supported
                                                     by the Host Controller hardware. Valid Values: 0-8                        */
            uint32_t            : 8;
      __IOM uint32_t HEADERSIZE : 8;            /*!< Ring Header Size. Size in DWORDs per Ring Header Descriptor
                                                     structure, expressed as a power of 2.                                     */
      __IOM uint32_t PREAMBLESIZE : 8;          /*!< Preamble Section Size. Length in DWORDs of this Preamble Section.
                                                     The default value of 0x10 allows for 8 Ring Headers, and
                                                     is aligned to a power of 2.                                               */
    } RHSCONTROL_b;
  } ;

  union {
    __IOM uint32_t RH0OFFSET;                   /*!< Ring Header 0 Offset                                                      */

