zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t RHIBISTATBASEHI : 32;      /*!< IBI Status Ring Base Address High Upper 32 bits of pointer to
                                                     physical memory allocated for IBI Status Ring                             */
    } RHIBISTATUSRINGBASEHI_b;
  } ;

  union {
    __IOM uint32_t RHIBIDATARINGBASELO;         /*!< RH_IBI_DATA_RING_BASE_LO                                                  */

    struct {
      __IOM uint32_t RHIBIDATABASELO : 32;      /*!< IBI Data Ring Base Address Low Lower 32 bits of pointer to physical
                                                     memory allocated for the IBI Data Ring. Because the IBI
                                                     Data Ring is DWORD aligned, the lowest two address bits
                                                     will always be 2b00.                                                      */
    } RHIBIDATARINGBASELO_b;
  } ;

  union {
    __IOM uint32_t RHIBIDATARINGBASEHI;         /*!< RH_IBI_DATA_RING_BASE_HI                                                  */

    struct {
      __IOM uint32_t RHIBIDATABASEHI : 32;      /*!< IBI Data Ring Base Address High Upper 32 bits of pointer to
                                                     physical memory allocated for IBI Data Ring                               */
    } RHIBIDATARINGBASEHI_b;
  } ;
  __IM  uint32_t  RESERVED10[116];

  union {
    __IOM uint32_t EXTCAPHEADER;                /*!< EXTCAP_HEADER                                                             */

    struct {
      __IOM uint32_t CAPID      : 8;            /*!< Extended Capability ID Values: 0x00: Not a capability ID, indicates
                                                     end of the Extended Capability list 0x01 0xFF: Capability
                                                     IDs,                                                                      */
      __IOM uint32_t CAPLENGTH  : 16;           /*!< Capability Structure Length in DWORDs The length includes the
                                                     EXTCAP_HEADER, and indicates the base address of the next
                                                     Extended Capability in the list.                                          */
            uint32_t            : 8;
    } EXTCAPHEADER_b;
  } ;

  union {
    __IOM uint32_t COMPMANUFACTURER;            /*!< COMP_MANUFACTURER                                                         */

    struct {
      __IOM uint32_t MIPIVENDORID : 32;         /*!< MIPI Vendor ID MIPI Manufacturer ID Error! Reference source
                                                     not found..                                                               */
    } COMPMANUFACTURER_b;
  } ;

  union {
    __IOM uint32_t COMPVERSION;                 /*!< COMP_VERSION                                                              */

    struct {
      __IOM uint32_t I3CVERID   : 32;           /*!< Host Controller Component Version Vendor-assigned Device version.         */
    } COMPVERSION_b;
  } ;

  union {
    __IOM uint32_t COMPTYPE;                    /*!< COMP_TYPE                                                                 */

    struct {
      __IOM uint32_t I3CPRODUCTID : 32;         /*!< Host Controller Component Type Vendor-assigned product ID or
                                                     type.                                                                     */
    } COMPTYPE_b;
  } ;
  __IM  uint32_t  RESERVED11;

  union {
    __IOM uint32_t MASTERCONFIG;                /*!< MASTER_CONFIG                                                             */

    struct {
            uint32_t            : 4;
      __IOM uint32_t OPERATIONMODE : 2;         /*!< Master Operation Mode Host Controller modes supported. Values:
                                                     0x1: Master functionality only 0x2: Slave functionality
                                                     only 0x3: Master or Secondary Master (Slave) functionality                */
            uint32_t            : 26;
    } MASTERCONFIG_b;
  } ;
  __IM  uint32_t  RESERVED12;

  union {
    __IOM uint32_t I2CURD1SCLLOWCNT;            /*!< I2C_URD1_SCL_LOW_CNT                                                      */

    struct {
      __IOM uint32_t SCLLOWCNTURD1 : 8;         /*!< I2C_SCL_LOW_CNT for the I2C URD1 mode.                                    */
            uint32_t            : 24;
    } I2CURD1SCLLOWCNT_b;
  } ;

  union {
    __IOM uint32_t I2CURD1SCLHIGHCNT;           /*!< I2C_URD1_SCL_HIGH_CNT                                                     */

    struct {
      __IOM uint32_t SCLHIGHCNTURD1 : 8;        /*!< I2C_SCL_HIGH_CNT for the I2C URD1 mode.                                   */
            uint32_t            : 24;
    } I2CURD1SCLHIGHCNT_b;
  } ;

  union {
    __IOM uint32_t I2CURD2SCLLOWCNT;            /*!< I2C_URD2_SCL_LOW_CNT                                                      */

    struct {
      __IOM uint32_t SCLLOWCNTURD2 : 8;         /*!< I2C_SCL_LOW_CNT for the I2C URD2 mode.                                    */
            uint32_t            : 24;
    } I2CURD2SCLLOWCNT_b;
  } ;

  union {
    __IOM uint32_t I2CURD2SCLHIGHCNT;           /*!< I2C_URD2_SCL_HIGH_CNT                                                     */

    struct {
      __IOM uint32_t SCLHIGHCNTURD2 : 8;        /*!< I2C_SCL_HIGH_CNT for the I2C URD2 mode.                                   */
            uint32_t            : 24;
    } I2CURD2SCLHIGHCNT_b;
  } ;

  union {
    __IOM uint32_t I2CURD3SCLLOWCNT;            /*!< I2C_URD3_SCL_LOW_CNT                                                      */

    struct {
      __IOM uint32_t SCLLOWCNTURD3 : 8;         /*!< I2C_SCL_LOW_CNT for the I2C URD3 mode.                                    */
            uint32_t            : 24;
    } I2CURD3SCLLOWCNT_b;
  } ;

  union {
    __IOM uint32_t I2CURD3SCLHIGHCNT;           /*!< I2C_URD3_SCL_HIGH_CNT                                                     */

