zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t ADDRSZ     : 1;            /*!< Sets the I2C master device address size to either 7b (0) or
                                                     10b (1).                                                                  */
      __IOM uint32_t I2CLSB     : 1;            /*!< Direction of data transmit and receive, MSB(0) or LSB(1) first.
                                                     Default per I2C specification is MSB first. This applies
                                                     to both read and write data, and read data will be bit                    */
      __IOM uint32_t ARBEN      : 1;            /*!< Enables multi-master arbitration for the I2C master. If the
                                                     bus is known to have only a single master, this function
                                                     can be disabled to save clock cycles on I2C transactions                  */
            uint32_t            : 1;
      __IOM uint32_t SDADLY     : 2;            /*!< Delay to enable on the SDA output. Values are 0x0-0x3.                    */
      __IOM uint32_t MI2CRST    : 1;            /*!< Not used. To reset the module, toggle the SMOD_EN for the module          */
            uint32_t            : 1;
      __IOM uint32_t SCLENDLY   : 4;            /*!< Number of IOCLK cycles to delay the rising edge of the SCL output
                                                     en (clock will go low on this edge). Used to allow clock
                                                     shaping.                                                                  */
      __IOM uint32_t SDAENDLY   : 4;            /*!< Number of IOCLK cycles to delay the SDA output en (all transitions
                                                     affected). Used to delay data relative to clock                           */
      __IOM uint32_t SMPCNT     : 8;            /*!< Number of Base clk cycles to wait before sampling the SCL clock
                                                     to determine if a clock stretch event has occured                         */
      __IOM uint32_t STRDIS     : 1;            /*!< Disable detection of clock stretch events smaller than 1 cycle            */
            uint32_t            : 7;
    } MI2CCFG_b;
  } ;

  union {
    __IOM uint32_t DEVCFG;                      /*!< Contains the I2C device address.                                          */

    struct {
      __IOM uint32_t DEVADDR    : 10;           /*!< I2C address of the device that the Master will use to target
                                                     for read/write operations. This can be either a 7b or 10b
                                                     address.                                                                  */
            uint32_t            : 22;
    } DEVCFG_b;
  } ;
  __IM  uint32_t  RESERVED4[48];

  union {
    __IOM uint32_t IOMDBG;                      /*!< Debug control                                                             */

    struct {
      __IOM uint32_t DBGEN      : 1;            /*!< Debug Enable. Setting bit will enable the update of data within
                                                     this register, otherwise it is clock gated for power savings              */
      __IOM uint32_t IOCLKON    : 1;            /*!< IOCLK debug clock control. Enable IO_CLK to be active when this
                                                     bit is '1'. Otherwise, the clock is controlled with gating
                                                     from the logic as needed.                                                 */
      __IOM uint32_t APBCLKON   : 1;            /*!< APBCLK debug clock control. Enable APB_CLK to be active when
                                                     this bit is '1'. Otherwise, the clock is controlled with
                                                     gating from the logic as needed.                                          */
      __IOM uint32_t DBGDATA    : 29;           /*!< Debug control for various options. DBGDATA[1:0] is used to select
                                                     between different debug data available in the DBG0 and
                                                     DBG1 registers.                                                           */
    } IOMDBG_b;
  } ;
} IOM0_Type;                                    /*!< Size = 908 (0x38c)                                                        */



/* =========================================================================================================================== */
/* ================                                        IOSLAVEFD0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI Full Duplex Slaves (IOSLAVEFD0)
  */

typedef struct {                                /*!< IOSLAVEFD0 Structure                                                      */
  __IM  uint32_t  RESERVED[64];

  union {
    __IOM uint32_t FIFOPTR;                     /*!< Current FIFO Pointer                                                      */

    struct {
      __IOM uint32_t FIFOPTR    : 8;            /*!< Current FIFO pointer.                                                     */
      __IOM uint32_t FIFOSIZ    : 8;            /*!< The number of bytes currently in the hardware FIFO.                       */
            uint32_t            : 16;
    } FIFOPTR_b;
  } ;

  union {
    __IOM uint32_t FIFOCFG;                     /*!< FIFO Configuration                                                        */

    struct {
      __IOM uint32_t FIFOBASE   : 5;            /*!< These bits hold the base address of the I/O FIFO in 8 byte segments.
                                                     The IO Slave FIFO is situated in LRAM at (FIFOBASE*8) to
                                                     (FIFOMAX*8-1).                                                            */
            uint32_t            : 3;
      __IOM uint32_t FIFOMAX    : 6;            /*!< These bits hold the maximum FIFO address in 8 byte segments.
                                                     It is also the beginning of the RAM area of the LRAM. Note
                                                     that no RAM area is configured if FIFOMAX is set to 0x1F.                 */
            uint32_t            : 10;
      __IOM uint32_t ROBASE     : 6;            /*!< Defines the read-only area. The IO Slave read-only area is situated
                                                     in LRAM at (ROBASE*8) to (FIFOBASE*8-1)                                   */
            uint32_t            : 2;
    } FIFOCFG_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< FIFO Threshold Configuration                                              */

