zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t VREFBUFVOLTTRIM : 6;       /*!< VREFBUF voltage trim init value                                           */
      __IOM uint32_t VREFBUFPDNB : 1;           /*!< VREGBUF pdnb init value                                                   */
      __IOM uint32_t VREFBUFMISCTRIM : 6;       /*!< VREFBUF MISC trim init value                                              */
      __IOM uint32_t VREFBUFIBIASTRIM : 1;      /*!< VREFBUFIBIAS trim init value                                              */
      __IOM uint32_t VREFBUFCCOMPTRIM : 3;      /*!< VREFBUF ccomp trim init value                                             */
            uint32_t            : 15;
    } VREFBUF_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t VRCTRL;                      /*!< Overrides for Voltage Regulators Controls                                 */

    struct {
      __IOM uint32_t CORELDOOVER : 1;           /*!< Override control for CORE LDO signals                                     */
      __IOM uint32_t CORELDOPDNB : 1;           /*!< CORE LDO PDNB control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOACTIVEEARLY : 1;    /*!< CORE LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when CORELDOOVER = 1                                               */
      __IOM uint32_t CORELDOACTIVE : 1;         /*!< CORE LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOCOLDSTARTEN : 1;    /*!< CORE LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set CORELDOOVER.                                           */
      __IOM uint32_t MEMLDOOVER : 1;            /*!< Override control for MEM LDO signals                                      */
      __IOM uint32_t MEMLDOPDNB : 1;            /*!< MEM LDO PDNB control. Override signal for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOACTIVEEARLY : 1;     /*!< MEM LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when MEMLDOOVER = 1                                                */
      __IOM uint32_t MEMLDOACTIVE : 1;          /*!< MEM LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOCOLDSTARTEN : 1;     /*!< MEM LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set MEMLDOOVER.                                            */
      __IOM uint32_t MEMLDOTVRGFCVRGSEL : 2;    /*!< Selects the input reference for MEMLDO.                                   */
            uint32_t            : 1;
      __IOM uint32_t ANALDOOVER : 1;            /*!< Override control for ANALDO signals                                       */
      __IOM uint32_t ANALDOPDNB : 1;            /*!< ANALDO PDNB control. Override for PWRCTRL going to analog when
                                                     ANALDOOVER = 1                                                            */
      __IOM uint32_t ANALDOACTIVE : 1;          /*!< ANALDO LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when ANALDOOVER = 1                                                       */
      __IOM uint32_t SIMOBUCKOVER : 1;          /*!< Override control for SIMO BUCK signals                                    */
      __IOM uint32_t SIMOBUCKPDNB : 1;          /*!< SIMO BUCK PDNB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKRSTB : 1;          /*!< SIMO BUCK RSTB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKACTIVE : 1;        /*!< SIMO BUCK ACTIVE control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
            uint32_t            : 12;
    } VRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[7];

  union {
    __IOM uint32_t LDOREG1;                     /*!< CORELDO trims Reg                                                         */

    struct {
      __IOM uint32_t CORELDOACTIVETRIM : 10;    /*!< CORE LDO active trim                                                      */
      __IOM uint32_t CORELDOTEMPCOTRIM : 4;     /*!< CORE LDO TEMPCO trim                                                      */
      __IOM uint32_t CORELDOLPTRIM : 6;         /*!< CORE LDO Low Power Trim                                                   */
      __IOM uint32_t CORELDOIBIASTRIM : 1;      /*!< CORE LDO IBIAS Trim                                                       */
      __IOM uint32_t CORELDOIBIASSEL : 1;       /*!< Core LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect.                                           */
            uint32_t            : 10;
    } LDOREG1_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t LDOREG2;                     /*!< MEMLDO and ANALDO Trims                                                   */

