zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MEMLDOACTIVETRIM : 6;      /*!< MEM LDO active trim                                                       */
      __IOM uint32_t MEMLDOLPTRIM : 6;          /*!< MEM LDO LP trim                                                           */
      __IOM uint32_t MEMLDOLPALTTRIM : 6;       /*!< MEM LDO TRIM LP ALT SET                                                   */
            uint32_t            : 7;
      __IOM uint32_t MEMLDOIBIASSEL : 1;        /*!< Mem LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect.                                           */
      __IOM uint32_t TRIMANALDO : 4;            /*!< Analog LDO Trim.                                                          */
            uint32_t            : 2;
    } LDOREG2_b;
  } ;
  __IM  uint32_t  RESERVED6[13];

  union {
    __IOM uint32_t HFRC;                        /*!< HFRC Control                                                              */

    struct {
      __IOM uint32_t HFRCSWE    : 1;            /*!< HFRC Software Override Enable.                                            */
      __IOM uint32_t HFRCTEMPCOTRIM : 2;        /*!< HFRC tempco trim bits                                                     */
      __IOM uint32_t HFRCDIS    : 1;            /*!< Force HFRC Output Low.                                                    */
      __IOM uint32_t HFRCBURSTCLKDIS : 1;       /*!< Force HFRC Burst Clk output low.                                          */
      __IOM uint32_t HFRCPWD    : 1;            /*!< Power Down HFRC.                                                          */
      __IOM uint32_t HFRCDEL    : 5;            /*!< Power Up Delay before enabling clocks.                                    */
      __IOM uint32_t HFTUNE     : 11;           /*!< Default HFRC frequency tune value                                         */
      __IOM uint32_t HFRCSIMOBUCKCLKEN : 1;     /*!< Enable the HFRC output to simobuck -- provides TON CLK for simobuck.      */
      __IOM uint32_t HFRCSIMOBUCKTONCLKDIVSEL : 3;/*!< Sets divide ratio (integer values from 3:10) for TON CLK output
                                                     to simobuck.                                                              */
            uint32_t            : 6;
    } HFRC_b;
  } ;
  __IM  uint32_t  RESERVED7[7];

  union {
    __IOM uint32_t LFRC;                        /*!< LFRC Control                                                              */

    struct {
      __IOM uint32_t LFRCSWE    : 1;            /*!< LFRC Software Override Enable.                                            */
      __IOM uint32_t TRIMTUNELFRC : 5;          /*!< LFRC Frequency Tune trim bits                                             */
      __IOM uint32_t PWDLFRC    : 1;            /*!< Power Down LFRC.                                                          */
      __IOM uint32_t RESETLFRC  : 1;            /*!< LFRC Reset.                                                               */
      __IOM uint32_t LFRCITAILTRIM : 2;         /*!< LFRC ITAIL trim                                                           */
      __IOM uint32_t LFRCSIMOCLKDIV : 3;        /*!< SIMOBUCK LP mode clock divider                                            */
      __IOM uint32_t LFRCPWTRIM : 4;            /*!< LFRC PW trim init value                                                   */
      __IOM uint32_t LFRCPWTRIMEN : 1;          /*!< Enable the LFRC PW trim init value                                        */
            uint32_t            : 14;
    } LFRC_b;
  } ;
  __IM  uint32_t  RESERVED8[7];

  union {
    __IOM uint32_t BODCTRL;                     /*!< BOD control                                                               */

    struct {
      __IOM uint32_t BODLPWD    : 1;            /*!< BODL Power Down [1==OFF, 0 ==ON].                                         */
      __IOM uint32_t BODHPWD    : 1;            /*!< BODH Power Down [1==OFF, 0 ==ON].                                         */
      __IOM uint32_t BODCPWD    : 1;            /*!< BODC Power Down [1==OFF, 0 ==ON].                                         */
      __IOM uint32_t BODFPWD    : 1;            /*!< BODF Power Down [1==OFF, 0 ==ON].                                         */
      __IOM uint32_t BODSPWD    : 1;            /*!< BODS Power Down [1==OFF, 0 ==ON].                                         */
      __IOM uint32_t BODCLVPWD  : 1;            /*!< BODC_LV Power Down [1==OFF, 0 ==ON].                                      */
      __IOM uint32_t BODLVREFSEL : 1;           /*!< BODL External Reference Select. Note: the SWE mux select in
                                                     PWRSEQ2SWE must be set for this to take effect.                           */
      __IOM uint32_t BODHVREFSEL : 1;           /*!< BODH External Reference Select. Note: the SWE mux select in
                                                     PWRSEQ2SWE must be set for this to take effect.                           */
      __IOM uint32_t BODLLVLTTRIM : 2;          /*!< BOD low level trim. 2's complement trim code. 2'b10: 1.635V,
                                                     2'b11:1.665V, 2'b00: 1.695V, 2'b01: 1.725V                                */
      __IOM uint32_t BODHLVLTRIM : 2;           /*!< BOD high level trim. 2's complement trim code. 2'b10: 2.22V,
                                                     2'b11: 2.42V, 2'b00: 2.637V, 2'b01: 2.81V                                 */
      __IOM uint32_t BODRFPWD   : 1;            /*!< BODRF Power Down [1==OFF, 0 ==ON].                                        */
      __IOM uint32_t BODRFTRIM  : 5;            /*!< BODRF Trim setting.                                                       */
            uint32_t            : 14;
    } BODCTRL_b;
  } ;
  __IM  uint32_t  RESERVED9;

  union {
    __IOM uint32_t ADCPWRCTRL;                  /*!< ADC Power Control                                                         */

