zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t ADCPWRCTRLSWE : 1;         /*!< ADC Power Control Software Override Enable                                */
      __IOM uint32_t ADCAPSEN   : 1;            /*!< Enable the Global ADC Power Switch on when set to 1 if the ADCPWRCTRLSWE
                                                     bit is set.                                                               */
      __IOM uint32_t ADCBPSEN   : 1;            /*!< Enable the Analog, IO and SAR Digital logic Power Switch on
                                                     when set to 1 if the ADCPWRCTRLSWE bit is set.                            */
      __IOM uint32_t BGTPEN     : 1;            /*!< Bandgap and Temperature Sensor Power Switch Enable                        */
            uint32_t            : 1;
      __IOM uint32_t REFBUFPEN  : 1;            /*!< Reference Buffer Power Switch Enable                                      */
      __IOM uint32_t REFKEEPPEN : 1;            /*!< Reference Buffer Keeper Power Switch Enable                               */
      __IOM uint32_t VDDADCSARISOLATE : 1;      /*!< ISOLATE signal for Power Switched SAR ( when ADCBPSEN is switched
                                                     off )                                                                     */
      __IOM uint32_t VDDADCDIGISOLATE : 1;      /*!< ISOLATE signal for ADC Digital Contoller ( when ADCAPSEN is
                                                     switched off and if the ADCPWRCTRLSWE bit is set)                         */
      __IOM uint32_t VDDADCRESETN : 1;          /*!< RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the ADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t ADCVBATDIVEN : 1;          /*!< ADC VBAT DIV Power Enable ( if the ADCPWRCTRLSWE bit is set
                                                     )                                                                         */
      __IOM uint32_t ADCINBUFSEL : 2;           /*!< ADC input buffer mux select                                               */
      __IOM uint32_t ADCINBUFEN : 1;            /*!< ADC Input Buffer Power Enable ( if the ADCPWRCTRLSWE bit is
                                                     set )                                                                     */
      __IOM uint32_t ADCRFBUFSLWEN : 1;         /*!< ADC reference buffer slew enable                                          */
      __IOM uint32_t ADCKEEPOUTEN : 1;          /*!< ADC reference keeper out en                                               */
            uint32_t            : 15;
    } ADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t ADCCAL;                      /*!< ADC Calibration Control                                                   */

    struct {
      __IOM uint32_t CALONPWRUP : 1;            /*!< Run ADC Calibration on initial power up sequence                          */
      __IOM uint32_t ADCCALIBRATED : 1;         /*!< Status for ADC Calibration                                                */
            uint32_t            : 30;
    } ADCCAL_b;
  } ;

  union {
    __IOM uint32_t ADCBATTLOAD;                 /*!< ADC Battery Load Enable                                                   */

    struct {
      __IOM uint32_t BATTLOAD   : 1;            /*!< Enable the ADC battery load resistor                                      */
            uint32_t            : 31;
    } ADCBATTLOAD_b;
  } ;
  __IM  uint32_t  RESERVED10[3];

  union {
    __IOM uint32_t XTALCTRL;                    /*!< XTAL Oscillator Control                                                   */

    struct {
      __IOM uint32_t XTALSWE    : 1;            /*!< XTAL Software Override Enable.                                            */
      __IOM uint32_t XTALCOREDISFB : 1;         /*!< XTAL Oscillator Disable Feedback.                                         */
      __IOM uint32_t XTALCOMPBYPASS : 1;        /*!< XTAL Oscillator Bypass Comparator.                                        */
      __IOM uint32_t XTALPDNB   : 1;            /*!< XTAL Oscillator Power Down Core.                                          */
      __IOM uint32_t XTALCOMPPDNB : 1;          /*!< XTAL Oscillator Power Down Comparator.                                    */
      __IOM uint32_t XTALIBUFTRIM : 2;          /*!< XTAL IBUFF trim                                                           */
      __IOM uint32_t XTALICOMPTRIM : 2;         /*!< XTAL ICOMP trim                                                           */
            uint32_t            : 23;
    } XTALCTRL_b;
  } ;

  union {
    __IOM uint32_t XTALGENCTRL;                 /*!< XTAL Oscillator General Control                                           */

    struct {
      __IOM uint32_t ACWARMUP   : 2;            /*!< Auto-calibration delay control                                            */
      __IOM uint32_t XTALBIASTRIM : 6;          /*!< XTAL BIAS trim                                                            */
      __IOM uint32_t XTALKSBIASTRIM : 6;        /*!< XTAL IBIAS Kick start trim. This trim value is used during the
                                                     startup process to enable a faster lock.                                  */
            uint32_t            : 18;
    } XTALGENCTRL_b;
  } ;
  __IM  uint32_t  RESERVED11;

  union {
    __IOM uint32_t XTALHSCTRL;                  /*!< XTALHS Control                                                            */

    struct {
      __IOM uint32_t XTALHSPDNB : 1;            /*!< Enable the RF 48MHz XTAL oscillator                                       */
      __IOM uint32_t XTALHSCOMPPDNB : 1;        /*!< xtalhs_comp_pdnb                                                          */
      __IOM uint32_t XTALHSCOMPSEL : 1;         /*!< xtalhs_comp_sel                                                           */
      __IOM uint32_t XTALHSIBSTENABLE : 1;      /*!< xtalhs_ibst_enable                                                        */
      __IOM uint32_t XTALHSINJECTIONENABLE : 1; /*!< xtalhs_injection_enable                                                   */
      __IOM uint32_t XTALHSPDNPNIMPROVE : 1;    /*!< xtalhs_pdn_pn_improve                                                     */
      __IOM uint32_t XTALHSSELRCOM : 1;         /*!< xtalhs_sel_rcom                                                           */
      __IOM uint32_t XTALHSPADOUTEN : 1;        /*!< xtalhs_padout_en                                                          */
      __IOM uint32_t XTALHSEXTERNALCLOCK : 1;   /*!< xtalhs_external_clock                                                     */
            uint32_t            : 23;
    } XTALHSCTRL_b;
  } ;
  __IM  uint32_t  RESERVED12[20];

  union {
    __IOM uint32_t MRAMCRYPTOPWRCTRL;           /*!< MRAM Crypto Power Control                                                 */

