zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t MRAM0LPREN : 1;            /*!< MRAM0 low power mode enable. NVM VDD is on.                               */
      __IOM uint32_t MRAM0SLPEN : 1;            /*!< MRAM0 sleep mode enable. NVM VDD is on.                                   */
      __IOM uint32_t MRAM0PWRCTRL : 1;          /*!< MRAM0 low power mode control. When set to 1, tmc_lpr and tmc_slp
                                                     are driven by the value of MRAM0LPREN and MRAM0SLPEN of
                                                     this register. MRAM tmc ctrl register also can enable lpr
                                                     and slp mode.                                                             */
      __IOM uint32_t MRAM0DEEPPDST : 1;         /*!< If Read 1, MRAM0 is in Deep power down status.                            */
      __IOM uint32_t MRAM0FULLPDST : 1;         /*!< If Read 1, MRAM0 is in Fully power down status.                           */
            uint32_t            : 3;
      __IOM uint32_t CRYPTOPWRDOWREADY : 1;     /*!< Crypto power down is ready, sw can pwd down the crypto through
                                                     power ctrl                                                                */
      __IOM uint32_t CRYPTOCLKGATEN : 1;        /*!< crypto clk gating enable configuration                                    */
            uint32_t            : 22;
    } MRAMCRYPTOPWRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED13[10];

  union {
    __IOM uint32_t BODISABLE;                   /*!< Brownout Disable                                                          */

    struct {
      __IOM uint32_t BODLRDE    : 1;            /*!< Disable Unregulated 1.8V Brown-out reset.                                 */
      __IOM uint32_t BODCREN    : 1;            /*!< Disable VDDC Brown Out reset.                                             */
      __IOM uint32_t BODFREN    : 1;            /*!< Disable VDDF Brown Out reset.                                             */
      __IOM uint32_t BODSREN    : 1;            /*!< Disable VDDS Brown Out reset.                                             */
      __IOM uint32_t BODCLVREN  : 1;            /*!< Disable VDDC_LV Brown Out reset.                                          */
            uint32_t            : 27;
    } BODISABLE_b;
  } ;

  union {
    __IOM uint32_t D2ASPARE;                    /*!< Spare registers to analog module                                          */

    struct {
      __IOM uint32_t D2ASPARE   : 32;           /*!< D2A Spare signals (shadow loaded)::D2ASPARE[5]: BLE_RESETN signal         */
    } D2ASPARE_b;
  } ;
  __IM  uint32_t  RESERVED14;

  union {
    __IOM uint32_t BOOTLOADER;                  /*!< Bootloader and secure boot functions                                      */

    struct {
      __IOM uint32_t RSVD0      : 1;            /*!< This field is reserved and must not be modified.                          */
      __IOM uint32_t SBRUNLOCK  : 1;            /*!< Secure boot ROM lock. Always resets to 1, write 1 to clear.
                                                     Enables system visibility to bootloader until set.                        */
      __IOM uint32_t PROTUNLOCK : 1;            /*!< Flash protection lock. Always resets to 1, write 1 to clear.
                                                     Enables writes to flash protection register set.                          */
      __IOM uint32_t SBLUNLOCK  : 1;            /*!< Secure boot loader lock. Always resets to 1, write 1 to clear.
                                                     Enables system visibility to bootloader until set.                        */
            uint32_t            : 22;
      __IOM uint32_t SECBOOTFEATURE : 2;        /*!< Indicates whether the secure boot feature is enabled.                     */
      __IOM uint32_t SECBOOT    : 2;            /*!< Indicates whether the secure boot on cold reset is enabled                */
      __IOM uint32_t SECBOOTONRST : 2;          /*!< Indicates whether the secure boot on warm reset is enabled                */
    } BOOTLOADER_b;
  } ;

  union {
    __IOM uint32_t SHADOWVALID;                 /*!< Register to indicate whether the shadow registers have been
                                                     successfully loaded from the Flash Information Space.                     */

    struct {
      __IOM uint32_t VALID      : 1;            /*!< Indicates whether the shadow registers contain valid data from
                                                     the Flash Information Space.                                              */
      __IOM uint32_t SPINORSLEEPn : 1;          /*!< Indicates whether the bootloader should sleep or spin if no
                                                     image loaded.                                                             */
      __IOM uint32_t INFO0VALID : 1;            /*!< Indicates whether info0 contains valid data                               */
      __IOM uint32_t INFO1SELOTP : 1;           /*!< Select OTP Info1 or MRAM Info1. IF INFOCSELOTP=0(GPIO_FORCE_MRAM=1),
                                                     InFO1 come from MRAM, not OTP, even this bit is 1.                        */
      __IOM uint32_t INFO0SELOTP : 1;           /*!< Select OTP Info0 or MRAM Info0. IF INFOCSELOTP=0(GPIO_FORCE_MRAM=1),
                                                     InFO0 come from MRAM, not OTP, even this bit is 1.                        */
      __IOM uint32_t INFOCSELOTP : 1;           /*!< Select OTP InfoC or MRAM InfoC, selec mram infoC only when GPIO_FORCE_MRAM=1 */
      __IOM uint32_t OTPREADY   : 1;            /*!< Whether OTP is ready for access                                           */
      __IOM uint32_t OTPBOOTFAULT : 6;          /*!< OTP interrupt status during shadow copy                                   */
            uint32_t            : 19;
    } SHADOWVALID_b;
  } ;

  union {
    __IOM uint32_t SCRATCH0;                    /*!< This register reserved for Ambiq INTERNAL use only. Do not modify.        */

