zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t VDDFTONACTLPTRIMLV : 5;    /*!< TON trim for VDDF used in simobuck active + chip LP mode / Low
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDFTONACTHPTRIMLV : 5;    /*!< TON trim for VDDF used in simobuck active + chip HP mode / Low
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDFTONDEEPSLEEPTRIMLV : 5;/*!< TON trim for VDDF used in simobuck deepsleep mode / Low Voltage.          */
      __IOM uint32_t VDDSTONACTLPTRIMLV : 5;    /*!< TON trim for VDDS used in simobuck active + chip LP mode / Low
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDSTONACTHPTRIMLV : 5;    /*!< TON trim for VDDS used in simobuck active + chip HP mode / Low
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDSTONDEEPSLEEPTRIMLV : 5;/*!< TON trim for VDDS used in simobuck deepsleep mode / Low Voltage.          */
            uint32_t            : 2;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< Low Voltage (LV) (VDDH LE 2.2V) TON Trims for VDDC and VDDC_LV.           */

    struct {
      __IOM uint32_t VDDCTONACTLPTRIMLV : 5;    /*!< TON trim for VDDC used in simobuck active + chip LP mode / Low
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDCTONACTHPTRIMLV : 5;    /*!< TON trim for VDDC used in simobuck active + chip HP mode / Low
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDCTONDEEPSLEEPTRIMLV : 5;/*!< TON trim for VDDC used in simobuck deepsleep mode / Low Voltage.          */
      __IOM uint32_t VDDCLVTONACTLPTRIMLV : 5;  /*!< TON trim for VDDCLV used in simobuck active + chip LP mode /
                                                     Low Voltage.                                                              */
      __IOM uint32_t VDDCLVTONACTHPTRIMLV : 5;  /*!< TON trim for VDDCLV used in simobuck active + chip HP mode /
                                                     Low Voltage.                                                              */
      __IOM uint32_t VDDCLVTONDEEPSLEEPTRIMLV : 5;/*!< TON trim for VDDCLV used in simobuck deepsleep mode / Low Voltage.      */
            uint32_t            : 2;
    } SIMOBUCK3_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK4;                   /*!< VDDRF trims - TON Low Voltage Trims (LV) (VDDH LE 2.2V) , rail
                                                     trim, and comparator trims.                                               */

    struct {
      __IOM uint32_t VDDRFTONACTLPTRIMLV : 5;   /*!< TON trim for VDDRF used in simobuck active + chip LP mode /
                                                     Low Voltage.                                                              */
      __IOM uint32_t VDDRFTONACTHPTRIMLV : 5;   /*!< TON trim for VDDRF used in simobuck active + chip HP mode /
                                                     Low Voltage.                                                              */
      __IOM uint32_t VDDRFTONDEEPSLEEPTRIMLV : 5;/*!< TON trim for VDDRF used in simobuck deepsleep mode / Low Voltage.        */
      __IOM uint32_t VDDRFSWCAPDIVEN : 1;       /*!< Enable using switched-cap divider for VDDRF [Don't set VDDRFRXCOMPRESDIVEN
                                                     and VDDRFRXCOMPSWCAPDIVEN].                                               */
      __IOM uint32_t VDDRFRESDIVEN : 1;         /*!< Enable using resistor divider for VDDRF [Don't set VDDRFRXCOMPRESDIVEN
                                                     and VDDRFRXCOMPSWCAPDIVEN].                                               */
      __IOM uint32_t VDDRFDIVSEL : 5;           /*!< Set trim for VDDRF rail. Trim range: 0.75V - 1.55V in 25mV steps.
                                                     Max usable code is code 23 [1.325V].                                      */
      __IOM uint32_t VDDRFRXCOMPTRIMEN : 1;     /*!< Enable VDDRF RXCOMP offset trimming.                                      */
      __IOM uint32_t VDDRFDEEPSLEEPOFFSETEN : 1;/*!< Enable VDDRF RX COMP offset to be used in deepsleep mode.                 */
      __IOM uint32_t VDDRFCOMPTRIMMINUS : 5;    /*!< Trim VDDRF RX COMP offset lower.                                          */
            uint32_t            : 3;
    } SIMOBUCK4_b;
  } ;
  __IM  uint32_t  RESERVED21;

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< RX Comp Offset Trim for VDDS and VDDF. One extra trim for VDDRF.          */

    struct {
      __IOM uint32_t VDDFRXCOMPTRIMEN : 1;      /*!< Enables RX Comp Trim for VDDF.                                            */
      __IOM uint32_t VDDFRXCOMPTRIMPLUS : 5;    /*!< RX Comp positive side trim for VDDF.                                      */
      __IOM uint32_t VDDFRXCOMPTRIMMINUS : 5;   /*!< RX Comp negative side trim for VDDF.                                      */
      __IOM uint32_t VDDFDEEPSLEEPOFFSETEN : 1; /*!< Enable RX comp offset trims to be enabled in simobuck deepsleep
                                                     mode for VDDF.                                                            */
      __IOM uint32_t VDDRFCOMPTRIMPLUS : 5;     /*!< RX Comp positive side trim for VDDRF.                                     */
      __IOM uint32_t VDDSRXCOMPTRIMEN : 1;      /*!< Enables RX Comp Trim for VDDS.                                            */
      __IOM uint32_t VDDSRXCOMPTRIMPLUS : 5;    /*!< RX Comp positive side trim for VDDS.                                      */
      __IOM uint32_t VDDSRXCOMPTRIMMINUS : 5;   /*!< RX Comp negative side trim for VDDS.                                      */
      __IOM uint32_t VDDSDEEPSLEEPOFFSETEN : 1; /*!< Enable RX comp offset trims to be enabled in simobuck deepsleep
                                                     mode for VDDS.                                                            */
            uint32_t            : 3;
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< RX Comp Offset Trim for VDDC and VDDC LV. VDDC TVRGC Mux control.         */

