zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t VDDCRXCOMPTRIMEN : 1;      /*!< Enables RX Comp Trim for VDDC.                                            */
      __IOM uint32_t VDDCRXCOMPTRIMPLUS : 5;    /*!< RX Comp positive side trim for VDDC.                                      */
      __IOM uint32_t VDDCRXCOMPTRIMMINUS : 5;   /*!< RX Comp negative side trim for VDDC.                                      */
      __IOM uint32_t VDDCDEEPSLEEPOFFSETEN : 1; /*!< Enable RX comp offset trims to be enabled in simobuck deepsleep
                                                     mode for VDDC.                                                            */
      __IOM uint32_t VDDCLVRXCOMPTRIMEN : 1;    /*!< Enables RX Comp Trim for VDDC_LV.                                         */
      __IOM uint32_t VDDCLVRXCOMPTRIMPLUS : 5;  /*!< RX Comp positive side trim for VDDC_LV.                                   */
      __IOM uint32_t VDDCLVRXCOMPTRIMMINUS : 5; /*!< RX Comp negative side trim for VDDCLV.                                    */
      __IOM uint32_t VDDCLVDEEPSLEEPOFFSETEN : 1;/*!< Enable RX comp offset trims to be enabled in simobuck deepsleep
                                                     mode for VDDCLV.                                                          */
      __IOM uint32_t SIMOBUCKTVRGCREFSEL : 1;   /*!< Controls mux selecting two different tap points from TVRGC for
                                                     RX Comp input for VDDC.                                                   */
            uint32_t            : 7;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< High Voltage (HV) (VDDH GE 2.2V) TON Trims for VDDF and VDDS.             */

    struct {
      __IOM uint32_t VDDFTONACTLPTRIMHV : 5;    /*!< TON trim for VDDF used in simobuck active + chip LP mode / High
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDFTONACTHPTRIMHV : 5;    /*!< TON trim for VDDF used in simobuck active + chip HP mode / High
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDFTONDEEPSLEEPTRIMHV : 5;/*!< TON trim for VDDF used in simobuck deepsleep mode / High Voltage.         */
      __IOM uint32_t VDDSTONACTLPTRIMHV : 5;    /*!< TON trim for VDDS used in simobuck active + chip LP mode / High
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDSTONACTHPTRIMHV : 5;    /*!< TON trim for VDDS used in simobuck active + chip HP mode / High
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDSTONDEEPSLEEPTRIMHV : 5;/*!< TON trim for VDDS used in simobuck deepsleep mode / High Voltage.         */
            uint32_t            : 2;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< High Voltage (HV) (VDDH GE 2.2V) TON Trims for VDDC and VDDC_LV.          */

    struct {
      __IOM uint32_t VDDCTONACTLPTRIMHV : 5;    /*!< TON trim for VDDC used in simobuck active + chip LP mode / High
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDCTONACTHPTRIMHV : 5;    /*!< TON trim for VDDC used in simobuck active + chip HP mode / High
                                                     Voltage.                                                                  */
      __IOM uint32_t VDDCTONDEEPSLEEPTRIMHV : 5;/*!< TON trim for VDDC used in simobuck deepsleep mode / High Voltage.         */
      __IOM uint32_t VDDCLVTONACTLPTRIMHV : 5;  /*!< TON trim for VDDCLV used in simobuck active + chip LP mode /
                                                     High Voltage.                                                             */
      __IOM uint32_t VDDCLVTONACTHPTRIMHV : 5;  /*!< TON trim for VDDCLV used in simobuck active + chip HP mode /
                                                     High Voltage.                                                             */
      __IOM uint32_t VDDCLVTONDEEPSLEEPTRIMHV : 5;/*!< TON trim for VDDCLV used in simobuck deepsleep mode / High Voltage.     */
            uint32_t            : 2;
    } SIMOBUCK9_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK10;                  /*!< High Voltage (HV) (VDDH GE 2.2V) TON Trims for VDDRF and control
                                                     bits for HV/LV muxes.                                                     */

    struct {
      __IOM uint32_t VDDRFTONACTLPTRIMHV : 5;   /*!< TON trim for VDDRF used in simobuck active + chip LP mode /
                                                     High Voltage.                                                             */
      __IOM uint32_t VDDRFTONACTHPTRIMHV : 5;   /*!< TON trim for VDDRF used in simobuck active + chip HP mode /
                                                     High Voltage.                                                             */
      __IOM uint32_t VDDRFTONDEEPSLEEPTRIMHV : 5;/*!< TON trim for VDDRF used in simobuck deepsleep mode / High Voltage.       */
      __IOM uint32_t TONVOLTAGEMUXSELCTRL : 1;  /*!< Control for selecting which source will control the TON VOLTAGE
                                                     MUX. == 0 will use SW value ( TONVOLTAGESWSEL ); == 1 will
                                                     allow BODH to control which TONs to use.                                  */
      __IOM uint32_t TONVOLTAGESWSEL : 1;       /*!< Software value that can be used to control whether to use Low-Voltage
                                                     (LV) or High-Voltage (HW) TON trims. Used if TONVOLTAGEMUXSELCTRL==0.     */
            uint32_t            : 15;
    } SIMOBUCK10_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK11;                  /*!< Spare Register for simobuck.                                              */

