zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t SIMOBUCKD2ASPARE : 32;     /*!< Spare register for simobuck.                                              */
    } SIMOBUCK11_b;
  } ;

  union {
    __IOM uint32_t D2ASPARE2;                   /*!< Spare Register for analog signals that will all be on VDDF.               */

    struct {
      __IOM uint32_t D2ASPARE2  : 32;           /*!< Spare register for analog_top with signals on VDDF.                       */
    } D2ASPARE2_b;
  } ;
  __IM  uint32_t  RESERVED22;

  union {
    __IOM uint32_t USBLDOCTRL;                  /*!< Controls for USBLDO                                                       */

    struct {
      __IOM uint32_t USBLDOIBIASSEL : 1;        /*!< USBLDO IBIAS SELECT                                                       */
      __IOM uint32_t USBLDOPDNB : 1;            /*!< USBLDO PDNB SEL                                                           */
      __IOM uint32_t USBLDOPULLDNDIS : 1;       /*!< USBLDO PULLDOWN DISABLE                                                   */
      __IOM uint32_t USBLDOTESTEN : 1;          /*!< USBLDO TEST EN                                                            */
      __IOM uint32_t USBLDOVREFSEL : 1;         /*!< USBLDO VREF SELECT                                                        */
      __IOM uint32_t USBLDOTRIMSEL : 6;         /*!< USBLDO TRIM                                                               */
            uint32_t            : 21;
    } USBLDOCTRL_b;
  } ;

  union {
    __IOM uint32_t I3CPHYCTRL;                  /*!< Controls for I3CPHY                                                       */

    struct {
      __IOM uint32_t I3CPHYPULLDN : 1;          /*!< I3CPHY PULLDOWN SWITCH CONTROL                                            */
            uint32_t            : 31;
    } I3CPHYCTRL_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< PWRSW Control 0                                                           */

    struct {
      __IOM uint32_t PWRSWVDDCPUDYNSEL : 2;     /*!< override value for pwrsw_vddcpu_dynsel                                    */
      __IOM uint32_t PWRSWVDDCPUDYNSELOVERRIDE : 1;/*!< override enable for pwrsw_vddcpu_dynsel                                */
      __IOM uint32_t PWRSWVDDCPUPGN : 1;        /*!< override value for pwrsw_vddcpu_pgn                                       */
      __IOM uint32_t PWRSWVDDCPUPGNOVERRIDE : 1;/*!< override enable for pwrsw_vddcpu_pgn                                      */
      __IOM uint32_t PWRSWVDDCAORDYNSEL : 2;    /*!< override value for pwrsw_vddcaor_dynsel                                   */
      __IOM uint32_t PWRSWVDDCAOROVERRIDE : 1;  /*!< override enable for pwrsw_vddcaor_dynsel                                  */
      __IOM uint32_t PWRSWVDDCAORPGNOVERRIDE : 1;/*!< override enable for pwrsw_vddcaor_pgn                                    */
      __IOM uint32_t PWRSWVDDCAORDYNSELBITSWAP : 1;/*!< Swaps the dynsel bits for VDDCAOR. [1:0] becomes [0:1] if set
                                                     == 1.                                                                     */
      __IOM uint32_t PWRSWVDDCPUDYNSELBITSWAP : 1;/*!< Swaps the dynsel bits for VDDCPU. [1:0] becomes [0:1] if set
                                                     == 1.                                                                     */
            uint32_t            : 4;
      __IOM uint32_t PWRSWVDDMCPUDYNSEL : 1;    /*!< override value for pwrsw_vddmcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDMCPUSTATSEL : 1;   /*!< VDDMCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDMCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddmcpu_dynsel                                  */
      __IOM uint32_t PWRSWVDDMCPUSTATSELPOLSEL : 1;/*!< Selects non-inverted (==0) statsel or inverted (==1) statsel
                                                     for VDD_MCPU                                                              */
            uint32_t            : 5;
      __IOM uint32_t PWRSWVDDMLDYNSEL : 1;      /*!< override value for pwrsw_vddml_dynsel                                     */
      __IOM uint32_t PWRSWVDDMLSTATSEL : 1;     /*!< VDDML power switch static select                                          */
      __IOM uint32_t PWRSWVDDMLOVERRIDE : 1;    /*!< override enable for pwrsw_vddml_dynsel                                    */
      __IOM uint32_t PWRSWVDDRCPUDYNSEL : 1;    /*!< override value for pwrsw_vddrcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDRCPUDYNSELOVERRIDE : 1;/*!< override enable for pwrsw_vddrcpu_dynsel                              */
      __IOM uint32_t PWRSWVDDRCPUPGN : 1;       /*!< override value for pwrsw_vddrcpu_pgn                                      */
      __IOM uint32_t PWRSWVDDRCPUSTATSEL : 1;   /*!< VDDRCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDRCPUPGNOVERRIDE : 1;/*!< override enable for pwrsw_vddrcpu_pgn                                    */
    } PWRSW0_b;
  } ;

  union {
    __IOM uint32_t PWRSW1;                      /*!< PWRSW Control 1                                                           */

    struct {
            uint32_t            : 9;
      __IOM uint32_t PWRSWVDDRLDYNSEL : 1;      /*!< override value for pwrsw_vddrl_dynsel                                     */
      __IOM uint32_t PWRSWVDDRLPGN : 1;         /*!< override value for pwrsw_vddrl_pgn                                        */
      __IOM uint32_t PWRSWVDDRLSTATSEL : 1;     /*!< VDDRL power switch static select                                          */
      __IOM uint32_t PWRSWVDDRLDYNSELOVERRIDE : 1;/*!< override enable for pwrsw_vddrl_dynsel                                  */
      __IOM uint32_t PWRSWVDDRLPGNOVERRIDE : 1; /*!< override enable for pwrsw_vddrl_pgn                                       */
      __IOM uint32_t PWRSWVDDRMDYNSEL : 1;      /*!< override value for pwrsw_vddrm_dynsel                                     */
      __IOM uint32_t PWRSWVDDRMPGN : 1;         /*!< override value for pwrsw_vddrm_pgn                                        */
      __IOM uint32_t PWRSWVDDRMSTATSEL : 1;     /*!< VDDRM power switch static select                                          */
      __IOM uint32_t PWRSWVDDRMDYNSELOVERRIDE : 1;/*!< override enable for pwrsw_vddrm_dynsel                                  */
      __IOM uint32_t PWRSWVDDRMPGNOVERRIDE : 1; /*!< override enable for pwrsw_vddrm_pgn                                       */
      __IOM uint32_t PWRSWVDDLPGN : 1;          /*!< override value for pwrsw_vddl_pgn                                         */
      __IOM uint32_t PWRSWVDDLOVERRIDE : 1;     /*!< override enable for pwrsw_vddl_pgn                                        */
            uint32_t            : 5;
      __IOM uint32_t FORCEVDDRMVDDF : 1;        /*!< Setting this bit selects VDDF for VDDRM when Flash is off. This
                                                     is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t FORCEVDDRMOFF : 1;         /*!< Setting this bit forces VDDRM to be open when Flash is off.
                                                     This is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t SHORTVDDCVDDCLVOREN : 1;   /*!< pwrsw short override select for vddc/vddclv                               */
      __IOM uint32_t SHORTVDDCVDDCLVORVAL : 1;  /*!< pwrsw short override value for vddc/vddclv                                */
      __IOM uint32_t SHORTVDDFVDDSOREN : 1;     /*!< pwrsw short override select for vddf/vdds                                 */
      __IOM uint32_t SHORTVDDFVDDSORVAL : 1;    /*!< pwrsw short override value for vddf/vdds                                  */
    } PWRSW1_b;
  } ;
  __IM  uint32_t  RESERVED23;

  union {
    __IOM uint32_t USBRSTCTRL;                  /*!< USB Reset Startup Control                                                 */

