zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t FR2BITS    : 32;           /*!< Copy (read) protect flash 0x00100000 - 0x0017FFFF. Each bit
                                                     provides read protection for 16KB chunks of flash. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHRPROT2_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT3;                 /*!< These bits read-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FR3BITS    : 32;           /*!< Copy (read) protect flash 0x00180000 - 0x001FFFFF. Each bit
                                                     provides read protection for 16KB chunks of flash. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHRPROT3_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT0;                  /*!< These bits write-protect system SRAM from non-cpu access in
                                                     16KB chunks.                                                              */

    struct {
      __IOM uint32_t SRAMWPROT0 : 32;           /*!< Write protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu writes, when
                                                     set to 0, DMA may write the region.                                       */
    } SRAMWPROT0_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT1;                  /*!< These bits write-protect system SRAM from non-cpu access in
                                                     16KB chunks.                                                              */

    struct {
      __IOM uint32_t SRAMWPROT1 : 32;           /*!< Write protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu writes, when
                                                     set to 0, DMA may write the region.                                       */
    } SRAMWPROT1_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT2;                  /*!< These bits write-protect system SRAM from non-cpu access in
                                                     16KB chunks.                                                              */

    struct {
      __IOM uint32_t SRAMWPROT2 : 32;           /*!< Write protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu writes, when
                                                     set to 0, DMA may write the region.                                       */
    } SRAMWPROT2_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT3;                  /*!< These bits write-protect system SRAM from non-cpu access in
                                                     16KB chunks.                                                              */

    struct {
      __IOM uint32_t SRAMWPROT3 : 16;           /*!< Write protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu writes, when
                                                     set to 0, DMA may write the region.                                       */
            uint32_t            : 16;
    } SRAMWPROT3_b;
  } ;
  __IM  uint32_t  RESERVED25[6];

  union {
    __IOM uint32_t SRAMRPROT0;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT0 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT0_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT1;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT1 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT1_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT2;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

