zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t RXFIFO     : 32;           /*!< Receive data. Data is aligned to the LSB (padded zeros on upper
                                                     bits) unless BIGENDIAN is set.                                            */
    } RXFIFO_b;
  } ;

  union {
    __IOM uint32_t TXENTRIES;                   /*!< Number of words in TX FIFO                                                */

    struct {
      __IOM uint32_t TXENTRIES  : 6;            /*!< Number of 32-bit words/entries in TX FIFO                                 */
            uint32_t            : 26;
    } TXENTRIES_b;
  } ;

  union {
    __IOM uint32_t RXENTRIES;                   /*!< Number of words in RX FIFO                                                */

    struct {
      __IOM uint32_t RXENTRIES  : 6;            /*!< Number of 32-bit words/entries in RX FIFO                                 */
            uint32_t            : 26;
    } RXENTRIES_b;
  } ;

  union {
    __IOM uint32_t THRESHOLD;                   /*!< Threshold levels that trigger RXFull and TXEmpty interrupts               */

    struct {
      __IOM uint32_t TXTHRESH   : 6;            /*!< Number of entries in TX FIFO that cause TXF interrupt                     */
            uint32_t            : 2;
      __IOM uint32_t RXTHRESH   : 6;            /*!< Number of entries in TX FIFO that cause RXE interrupt                     */
            uint32_t            : 18;
    } THRESHOLD_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t MSPICFG;                     /*!< Timing configuration bits for the MSPI module. PRSTN, IPRSTN,
                                                     and FIFORESET can be used to reset portions of the MSPI
                                                     interface in order to clear error conditions. The remaining
                                                     bits control clock frequency and TX/RX capture timings.                   */

    struct {
      __IOM uint32_t APBCLK     : 1;            /*!< Enable continuous APB clock. For power-efficient operation,
                                                     APBCLK should be set to 0.                                                */
            uint32_t            : 3;
      __IOM uint32_t IOMSEL     : 4;            /*!< Selects which IOM/CM4 is selected for CQ handshake status.                */
            uint32_t            : 21;
      __IOM uint32_t FIFORESET  : 1;            /*!< Reset MSPI FIFO (active high). 1=reset FIFO, 0=normal operation.
                                                     May be used to manually flush the FIFO in error handling.                 */
      __IOM uint32_t IPRSTN     : 1;            /*!< IP block reset. Write to 0 to put the transfer module in reset
                                                     or 1 for normal operation. This may be required after error
                                                     conditions to clear the transfer on the bus.                              */
      __IOM uint32_t PRSTN      : 1;            /*!< Peripheral reset. Master reset to the entire MSPI module (DMA,
                                                     XIP, and transfer state machines). 1=normal operation,
                                                     0=in reset.                                                               */
    } MSPICFG_b;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t PADOUTEN;                    /*!< Enable bits for the MSPI output pads. Each active MSPI line
                                                     should be set to 1 in the OUTEN field below.                              */

    struct {
      __IOM uint32_t OUTEN      : 19;           /*!< Output pad enable configuration. Indicates which pads should
                                                     be driven. Bits [3:0] are Quad0 data. Bits [7:4] are Quad1
                                                     data. Bit [8] is clock. Bit [9] is BM/DQS. Bit [10:17]
                                                     are data for 16-bit. Bit[18] is BM/DQS for 16-bit.                        */
            uint32_t            : 11;
      __IOM uint32_t PADSET1    : 1;            /*!< Only applicable on mspi1. When set, use gpio95 .. gpio 104 as
                                                     the pads. This extra set of pads is to run mspi0 on HEX
                                                     and mspi1 concurrently. Note that the timing of this extra
                                                     pads may not be as good as the origianl pads.                             */
      __IOM uint32_t CLKOND4    : 1;            /*!< Output clock on MSPI data[4]                                              */
    } PADOUTEN_b;
  } ;

  union {
    __IOM uint32_t PADOVEREN;                   /*!< Enables PIO-like pad override control                                     */

    struct {
      __IOM uint32_t OVERRIDEEN : 19;           /*!< Output pad override enable. Bit mask for pad outputs. When set
                                                     to 1, the values in the OVERRIDE field are driven on the
                                                     pad (output enable is implicitly set in this mode). [7:0]=data[7:0]
                                                     [8]=clock [9]=DM [18:11]=data[15:8]                                       */
            uint32_t            : 13;
    } PADOVEREN_b;
  } ;

  union {
    __IOM uint32_t PADOVER;                     /*!< Override data value                                                       */

    struct {
      __IOM uint32_t OVERRIDE   : 19;           /*!< Output pad override value. [7:0]=data [8]=clock [9]=DM                    */
            uint32_t            : 13;
    } PADOVER_b;
  } ;
  __IM  uint32_t  RESERVED2[12];

  union {
    __IOM uint32_t DEV0AXI;                     /*!< Specifies the base address and aperture range of the device
                                                     as mapped onto the AXI bus                                                */

