zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t PWRENPDM0  : 1;            /*!< Power up audio subsystem PDM0 domain                                      */
            uint32_t            : 3;
      __IOM uint32_t PWRENI2S0  : 1;            /*!< Power up audio subsystem I2S0 domain                                      */
            uint32_t            : 25;
    } AUDSSPWREN_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWRSTATUS;              /*!< This provides the power status for the peripheral domains controlled
                                                     through AUDSSPWREN register. Value of 1 means the device
                                                     is powred up and ready to be used and 0 means its not powered
                                                     up.                                                                       */

    struct {
            uint32_t            : 2;
      __IOM uint32_t PWRSTPDM0  : 1;            /*!< Power Status audio subsystem PDM0 domain                                  */
            uint32_t            : 3;
      __IOM uint32_t PWRSTI2S0  : 1;            /*!< Power Status audio subsystem I2S0 domain                                  */
            uint32_t            : 25;
    } AUDSSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMPWREN;                    /*!< Enables individual banks of memories. When a PWREN field is
                                                     set, power is enabled to the memory or specific bank of
                                                     memory. This register works in conjunction with the MEMRETCFG
                                                     register. If a field in this register is not set, then
                                                     power is always disabled to the memory bank. In the case
                                                     of NVM, to enable NVM1, NVM0 must also be enabled. Disabling
                                                     power to NVM0 also disables power to NVM1.                                */

    struct {
      __IOM uint32_t PWRENTCM   : 2;            /*!< Power up Combination of DTCM. Only 2 Combinations are allowed
                                                     - 0x1, 0x3. And, Setting 0x2 selects DTCM256K                             */
            uint32_t            : 1;
      __IOM uint32_t PWRENNVM   : 1;            /*!< Power up NVM                                                              */
            uint32_t            : 1;
      __IOM uint32_t PWRENROM   : 1;            /*!< Power up ROM.                                                             */
            uint32_t            : 26;
    } MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t MEMPWRSTATUS;                /*!< It provides the power status for all the memory banks including-
                                                     caches, nvm (0 and 1) and all the SRAM groups. The status
                                                     here should reflect the enable provided by the MEMPWREN
                                                     register. There may be a lag time between setting the bits
                                                     in MEMPWREN register and MEMPWRSTATUS register, due to
                                                     the need to cycle the power gate and isolation seqeunces
                                                     to the memory banks.                                                      */

    struct {
      __IOM uint32_t PWRSTTCM   : 2;            /*!< Power status for xTCM. Each bit corresponds to one of the TCMs.
                                                     bit0=TCM0_0, bit1=TCM0_1                                                  */
            uint32_t            : 1;
      __IOM uint32_t PWRSTNVM0  : 1;            /*!< This bit is 1 if power is supplied to NVM 0                               */
      __IOM uint32_t PWRSTCACHE : 1;            /*!< This bit is 1 if power is supplied to Cache                               */
            uint32_t            : 2;
      __IOM uint32_t PWRSTROM   : 1;            /*!< This bit is 1 if power is supplied to ROM                                 */
            uint32_t            : 24;
    } MEMPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMRETCFG;                   /*!< This register's fields control the power down of the NVM and
                                                     TCM in deep sleep.                                                        */

    struct {
      __IOM uint32_t TCMPWDSLP  : 1;            /*!< Powers down all enabled ITCM and DTCM in deep sleep when set
                                                     (memory is not retained). Enabled ITCM and DTCM are as
                                                     set in the PWRENTCM field of the MEMPWREN register and
                                                     the SKUITCM and SUDTCM fields in the MCUCTRL_SKU register.
                                                     If power-down is disabled (TCMPWDSLP is cleared), then
                                                     upon wake the data within the TCMs is retained. Do not
                                                     set this bit if the TCM bank is used as the target for
                                                     DMA transfer while CPU in deep sleep.                                     */
      __IOM uint32_t NVMPWDSLP  : 1;            /*!< Powers down NVM in deep sleep when set.                                   */
      __IOM uint32_t NVMPWDCFG  : 2;            /*!< NVM Three Power Down Modes                                                */
            uint32_t            : 28;
    } MEMRETCFG_b;
  } ;

  union {
    __IOM uint32_t SYSPWRSTATUS;                /*!< Power ON Status for domains that are not part of devpwrstatus
                                                     or mempwrstatus                                                           */

