zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t PWRACKOVERRIDEADC : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEAUD : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDECRYPTO : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDBG : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEGFX : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPA : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPB : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPC : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEIOS : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMCUL : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDESDIO0 : 1;   /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEUSB : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEUSBPHY : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEPDM : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDESDIO1 : 1;   /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEOTP : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMCUE : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEROM : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMSPI : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMSPI1 : 1;   /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMSPI2 : 1;   /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDISP : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDISPPHY : 1; /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDENETAOL : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEI3CPHY : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDESYS : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEPLL : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
            uint32_t            : 5;
    } PWRACKOVR_b;
  } ;

  union {
    __IOM uint32_t PWRCNTDEFVAL;                /*!< This register contains programmble dealy values for various
                                                     state michines. Fields contain dev st machine default value,
                                                     SIMOBUCK state machine wait delay counter etc.                            */

