zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t PWRDEFVALDEVSTMC : 6;      /*!< Default count max value for dev ST MC                                     */
      __IOM uint32_t PWRACKWAITDELSIMOSTMC : 10;/*!< Default counter max for buck ST MC                                        */
            uint32_t            : 16;
    } PWRCNTDEFVAL_b;
  } ;
  __IM  uint32_t  RESERVED4[2];

  union {
    __IOM uint32_t EPURETCFG;                   /*!< This controls the retention of EPU in system deep sleep mode.
                                                     If this is set, when core goes into deepsleep mode, EPU
                                                     flops will be in logic retention. When this is not set,
                                                     EPU will be powered down when core goes into deepsleep.                   */

    struct {
      __IOM uint32_t EPURETSLP  : 1;            /*!< EPU retention select                                                      */
            uint32_t            : 31;
    } EPURETCFG_b;
  } ;

  union {
    __IOM uint32_t CM4PWRCTRL;                  /*!< CM4 POWER ON REQ FROM CM55. This bit is cleard after CM4 power
                                                     up is acknowledged by the CM4 PMU. This register is set
                                                     by software and cleared by hardware. This will only work
                                                     if NETAOL domain is also ON.                                              */

    struct {
      __IOM uint32_t CM4POWERONREQ : 1;         /*!< ERROR: desc VALUE MISSING                                                 */
            uint32_t            : 31;
    } CM4PWRCTRL_b;
  } ;

  union {
    __IOM uint32_t CM4PWRSTATE;                 /*!< Indicates whether the CM4 is in ON/OFF/RET                                */

    struct {
      __IOM uint32_t CM4PWRSTATUS : 2;          /*!< ERROR: desc VALUE MISSING                                                 */
            uint32_t            : 30;
    } CM4PWRSTATE_b;
  } ;
  __IM  uint32_t  RESERVED5[24];

  union {
    __IOM uint32_t VRCTRL;                      /*!< This register includes additional debug control bits. This is
                                                     an internal Ambiq-only register. Customers should not attempt
                                                     to change this or else functionality cannot be guaranteed.                */

    struct {
      __IOM uint32_t SIMOBUCKEN : 1;            /*!< Enables and Selects the SIMO Buck as the supply for the low-voltage
                                                     power domains. It takes the initial value from the bit
                                                     set in Customer INFO space.                                               */
            uint32_t            : 31;
    } VRCTRL_b;
  } ;

  union {
    __IOM uint32_t LEGACYVRLPOVR;               /*!< When an override is set for a power domain, VR logic will ignore
                                                     that power domain state in making a decision to go into
                                                     lp state.                                                                 */

    struct {
      __IOM uint32_t IGNOREIOS  : 1;            /*!< Ignore IOS                                                                */
      __IOM uint32_t IGNOREHCPA : 1;            /*!< Ignore HCPA                                                               */
      __IOM uint32_t IGNOREHCPB : 1;            /*!< Ignore HCPB                                                               */
      __IOM uint32_t IGNOREHCPC : 1;            /*!< Ignore HCPC                                                               */
      __IOM uint32_t IGNOREI3CPHY : 1;          /*!< Ignore I3C PHY                                                            */
      __IOM uint32_t IGNOREHCPE : 1;            /*!< Ignore HCPE                                                               */
            uint32_t            : 1;
      __IOM uint32_t IGNOREGFX  : 1;            /*!< Ignore GFX                                                                */
      __IOM uint32_t IGNORECRYPTO : 1;          /*!< Ignore CRYPTO                                                             */
      __IOM uint32_t IGNORESDIO0 : 1;           /*!< Ignore SDIO0                                                              */
      __IOM uint32_t IGNOREUSB  : 1;            /*!< Ignore USB Control                                                        */
      __IOM uint32_t IGNOREUSBPHY : 1;          /*!< Ignore USB PHY                                                            */
      __IOM uint32_t IGNOREAUD  : 1;            /*!< Ignore AUD                                                                */
      __IOM uint32_t IGNOREDBG  : 1;            /*!< Ignore DBG                                                                */
      __IOM uint32_t IGNORESDIO1 : 1;           /*!< Ignore SDIO1                                                              */
      __IOM uint32_t IGNOREOTP  : 1;            /*!< Ignore OTP                                                                */
      __IOM uint32_t IGNOREMCUE : 1;            /*!< Ignore MCUE                                                               */
      __IOM uint32_t IGNOREMSPI : 1;            /*!< Ignore MSPI                                                               */
      __IOM uint32_t IGNOREMSPI1 : 1;           /*!< Ignore MSPI                                                               */
      __IOM uint32_t IGNOREMSPI2 : 1;           /*!< Ignore MSPI                                                               */
      __IOM uint32_t IGNOREPDM  : 1;            /*!< Ignore PDM                                                                */
      __IOM uint32_t IGNORENETAOL : 1;          /*!< Ignore NETAOL                                                             */
      __IOM uint32_t IGNOREDISP : 1;            /*!< Ignore DISP Control                                                       */
      __IOM uint32_t IGNOREDISPPHY : 1;         /*!< Ignore DISP PHY                                                           */
            uint32_t            : 8;
    } LEGACYVRLPOVR_b;
  } ;

  union {
    __IOM uint32_t VRSTATUS;                    /*!< Provides BUCK and LDOs status.                                            */

