zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t EMONSEL0   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG0_b;
  } ;

  union {
    __IOM uint32_t EMONCFG1;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL1   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG1_b;
  } ;

  union {
    __IOM uint32_t EMONCFG2;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL2   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG2_b;
  } ;

  union {
    __IOM uint32_t EMONCFG3;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL3   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG3_b;
  } ;

  union {
    __IOM uint32_t EMONCFG4;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL4   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG4_b;
  } ;

  union {
    __IOM uint32_t EMONCFG5;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL5   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG5_b;
  } ;

  union {
    __IOM uint32_t EMONCFG6;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL6   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG6_b;
  } ;

  union {
    __IOM uint32_t EMONCFG7;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL7   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG7_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t EMONCOUNT0;                  /*!< Energy Monitor count value for counter 0                                  */

    struct {
      __IOM uint32_t EMONCOUNT0 : 32;           /*!< Energy Monitor count value counter 0                                      */
    } EMONCOUNT0_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT1;                  /*!< Energy Monitor count value for counter 1                                  */

    struct {
      __IOM uint32_t EMONCOUNT1 : 32;           /*!< Energy Monitor count value counter 1                                      */
    } EMONCOUNT1_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT2;                  /*!< Energy Monitor count value for counter 2                                  */

    struct {
      __IOM uint32_t EMONCOUNT2 : 32;           /*!< Energy Monitor count value counter 2                                      */
    } EMONCOUNT2_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT3;                  /*!< Energy Monitor count value for counter 3                                  */

    struct {
      __IOM uint32_t EMONCOUNT3 : 32;           /*!< Energy Monitor count value counter 3                                      */
    } EMONCOUNT3_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT4;                  /*!< Energy Monitor count value for counter 4                                  */

    struct {
      __IOM uint32_t EMONCOUNT4 : 32;           /*!< Energy Monitor count value counter 4                                      */
    } EMONCOUNT4_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT5;                  /*!< Energy Monitor count value for counter 5                                  */

    struct {
      __IOM uint32_t EMONCOUNT5 : 32;           /*!< Energy Monitor count value counter 5                                      */
    } EMONCOUNT5_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT6;                  /*!< Energy Monitor count value for counter 6                                  */

    struct {
      __IOM uint32_t EMONCOUNT6 : 32;           /*!< Energy Monitor count value counter 6                                      */
    } EMONCOUNT6_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT7;                  /*!< Energy Monitor count value for counter 7                                  */

    struct {
      __IOM uint32_t EMONCOUNT7 : 32;           /*!< Energy Monitor count value counter 7                                      */
    } EMONCOUNT7_b;
  } ;
  __IM  uint32_t  RESERVED11;

  union {
    __IOM uint32_t EMONSTATUS;                  /*!< Energy Monitor status                                                     */

