zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t ALMDATE    : 6;            /*!< Date Alarm. Contains the current value for date alarm.                    */
            uint32_t            : 2;
      __IOM uint32_t ALMMO      : 5;            /*!< Months Alarm. Contains the current value for months alarm.                */
            uint32_t            : 3;
      __IOM uint32_t ALMWKDY    : 3;            /*!< Weekdays Alarm. Contains the current value for weekdays alarm.            */
            uint32_t            : 13;
    } ALMUP_b;
  } ;
  __IM  uint32_t  RESERVED2[114];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTSET_b;
  } ;
} RTC_Type;                                     /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                            SCM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Simobuck Current Monitor (SCM)
  */

typedef struct {                                /*!< SCM Structure                                                             */

  union {
    __IOM uint32_t SCMCNTRCTRL1;                /*!< Controls the SCM LP mode counters and overall behavior                    */

    struct {
      __IOM uint32_t ENABLESCM  : 1;            /*!< Enable SCM module                                                         */
      __IOM uint32_t SCMMODESEL : 2;            /*!< SCM mode select for switching back to LP mode                             */
      __IOM uint32_t FORCELP    : 1;            /*!< Force the SCM module into LP mode and hold                                */
      __IOM uint32_t CLKDIV     : 5;            /*!< Clock divider for SCM counters                                            */
            uint32_t            : 23;
    } SCMCNTRCTRL1_b;
  } ;

  union {
    __IOM uint32_t SCMCNTRCTRL2;                /*!< Controls each of the ton counters                                         */

    struct {
      __IOM uint32_t FCNT1      : 16;           /*!< Frame width 1 for SCM LP mode counters                                    */
      __IOM uint32_t FCNT2      : 16;           /*!< Frame width 2 for SCM active counters                                     */
    } SCMCNTRCTRL2_b;
  } ;

  union {
    __IOM uint32_t LPTHRESHVDDS;                /*!< Low power threshold for VDDS                                              */

    struct {
      __IOM uint32_t LPTHRESHVDDS : 20;         /*!< VDDS LP threshold for SCM counter comparator                              */
            uint32_t            : 12;
    } LPTHRESHVDDS_b;
  } ;

  union {
    __IOM uint32_t LPTHRESHVDDF;                /*!< Low power threshold for VDDF                                              */

    struct {
      __IOM uint32_t LPTHRESHVDDF : 20;         /*!< VDDF LP threshold for SCM counter comparator                              */
            uint32_t            : 12;
    } LPTHRESHVDDF_b;
  } ;

  union {
    __IOM uint32_t LPTHRESHVDDC;                /*!< Low power threshold for VDDC                                              */

    struct {
      __IOM uint32_t LPTHRESHVDDC : 20;         /*!< VDDC LP threshold for SCM counter comparator                              */
            uint32_t            : 12;
    } LPTHRESHVDDC_b;
  } ;

  union {
    __IOM uint32_t LPTHRESHVDDCLV;              /*!< Low power threshold for VDDC_LV                                           */

    struct {
      __IOM uint32_t LPTHRESHVDDCLV : 20;       /*!< VDDC_LV LP threshold for SCM counter comparator                           */
            uint32_t            : 12;
    } LPTHRESHVDDCLV_b;
  } ;

  union {
    __IOM uint32_t LPTHRESHVDDRF;               /*!< Low power threshold for VDDRF                                             */

    struct {
      __IOM uint32_t LPTHRESHVDDRF : 20;        /*!< VDDRF threshold for SCM counter comparator                                */
            uint32_t            : 12;
    } LPTHRESHVDDRF_b;
  } ;

  union {
    __IOM uint32_t LPHYSTCNT;                   /*!< Low power hysteresis count                                                */

