zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t TRANSFERBLOCKSIZE : 12;    /*!< This register specifies the block size for block data transfers
                                                     for CMD17, CMD18, CMD24, CMD25, and CMD53. It can be accessed
                                                     only if no transaction is executing (i.e after a transaction
                                                     has stopped). Read operations during transfer return an
                                                     invalid value and write operations shall be ignored.                      */
      __IOM uint32_t HOSTSDMABUFSZ : 3;         /*!< To perform long DMA transfer, System Address register shall
                                                     be updated at every system boundary during DMA transfer.
                                                     These bits specify the size of contiguous buffer in the
                                                     system memory. The DMA transfer shall wait at the every
                                                     boundary specified by these fields and the HC generates
                                                     the DMA Interrupt to request the HD to update the System
                                                     Address register. These bits shall support when the DMA
                                                     Support in the Capabilities register is set to 1 and this
                                                     function is active when the DMA Enable in the Transfer
                                                     Mode register is set to 1.                                                */
            uint32_t            : 1;
      __IOM uint32_t BLKCNT     : 16;           /*!< This register is enabled when Block Count Enable in the Transfer
                                                     Mode register is set to 1 and is valid only for multiple
                                                     block transfers. The HC decrements the block count after
                                                     each block transfer and stops when the count reaches zero.
                                                     It can be accessed only if no transaction is executing
                                                     (i.e. after a transaction has stopped). Read operations
                                                     during transfer return an invalid value and write operations
                                                     shall be ignored. When saving transfer context as a result
                                                     of Suspend command, the number of blocks yet to be transferred
                                                     can be determined by reading this register. When restoring
                                                     transfer context prior to issuing a Resume command, the
                                                     HD shall restore the previously save block count.                         */
    } BLOCK_b;
  } ;

  union {
    __IOM uint32_t ARGUMENT1;                   /*!< Argument1                                                                 */

    struct {
      __IOM uint32_t CMDARG1    : 32;           /*!< The SD Command Argument is specified as bit39-8 of Command-Format.        */
    } ARGUMENT1_b;
  } ;

  union {
    __IOM uint32_t TRANSFER;                    /*!< Transfer mode                                                             */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA can be enabled only if DMA Support bit in the Capabilities
                                                     register is set. If this bit is set to 1, a DMA operation
                                                     shall begin when the HD writes to the upper byte of Command
                                                     register (00Fh).                                                          */
      __IOM uint32_t BLKCNTEN   : 1;            /*!< This bit is used to enable the Block count register, which is
                                                     only relevant for multiple block transfers. When this bit
                                                     is 0, the Block Count register is disabled, which is useful
                                                     in executing an infinite transfer.                                        */
      __IOM uint32_t ACMDEN     : 2;            /*!< This field determines use of auto command functions. There are
                                                     two methods to stop Multiple-block read and write operation.
                                                     (1) Auto CMD12 Enable Multiple-block read and write commands
                                                     for memory require CMD12 to stop the operation. When this
                                                     field is set to 01b, the Host Controller issues CMD12 automatically
                                                     when last block transfer is completed. Auto CMD12 error
                                                     is indicated to the Auto CMD Error Status register. The
                                                     Host Driver shall not set this bit if the command does
                                                     not require CMD12. (2) Auto CMD23 Enable When this bit
                                                     field is set to 10b, the Host Controller issues a CMD23
                                                     automatically before issuing a command specified in the
                                                     Command Register The following conditions are required
                                                     to use the Auto CMD23.                                                    */
      __IOM uint32_t DXFERDIRSEL : 1;           /*!< Data Transfer Direction Select. This bit defines the direction
                                                     of data transfers.                                                        */
      __IOM uint32_t BLKSEL     : 1;            /*!< This bit enables multiple block data transfers.                           */
            uint32_t            : 10;
      __IOM uint32_t RESPTYPESEL : 2;           /*!< Response Type Select                                                      */
            uint32_t            : 1;
      __IOM uint32_t CMDCRCCHKEN : 1;           /*!< If this bit is set to 1, the HC shall check the CRC field in
                                                     the response. If an error is detected, it is reported as
                                                     a Command CRC Error. If this bit is set to 0, the CRC field
                                                     is not checked.                                                           */
      __IOM uint32_t CMDIDXCHKEN : 1;           /*!< If this bit is set to 1, the HC shall check the index field
                                                     in the response to see if it has the same value as the
                                                     command index. If it is not, it is reported as a Command
                                                     Index Error. If this bit is set to 0, the Index field is
                                                     not checked.                                                              */
      __IOM uint32_t DATAPRSNTSEL : 1;          /*!< This bit is set to 1 to indicate that data is present and shall
                                                     be transferred using the DAT line. If is set to 0 for the
                                                     following: 1. Commands using only CMD line (ex. CMD52)
                                                     2. Commands with no data transfer but using busy signal
                                                     on DAT[0] line (R1b or R5b ex. CMD38) 3. Resume Command                   */
      __IOM uint32_t CMDTYPE    : 2;            /*!< There are three types of special commands. Suspend, Resume and
                                                     Abort. These bits shall bet set to 00b for all other commands.
                                                     Suspend Command If the Suspend command succeeds, the HC
                                                     shall assume the SD Bus has been released and that it is
                                                     possible to issue the next command which uses the DAT line.
                                                     The HC shall de-assert Read Wait for read transactions
                                                     and stop checking busy for write transactions. The Interrupt
                                                     cycle shall start, in 4-bit mode. If the Suspend command
                                                     fails, the HC shall maintain its current state. and the
                                                     HD shall restart the transfer by setting Continue Request
                                                     in the Block Gap Control Register. Resume Command The HD
                                                     re-starts the data transfer by restoring the registers
                                                     in the range of 000-00Dh. The HC shall check for busy before
                                                     starting write transfers. Abort Command If this command
                                                     is set when executing a read transfer, the HC shall stop
                                                     reads to the buffer. If this command is set when executing
                                                     a write transfer, the HC shall stop driving the DAT line.
                                                     After issuing the Abort command, the HD should issue a
                                                     software reset                                                            */
      __IOM uint32_t CMDIDX     : 6;            /*!< This bit shall be set to the command number (CMD0-63, ACMD063).           */
            uint32_t            : 2;
    } TRANSFER_b;
  } ;

  union {
    __IOM uint32_t RESPONSE0;                   /*!< Response0                                                                 */

