zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t CMDCMPEN   : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t XFERCMPEN  : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t BLOCKGAPEN : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t DMAINTEN   : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t BUFFERWREN : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t BUFFERRDEN : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t CARDINSERTEN : 1;          /*!< Interrupt                                                                 */
      __IOM uint32_t CARDREMOVALEN : 1;         /*!< Interrupt                                                                 */
      __IOM uint32_t CARDINTEN  : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t INTAEN     : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t INTBEN     : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t INTCEN     : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t RETUNEEVENTEN : 1;         /*!< Interrupt signal enable                                                   */
      __IOM uint32_t BOOTACKEN  : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t BOOTTERM   : 1;            /*!< Boot terminate interrupt signal enable                                    */
      __IOM uint32_t FIXED0     : 1;            /*!< Fixed to 0. The HD shall control error Interrupts using the
                                                     Error Interrupt Signal Enable register.                                   */
      __IOM uint32_t CMDTOERREN : 1;            /*!< Desc                                                                      */
      __IOM uint32_t CMDCRCERREN : 1;           /*!< Desc                                                                      */
      __IOM uint32_t CMDENDBITERREN : 1;        /*!< Desc                                                                      */
      __IOM uint32_t CMDIDXERREN : 1;           /*!< Desc                                                                      */
      __IOM uint32_t DATATOERROREN : 1;         /*!< Desc                                                                      */
      __IOM uint32_t DATACRCERREN : 1;          /*!< Desc                                                                      */
      __IOM uint32_t DATAENDERREN : 1;          /*!< Desc                                                                      */
      __IOM uint32_t CURRLMTERREN : 1;          /*!< Desc                                                                      */
      __IOM uint32_t AUTOCMD12ERREN : 1;        /*!< Desc                                                                      */
      __IOM uint32_t ADMAERREN  : 1;            /*!< Desc                                                                      */
      __IOM uint32_t TUNINGERREN : 1;           /*!< Desc                                                                      */
            uint32_t            : 1;
      __IOM uint32_t TGTRESPEN  : 1;            /*!< Interrupt                                                                 */
      __IOM uint32_t VNDERREN   : 3;            /*!< FIXME - Bitfield description needed here.                                 */
    } INTSIG_b;
  } ;

  union {
    __IOM uint32_t AUTO;                        /*!< Auto CMD error status                                                     */

    struct {
      __IOM uint32_t CMD12NOTEXEC : 1;          /*!< If memory multiple block data transfer is not started due to
                                                     command error, this bit is not set because it is not necessary
                                                     to issue Auto CMD12. Setting this bit to 1 means the HC
                                                     cannot issue Auto CMD12 to stop memory multiple block transfer
                                                     due to some error. If this bit is set to 1, other error
                                                     status bits (D04 - D01) are meaningless. This bit is set
                                                     to 0 when Auto CMD Error is generated by Auto CMD23                       */
      __IOM uint32_t CMDTOERR   : 1;            /*!< Occurs if the no response is returned within 64 SDCLK cycles
                                                     from the end bit of the command. If this bit is set to
                                                     1, the other error status bits (D04 - D02) are meaningless.               */
      __IOM uint32_t CMDCRCERR  : 1;            /*!< Occurs when detecting a CRC error in the command response.                */
      __IOM uint32_t CMDENDERR  : 1;            /*!< Occurs when detecting that the end bit of command response is
                                                     0.                                                                        */
      __IOM uint32_t CMDIDXERR  : 1;            /*!< Occurs if the Command Index error occurs in response to a command.        */
            uint32_t            : 2;
      __IOM uint32_t NOTAUTOCMD12ERR : 1;       /*!< Setting this bit to 1 means CMD_wo_DAT is not executed due to
                                                     an Auto CMD12 error (D04 - D01) in this register. This
                                                     bit is set to 0 when Auto CMD Error is generated by Auto
                                                     CMD23                                                                     */
            uint32_t            : 8;
      __IOM uint32_t UHSMODESEL : 3;            /*!< This field is used to select one of UHS-I modes and effective
                                                     when 1.8V Signaling Enable is set to 1. If Preset Value
                                                     Enable in the Host Control 2 register is set to 1, Host
                                                     Controller sets SDCLK Frequency Select, Clock Generator
                                                     Select in the Clock Control register and Driver Strength
                                                     Select according to Preset Value registers. In this case,
                                                     one of preset value registers is selected by this field.
                                                     Host Driver needs to reset SD Clock Enable before changing
                                                     this field to avoid generating clock glitch. After setting
                                                     this field, Host Driver sets SD Clock Enable again. When
                                                     SDR50, SDR104 or DDR50 is selected for SDIO card, interrupt
                                                     detection at the block gap shall not be used. Read Wait
                                                     timing is changed for these modes. Refer to the SDIO Specification
                                                     Version 3.00 for more detail.                                             */
      __IOM uint32_t SIGNALVOLT : 1;            /*!< This bit controls voltage regulator for I/O cell. 3.3V is supplied
                                                     to the card regardless of signaling voltage. Setting this
                                                     bit from 0 to 1 starts changing signal voltage from 3.3V
                                                     to 1.8V. 1.8V regulator output shall be stable within 5ms.
                                                     Host Controller clears this bit if switching to 1.8V signaling
                                                     fails. Clearing this bit from 1 to 0 starts changing signal
                                                     voltage from 1.8V to 3.3V. 3.3V regulator output shall
                                                     be stable within 5ms. Host Driver can set this bit to 1
                                                     when Host Controller supports 1.8V signaling (One of support
                                                     bits is set to 1: SDR50, SDR104 or DDR50 in the Capabilities
                                                     register) and the card or device supports UHS-I                           */
      __IOM uint32_t DRVRSTRSEL : 2;            /*!< Host Controller output driver in 1.8V signaling is selected
                                                     by this bit. In 3.3V signaling, this field is not effective.
                                                     This field can be set depends on Driver Type A, C and D
                                                     support bits in the Capabilities register. This bit depends
                                                     on setting of Preset Value Enable. If Preset Value Enable
                                                     = 0, this field is set by Host Driver. If Preset Value
                                                     Enable = 1, this field is automatically set by a value
                                                     specified in the one of Preset Value registers.                           */
      __IOM uint32_t STARTTUNING : 1;           /*!< This bit is set to 1 to start tuning procedure and automatically
                                                     cleared when tuning procedure is completed. The result
                                                     of tuning is indicated to Sampling Clock Select. Tuning
                                                     procedure is aborted by writing 0 for more detail about
                                                     tuning procedure.                                                         */
      __IOM uint32_t SAMPLCLKSEL : 1;           /*!< This bit is set by tuning procedure when Execute Tuning is cleared.
                                                     Writing 1 to this bit is meaningless and ignored. Setting
                                                     1 means that tuning is completed successfully and setting
                                                     0 means that tuning is failed. Host Controller uses this
                                                     bit to select sampling clock to receive CMD and DAT. This
                                                     bit is cleared by writing 0. Change of this bit is not
                                                     allowed while the Host Controller is receiving response
                                                     or a read data block.                                                     */
            uint32_t            : 6;
      __IOM uint32_t ASYNCINTEN : 1;            /*!< This bit can be set to 1 if a card support asynchronous interrupt
                                                     and Asynchronous Interrupt Support is set to 1 in the Capabilities
                                                     register. Asynchronous interrupt is effective when DAT[1]
                                                     interrupt is used in 4-bit SD mode (and zero is set to
                                                     Interrupt Pin Select in the Shared Bus Control register).
                                                     If this bit is set to 1, the Host Driver can stop the SDCLK
                                                     during asynchronous interrupt period to save power. During
                                                     this period, the Host Controller continues to deliver Card
                                                     Interrupt to the host when it is asserted by the Card.                    */
      __IOM uint32_t PRESETEN   : 1;            /*!< Host Controller Version 3.00 supports this bit. As the operating
                                                     SDCLK frequency and I/O driver strength depend on the Host
                                                     System implementation, it is difficult to determine these
                                                     parameters in the Standard Host Driver. When Preset Value
                                                     Enable is set to automatic. This bit enables the functions
                                                     defined in the Preset Value registers. If this bit is set
                                                     to 0, SDCLK Frequency Select, Clock Generator Select in
                                                     the Clock Control register and Driver Strength Select in
                                                     Host Control 2 register are set by Host Driver. If this
                                                     bit is set to 1, SDCLK Frequency Select, Clock Generator
                                                     Select in the Clock Control register and Driver Strength
                                                     Select in Host Control 2 register are set by Host Controller
                                                     as specified in the Preset Value registers.                               */
    } AUTO_b;
  } ;

  union {
    __IOM uint32_t CAPABILITIES0;               /*!< Capabilities                                                              */

