zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t TOCLKFREQ  : 6;            /*!< This bit shows the base clock frequency used to detect Data
                                                     Timeout Error. Not 0 - 1Khz to 63Khz or 1Mhz to 63Mhz Note:
                                                     The Host System shall support at least one of these voltages
                                                     above. The HD sets the SD Bus Voltage Select in Power Control
                                                     register according to these support bits. If multiple voltages
                                                     are supported, select the usable lower voltage by comparing
                                                     the OCR value from the card. These registers indicate maximum
                                                     current capability for each voltage. The value is meaningful
                                                     if Voltage Support is set in the Capabilities register.                   */
            uint32_t            : 1;
      __IOM uint32_t TOCLKUNIT  : 1;            /*!< This bit shows the unit of base clock frequency used to detect
                                                     Data Timeout Error.                                                       */
      __IOM uint32_t SDCLKFREQ  : 8;            /*!< 6-bit Base Clock Frequency This mode is supported by the Host
                                                     Controller Version 1.00 and 2.00. Upper 2-bit is not effective
                                                     and always 0. Unit values are 1MHz. The supported clock
                                                     range is 10MHz to 63MHz. 11xx xxxxb Not supported 0011
                                                     1111b 63MHz 0000 0010b 2MHz 0000 0001b 1MHz 0000 0000b
                                                     Get information via another method (2) 8-bit Base Clock
                                                     Frequency This mode is supported by the Host Controller
                                                     Version 3.00.Unit values are 1MHz. The supported clock
                                                     range is 10MHz to 255MHz. FFh 255MHz 02h 2MHz 01h 1MHz
                                                     00h Get information via another method If the real frequency
                                                     is 16.5MHz, the lager value shall be set 0001 0001b (17MHz)
                                                     because the Host Driver use this value to calculate the
                                                     clock divider value (Refer to the SDCLK Frequency Select
                                                     in the Clock Control register.) and it shall not exceed
                                                     upper limit of the SD Clock frequency. If these bits are
                                                     all 0, the Host System has to get information via another
                                                     method. Some example frequency values are enumerated below.               */
      __IOM uint32_t MAXBLKLEN  : 2;            /*!< This value indicates the maximum block size that the HD can
                                                     read and write to the buffer in the HC. The buffer shall
                                                     transfer this block size without wait cycles. Three sizes
                                                     can be defined as indicated below.                                        */
      __IOM uint32_t EXTMEDIA   : 1;            /*!< This bit indicates whether the Host Controller is capable of
                                                     using 8-bit bus width mode. This bit is not effective when
                                                     Slot Type is set to 10b. In this case, refer to Bus Width
                                                     Preset in the Shared Bus resister. Supported                              */
      __IOM uint32_t ADMA2      : 1;            /*!< Desc                                                                      */
            uint32_t            : 1;
      __IOM uint32_t HIGHSPEED  : 1;            /*!< This bit indicates whether the HC and the Host System support
                                                     High Speed mode and they can supply SD Clock frequency
                                                     from 25Mhz to 50 Mhz (for SD)/ 20MHz to 52MHz (for MMC).                  */
      __IOM uint32_t SDMA       : 1;            /*!< This bit indicates whether the HC is capable of using DMA to
                                                     transfer data between system memory and the HC directly.                  */
      __IOM uint32_t SUSPRES    : 1;            /*!< This bit indicates whether the HC supports Suspend / Resume
                                                     functionality. If this bit is 0, the Suspend and Resume
                                                     mechanism are not supported and the HD shall not issue
                                                     either Suspend / Resume commands.                                         */
      __IOM uint32_t VOLT33V    : 1;            /*!< Desc                                                                      */
      __IOM uint32_t VOLT30V    : 1;            /*!< Voltage support 3.0v                                                      */
      __IOM uint32_t VOLT18V    : 1;            /*!< Voltage support 1.8v                                                      */
            uint32_t            : 1;
      __IOM uint32_t SYSBUS64   : 1;            /*!< Desc                                                                      */
      __IOM uint32_t ASYNCINT   : 1;            /*!< Refer to SDIO Specification Version 3.00 about asynchronous
                                                     interrupt.                                                                */
      __IOM uint32_t SLOTTYPE   : 2;            /*!< This field indicates usage of a slot by a specific Host System.
                                                     (A host controller register set is defined per slot.) Embedded
                                                     slot for one device (01b) means that only one non-removable
                                                     device is connected to a SD bus slot. Shared Bus Slot (10b)
                                                     can be set if Host Controller supports Shared Bus Control
                                                     register. The Standard Host Driver controls only a removable
                                                     card or one embedded device is connected to a SD bus slot.
                                                     If a slot is configured for shared bus (10b), the Standard
                                                     Host Driver does not control embedded devices connected
                                                     to a shared bus. Shared bus slot is controlled by a specific
                                                     host driver developed by a Host System.                                   */
    } CAPABILITIES0_b;
  } ;

  union {
    __IOM uint32_t CAPABILITIES1;               /*!< Capabilities                                                              */

