zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t BOOTDATATO : 32;           /*!< This value determines the interval by which DAT line time-outs
                                                     are detected during boot operation for eMMC card. The value
                                                     is in number of sd clock.                                                 */
    } BOOTTOCTRL_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t VENDOR;                      /*!< Vendor                                                                    */

    struct {
      __IOM uint32_t GATESDCLKEN : 1;           /*!< If this bit is 0, SD_CLK to card will not be gated automatically,
                                                     when there is no transfer. If this bit set to 1, SD_CLK
                                                     to card will be gated automatically,when there is no transfer.            */
      __IOM uint32_t DLYDIS     : 1;            /*!< Chicken bit added to enable/disable the rtl fix made to delay
                                                     the sampling of cmd_in and data_in.                                       */
            uint32_t            : 30;
    } VENDOR_b;
  } ;
  __IM  uint32_t  RESERVED1[32];

  union {
    __IOM uint32_t SLOTSTAT;                    /*!< Slot interrupt status                                                     */

    struct {
      __IOM uint32_t INTSLOT0   : 1;            /*!< This status bit indicates the OR of Interrupt signal and Wakeup
                                                     signal for slot                                                           */
            uint32_t            : 15;
      __IOM uint32_t SPECVER    : 8;            /*!< The Host Controller Version Number is set to 0x02 (SD Host Specification
                                                     Version 3.00).                                                            */
      __IOM uint32_t VENDORVER  : 8;            /*!< The Vendor Version Number is set to 0x10 (1.0)                            */
    } SLOTSTAT_b;
  } ;

  union {
    __IOM uint32_t CLKOUTCFG;                   /*!< clkout configure                                                          */

    struct {
      __IOM uint32_t STEP       : 4;            /*!< tune step                                                                 */
      __IOM uint32_t WIDEN      : 1;            /*!< narrow or widen the high portion                                          */
            uint32_t            : 27;
    } CLKOUTCFG_b;
  } ;
} SDIO0_Type;                                   /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                         SECURERTC                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Real Time Clock (SECURERTC)
  */

typedef struct {                                /*!< SECURERTC Structure                                                       */

  union {
    __IOM uint32_t RTCCTL;                      /*!< This is the register control for the RTC module. It enables
                                                     counter writes and sets the alarm repeat interval.                        */

    struct {
      __IOM uint32_t WRTC       : 1;            /*!< Counter write control                                                     */
      __IOM uint32_t RPT        : 3;            /*!< Alarm repeat interval                                                     */
      __IOM uint32_t RSTOP      : 1;            /*!< RTC input clock control                                                   */
      __IOM uint32_t HR1224     : 1;            /*!< Hours Counter mode Only 24HR mode supported                               */
            uint32_t            : 26;
    } RTCCTL_b;
  } ;

  union {
    __IOM uint32_t RTCSTAT;                     /*!< This is the register status for the RTC module.                           */

    struct {
      __IOM uint32_t WRITEBUSY  : 1;            /*!< Indicates that an RTC update (write) is still in progress. Writes
                                                     are initiated by writing the CTTLOW register - CTRUP must
                                                     be written before CTRLOW to be updated (otherwise it will
                                                     retain its current value)                                                 */
            uint32_t            : 31;
    } RTCSTAT_b;
  } ;
  __IM  uint32_t  RESERVED[6];

  union {
    __IOM uint32_t CTRLOW;                      /*!< This counter contains the values for hour, minutes, seconds
                                                     and 100ths of a second Counter.                                           */

    struct {
      __IOM uint32_t CTR100     : 8;            /*!< 100ths of a second Counter. Contains the current value for hundredths
                                                     of a second.                                                              */
      __IOM uint32_t CTRSEC     : 7;            /*!< Seconds Counter. Contains the current value for seconds.                  */
            uint32_t            : 1;
      __IOM uint32_t CTRMIN     : 7;            /*!< Minutes Counter. Contains the current value for minutes.                  */
            uint32_t            : 1;
      __IOM uint32_t CTRHR      : 6;            /*!< Hours Counter. Contains the current value for hour.                       */
            uint32_t            : 2;
    } CTRLOW_b;
  } ;

  union {
    __IOM uint32_t CTRUP;                       /*!< This register contains the day, month and year information.
                                                     It contains which day in the week, and the century as well.
                                                     The information of the century can also be derived from
                                                     the year information. The 31st bit contains the error bit.
                                                     See description in the register bit for condition when
                                                     error is triggered.                                                       */

