zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t CLKSEL     : 4;            /*!< Selects an appropriate clock source and divider to use for the
                                                     System Timer clock.                                                       */
            uint32_t            : 4;
      __IOM uint32_t COMPAREAEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREBEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPARECEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREDEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREEEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREFEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREGEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREHEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
            uint32_t            : 14;
      __IOM uint32_t CLEAR      : 1;            /*!< Set this bit to one to clear the System Timer register. If this
                                                     bit is set to '1', the system timer register will stay
                                                     cleared. It needs to be set to '0' for the system timer
                                                     to start running.                                                         */
      __IOM uint32_t FREEZE     : 1;            /*!< Set this bit to one to freeze the clock input to the COUNTER
                                                     register. Once frozen, the value can be safely written
                                                     from the MCU. Unfreeze to resume.                                         */
    } STCFG_b;
  } ;

  union {
    __IOM uint32_t STTMR;                       /*!< The COUNTER Register contains the running count of time as maintained
                                                     by incrementing for every rising clock edge of the clock
                                                     source selected in the configuration register. It is this
                                                     counter value that captured in the capture registers and
                                                     it is this counter value that is compared against the various
                                                     compare registers. This register cannot be written, but
                                                     can be cleared to 0 for a deterministic value. Use the
                                                     FREEZE bit will stop this counter from incrementing.                      */

    struct {
      __IOM uint32_t STTMR      : 32;           /*!< Value of the 32-bit counter as it ticks over.                             */
    } STTMR_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t SCAPCTRL0;                   /*!< The STIMER Capture Control Register controls each of the 4 capture
                                                     registers. It selects their GPIO pin number for a trigger
                                                     source, enables a capture operation and sets the input
                                                     polarity for the capture. NOTE: 8-bit writes can control
                                                     individual capture registers atomically.                                  */

    struct {
      __IOM uint32_t STSEL0     : 7;            /*!< STIMER Capture 0 Select.                                                  */
            uint32_t            : 1;
      __IOM uint32_t STPOL0     : 1;            /*!< STIMER Capture 0 Polarity.                                                */
      __IOM uint32_t CAPTURE0   : 1;            /*!< Selects whether capture 0 is enabled for the specified capture
                                                     register.                                                                 */
            uint32_t            : 22;
    } SCAPCTRL0_b;
  } ;

  union {
    __IOM uint32_t SCAPCTRL1;                   /*!< The STIMER Capture Control Register controls each of the 4 capture
                                                     registers. It selects their GPIO pin number for a trigger
                                                     source, enables a capture operation and sets the input
                                                     polarity for the capture. NOTE: 8-bit writes can control
                                                     individual capture registers atomically.                                  */

