zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t SCMPR6     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR6_b;
  } ;

  union {
    __IOM uint32_t SCMPR7;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

    struct {
      __IOM uint32_t SCMPR7     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR7_b;
  } ;

  union {
    __IOM uint32_t SCAPT0;                      /*!< The STIMER capture Register 0 captures the VALUE in the COUNTER
                                                     register whenever capture condition (event) occurs. This
                                                     register holds a time stamp for the event.                                */

    struct {
      __IOM uint32_t SCAPT0     : 32;           /*!< Whenever the event is detected, the value in the COUNTER is
                                                     copied into this register and the corresponding interrupt
                                                     status bit is set.                                                        */
    } SCAPT0_b;
  } ;

  union {
    __IOM uint32_t SCAPT1;                      /*!< The STIMER capture Register 1 captures the VALUE in the COUNTER
                                                     register whenever capture condition (event) occurs. This
                                                     register holds a time stamp for the event.                                */

    struct {
      __IOM uint32_t SCAPT1     : 32;           /*!< Whenever the event is detected, the value in the COUNTER is
                                                     copied into this register and the corresponding interrupt
                                                     status bit is set.                                                        */
    } SCAPT1_b;
  } ;

  union {
    __IOM uint32_t SCAPT2;                      /*!< The STIMER capture Register 2 captures the VALUE in the COUNTER
                                                     register whenever capture condition (event) occurs. This
                                                     register holds a time stamp for the event.                                */

    struct {
      __IOM uint32_t SCAPT2     : 32;           /*!< Whenever the event is detected, the value in the COUNTER is
                                                     copied into this register and the corresponding interrupt
                                                     status bit is set.                                                        */
    } SCAPT2_b;
  } ;

  union {
    __IOM uint32_t SCAPT3;                      /*!< The STIMER capture Register 3 captures the VALUE in the COUNTER
                                                     register whenever capture condition (event) occurs. This
                                                     register holds a time stamp for the event.                                */

    struct {
      __IOM uint32_t SCAPT3     : 32;           /*!< Whenever the event is detected, the value in the COUNTER is
                                                     copied into this register and the corresponding interrupt
                                                     status bit is set.                                                        */
    } SCAPT3_b;
  } ;

  union {
    __IOM uint32_t SNVR0;                       /*!< The SNVR0 Register contains a portion of the stored epoch offset
                                                     associated with the time in the COUNTER register. This
                                                     register is only reset by POI not by HRESETn. Its contents
                                                     will survive all reset levels except POI and full power
                                                     cycles.                                                                   */

    struct {
      __IOM uint32_t SNVR0      : 32;           /*!< Value of the 32-bit counter as it ticks over.                             */
    } SNVR0_b;
  } ;

  union {
    __IOM uint32_t SNVR1;                       /*!< The SNVR1 Register contains a portion of the stored epoch offset
                                                     associated with the time in the COUNTER register. This
                                                     register is only reset by POI not by HRESETn. Its contents
                                                     will survive all reset levels except POI and full power
                                                     cycles.                                                                   */

