zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t SNVR1      : 32;           /*!< Value of the 32-bit counter as it ticks over.                             */
    } SNVR1_b;
  } ;

  union {
    __IOM uint32_t SNVR2;                       /*!< The SNVR2 Register contains a portion of the stored epoch offset
                                                     associated with the time in the COUNTER register. This
                                                     register is only reset by POI not by HRESETn. Its contents
                                                     will survive all reset levels except POI and full power
                                                     cycles.                                                                   */

    struct {
      __IOM uint32_t SNVR2      : 32;           /*!< Value of the 32-bit counter as it ticks over.                             */
    } SNVR2_b;
  } ;

  union {
    __IOM uint32_t SNVR3;                       /*!< The SNVR3 Register contains a portion of the stored epoch offset
                                                     associated with the time in the COUNTER register. This
                                                     register is only reset by POI not by HRESETn. Its contents
                                                     will survive all reset levels except POI and full power
                                                     cycles.                                                                   */

    struct {
      __IOM uint32_t SNVR3      : 32;           /*!< Value of the 32-bit counter as it ticks over.                             */
    } SNVR3_b;
  } ;
  __IM  uint32_t  RESERVED1[40];

  union {
    __IOM uint32_t STMINTEN;                    /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< COUNTER is greater than or equal to COMPARE register A.                   */
      __IOM uint32_t COMPAREB   : 1;            /*!< COUNTER is greater than or equal to COMPARE register B.                   */
      __IOM uint32_t COMPAREC   : 1;            /*!< COUNTER is greater than or equal to COMPARE register C.                   */
      __IOM uint32_t COMPARED   : 1;            /*!< COUNTER is greater than or equal to COMPARE register D.                   */
      __IOM uint32_t COMPAREE   : 1;            /*!< COUNTER is greater than or equal to COMPARE register E.                   */
      __IOM uint32_t COMPAREF   : 1;            /*!< COUNTER is greater than or equal to COMPARE register F.                   */
      __IOM uint32_t COMPAREG   : 1;            /*!< COUNTER is greater than or equal to COMPARE register G.                   */
      __IOM uint32_t COMPAREH   : 1;            /*!< COUNTER is greater than or equal to COMPARE register H.                   */
      __IOM uint32_t OVERFLOW   : 1;            /*!< COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.                   */
      __IOM uint32_t CAPTUREA   : 1;            /*!< CAPTURE register A has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREB   : 1;            /*!< CAPTURE register B has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREC   : 1;            /*!< CAPTURE register C has grabbed the value in the counter                   */
      __IOM uint32_t CAPTURED   : 1;            /*!< CAPTURE register D has grabbed the value in the counter                   */
            uint32_t            : 19;
    } STMINTEN_b;
  } ;

  union {
    __IOM uint32_t STMINTSTAT;                  /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< COUNTER is greater than or equal to COMPARE register A.                   */
      __IOM uint32_t COMPAREB   : 1;            /*!< COUNTER is greater than or equal to COMPARE register B.                   */
      __IOM uint32_t COMPAREC   : 1;            /*!< COUNTER is greater than or equal to COMPARE register C.                   */
      __IOM uint32_t COMPARED   : 1;            /*!< COUNTER is greater than or equal to COMPARE register D.                   */
      __IOM uint32_t COMPAREE   : 1;            /*!< COUNTER is greater than or equal to COMPARE register E.                   */
      __IOM uint32_t COMPAREF   : 1;            /*!< COUNTER is greater than or equal to COMPARE register F.                   */
      __IOM uint32_t COMPAREG   : 1;            /*!< COUNTER is greater than or equal to COMPARE register G.                   */
      __IOM uint32_t COMPAREH   : 1;            /*!< COUNTER is greater than or equal to COMPARE register H.                   */
      __IOM uint32_t OVERFLOW   : 1;            /*!< COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.                   */
      __IOM uint32_t CAPTUREA   : 1;            /*!< CAPTURE register A has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREB   : 1;            /*!< CAPTURE register B has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREC   : 1;            /*!< CAPTURE register C has grabbed the value in the counter                   */
      __IOM uint32_t CAPTURED   : 1;            /*!< CAPTURE register D has grabbed the value in the counter                   */
            uint32_t            : 19;
    } STMINTSTAT_b;
  } ;

  union {
    __IOM uint32_t STMINTCLR;                   /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

