zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< COUNTER is greater than or equal to COMPARE register A.                   */
      __IOM uint32_t COMPAREB   : 1;            /*!< COUNTER is greater than or equal to COMPARE register B.                   */
      __IOM uint32_t COMPAREC   : 1;            /*!< COUNTER is greater than or equal to COMPARE register C.                   */
      __IOM uint32_t COMPARED   : 1;            /*!< COUNTER is greater than or equal to COMPARE register D.                   */
      __IOM uint32_t COMPAREE   : 1;            /*!< COUNTER is greater than or equal to COMPARE register E.                   */
      __IOM uint32_t COMPAREF   : 1;            /*!< COUNTER is greater than or equal to COMPARE register F.                   */
      __IOM uint32_t COMPAREG   : 1;            /*!< COUNTER is greater than or equal to COMPARE register G.                   */
      __IOM uint32_t COMPAREH   : 1;            /*!< COUNTER is greater than or equal to COMPARE register H.                   */
      __IOM uint32_t OVERFLOW   : 1;            /*!< COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.                   */
      __IOM uint32_t CAPTUREA   : 1;            /*!< CAPTURE register A has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREB   : 1;            /*!< CAPTURE register B has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREC   : 1;            /*!< CAPTURE register C has grabbed the value in the counter                   */
      __IOM uint32_t CAPTURED   : 1;            /*!< CAPTURE register D has grabbed the value in the counter                   */
            uint32_t            : 19;
    } STMINTCLR_b;
  } ;

  union {
    __IOM uint32_t STMINTSET;                   /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< COUNTER is greater than or equal to COMPARE register A.                   */
      __IOM uint32_t COMPAREB   : 1;            /*!< COUNTER is greater than or equal to COMPARE register B.                   */
      __IOM uint32_t COMPAREC   : 1;            /*!< COUNTER is greater than or equal to COMPARE register C.                   */
      __IOM uint32_t COMPARED   : 1;            /*!< COUNTER is greater than or equal to COMPARE register D.                   */
      __IOM uint32_t COMPAREE   : 1;            /*!< COUNTER is greater than or equal to COMPARE register E.                   */
      __IOM uint32_t COMPAREF   : 1;            /*!< COUNTER is greater than or equal to COMPARE register F.                   */
      __IOM uint32_t COMPAREG   : 1;            /*!< COUNTER is greater than or equal to COMPARE register G.                   */
      __IOM uint32_t COMPAREH   : 1;            /*!< COUNTER is greater than or equal to COMPARE register H.                   */
      __IOM uint32_t OVERFLOW   : 1;            /*!< COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.                   */
      __IOM uint32_t CAPTUREA   : 1;            /*!< CAPTURE register A has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREB   : 1;            /*!< CAPTURE register B has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREC   : 1;            /*!< CAPTURE register C has grabbed the value in the counter                   */
      __IOM uint32_t CAPTURED   : 1;            /*!< CAPTURE register D has grabbed the value in the counter                   */
            uint32_t            : 19;
    } STMINTSET_b;
  } ;
} SECURESTIMER_Type;                            /*!< Size = 272 (0x110)                                                        */



/* =========================================================================================================================== */
/* ================                                        SECURETIMER                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Counter/Timer (SECURETIMER)
  */

typedef struct {                                /*!< SECURETIMER Structure                                                     */

  union {
    __IOM uint32_t CTRL;                        /*!< General Timer Controls                                                    */

    struct {
            uint32_t            : 31;
      __IOM uint32_t RESET      : 1;            /*!< Write to 1 to reset all timers (self-clearing)                            */
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< General Timer status                                                      */

    struct {
      __IOM uint32_t ACTIVE     : 16;           /*!< Indicates which timers are currnetly active (enabled)                     */
      __IOM uint32_t NTIMERS    : 5;            /*!< Indicates the number of timer blocks present in the design                */
            uint32_t            : 11;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t GLOBEN;                      /*!< Alternate enables for all TIMERs.                                         */

    struct {
      __IOM uint32_t ENB0       : 1;            /*!< Alternate enable for timer 0                                              */
      __IOM uint32_t ENB1       : 1;            /*!< Alternate enable for timer 1                                              */
      __IOM uint32_t ENB2       : 1;            /*!< Alternate enable for timer 2                                              */
      __IOM uint32_t ENB3       : 1;            /*!< Alternate enable for timer 3                                              */
            uint32_t            : 25;
      __IOM uint32_t ENABLEALLINPUTS : 1;       /*!< Override to enable all GPIO inputs                                        */
      __IOM uint32_t ADCEN      : 1;            /*!< ADC controls enable for timer 3                                           */
            uint32_t            : 1;
    } GLOBEN_b;
  } ;
  __IM  uint32_t  RESERVED1[19];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

