zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t LEN        : 22;           /*!< Buffer size (bottom two bits assumed to be zero to ensure a
                                                     multiple of 4 bytes)                                                      */
            uint32_t            : 8;
    } LEN_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t RESULT;                      /*!< CRC Seed/Result                                                           */

    struct {
      __IOM uint32_t CRC        : 32;           /*!< CRC Seed/Result. Software must seed the CRC with 0xFFFFFFFF
                                                     before starting a CRC operation (unless the CRC is continued
                                                     from a previous operation).                                               */
    } RESULT_b;
  } ;
  __IM  uint32_t  RESERVED3[17];

  union {
    __IOM uint32_t LOCKCTRL;                    /*!< LOCK Control                                                              */

    struct {
      __IOM uint32_t SELECT     : 8;            /*!< LOCK Function Select register.                                            */
            uint32_t            : 24;
    } LOCKCTRL_b;
  } ;

  union {
    __IOM uint32_t LOCKSTAT;                    /*!< LOCK Status                                                               */

    struct {
      __IOM uint32_t STATUS     : 32;           /*!< Lock status. Bit is high to signify it is enabled. 0: LOCK01,
                                                     1: LOCK02, 4: LOCK11, 5: LOCK12, 30: LOCK9D, 31: LOCK9E                   */
    } LOCKSTAT_b;
  } ;

  union {
    __IOM uint32_t KEY0;                        /*!< Key0                                                                      */

    struct {
      __IOM uint32_t KEY0       : 32;           /*!< Bits [31:0] of the 128-bit key should be written to this register.
                                                     To protect key values, the register always returns 0x00000000.            */
    } KEY0_b;
  } ;

  union {
    __IOM uint32_t KEY1;                        /*!< Key1                                                                      */

    struct {
      __IOM uint32_t KEY1       : 32;           /*!< Bits [63:32] of the 128-bit key should be written to this register.
                                                     To protect key values, the register always returns 0x00000000.            */
    } KEY1_b;
  } ;

  union {
    __IOM uint32_t KEY2;                        /*!< Key2                                                                      */

    struct {
      __IOM uint32_t KEY2       : 32;           /*!< Bits [95:64] of the 128-bit key should be written to this register.
                                                     To protect key values, the register always returns 0x00000000.            */
    } KEY2_b;
  } ;

  union {
    __IOM uint32_t KEY3;                        /*!< Key3                                                                      */

    struct {
      __IOM uint32_t KEY3       : 32;           /*!< Bits [127:96] of the 128-bit key should be written to this register.
                                                     To protect key values, the register always returns 0x00000000.            */
    } KEY3_b;
  } ;
} SECURITY_Type;                                /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                            SSC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System security control (SSC)
  */

typedef struct {                                /*!< SSC Structure                                                             */

  union {
    __IOM uint32_t SRLOCKS;                     /*!< Security resource locks                                                   */

    struct {
      __IOM uint32_t LOCKDCAIC  : 1;            /*!< Write 1 to disable access to the instruction cache direct cache
                                                     access registers DCAICLR and DCAICRR. Write 0 has no effect.              */
      __IOM uint32_t LOCKPAHB   : 1;            /*!< Write 1 to disable writes to the PAHBCR register from software
                                                     or from a debug agent connected to the processor. Write
                                                     0 has no effect.                                                          */
      __IOM uint32_t LOCKDTGU   : 1;            /*!< Write 1 to disable writes to registers that are associated with
                                                     the DTCM interface security gating from software or from
                                                     a debug agent connected to the processor. Write 0 has no
                                                     effect.                                                                   */
      __IOM uint32_t LOCKITGU   : 1;            /*!< Write 1 to disable writes to registers that are associated with
                                                     the ITCM interface security gating from software or from
                                                     a debug agent connected to the processor. Write 0 has no
                                                     effect.                                                                   */
      __IOM uint32_t LOCKTCM    : 1;            /*!< Write 1 to disable writes to registers that are associated with
                                                     the TCM region from software or from a debug agent connected
                                                     to the processor. Write 0 has no effect.                                  */
      __IOM uint32_t LOCKSAU    : 1;            /*!< Write 1 to disable writes to registers that are associated with
                                                     the SAU region from software or from a debug agent connected
                                                     to the processor. Write 0 has no effect.                                  */
      __IOM uint32_t LOCKNSMPU  : 1;            /*!< Write 1 to disable writes to registers that are associated with
                                                     the Non-secure MPU region from software or from a debug
                                                     agent connected to the processor. Write 0 has no effect.                  */
      __IOM uint32_t LOCKSMPU   : 1;            /*!< Write 1 to disable writes to registers that are associated with
                                                     the Secure Memory Protection Unit (MPU) region from software
                                                     or from a debug agent connected to the processor. Write
                                                     0 has no effect.                                                          */
      __IOM uint32_t LOCKNSVTOR : 1;            /*!< Write 1 to disable writes to the VTOR_NS register. Write 0 has
                                                     no effect.                                                                */
      __IOM uint32_t LOCKSVTAIRCR : 1;          /*!< Write 1 to disable writes to the following secure registers
                                                     from software or from a debug agent that is connected to
                                                     the processor: VTOR_S/AIRCR.PRIS/AIRCR.BFHFNMINS. Write
                                                     0 has no effect.                                                          */
      __IOM uint32_t LOCKSSRAMPROT : 1;         /*!< Write 1 to disables writes to the SSRAMxPROT register from software,
                                                     any master, or from any debug agent. Once set, it remains
                                                     locked until the next system reset. Write 0 has no effect.                */
      __IOM uint32_t LOCKCM4CODEBASE : 1;       /*!< Write 1 to disables writes to the CM4CODEBASE register from
                                                     software, any master                                                      */
      __IOM uint32_t LOCKFLASHSPROT : 1;        /*!< Write 1 to disables writes to the FLASHSPROT register from software,
                                                     any master                                                                */
            uint32_t            : 19;
    } SRLOCKS_b;
  } ;

  union {
    __IOM uint32_t SSLOCKS;                     /*!< System Security locks                                                     */

