zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
typedef struct {                                /*!< TIMER Structure                                                           */

  union {
    __IOM uint32_t CTRL;                        /*!< General Timer Controls                                                    */

    struct {
            uint32_t            : 31;
      __IOM uint32_t RESET      : 1;            /*!< Write to 1 to reset all timers (self-clearing)                            */
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< General Timer status                                                      */

    struct {
      __IOM uint32_t ACTIVE     : 16;           /*!< Indicates which timers are currnetly active (enabled)                     */
      __IOM uint32_t NTIMERS    : 5;            /*!< Indicates the number of timer blocks present in the design                */
            uint32_t            : 11;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t GLOBEN;                      /*!< Alternate enables for all TIMERs.                                         */

    struct {
      __IOM uint32_t ENB0       : 1;            /*!< Alternate enable for timer 0                                              */
      __IOM uint32_t ENB1       : 1;            /*!< Alternate enable for timer 1                                              */
      __IOM uint32_t ENB2       : 1;            /*!< Alternate enable for timer 2                                              */
      __IOM uint32_t ENB3       : 1;            /*!< Alternate enable for timer 3                                              */
      __IOM uint32_t ENB4       : 1;            /*!< Alternate enable for timer 4                                              */
      __IOM uint32_t ENB5       : 1;            /*!< Alternate enable for timer 5                                              */
      __IOM uint32_t ENB6       : 1;            /*!< Alternate enable for timer 6                                              */
      __IOM uint32_t ENB7       : 1;            /*!< Alternate enable for timer 7                                              */
      __IOM uint32_t ENB8       : 1;            /*!< Alternate enable for timer 8                                              */
      __IOM uint32_t ENB9       : 1;            /*!< Alternate enable for timer 9                                              */
      __IOM uint32_t ENB10      : 1;            /*!< Alternate enable for timer 10                                             */
      __IOM uint32_t ENB11      : 1;            /*!< Alternate enable for timer 11                                             */
      __IOM uint32_t ENB12      : 1;            /*!< Alternate enable for timer 12                                             */
      __IOM uint32_t ENB13      : 1;            /*!< Alternate enable for timer 13                                             */
      __IOM uint32_t ENB14      : 1;            /*!< Alternate enable for timer 14                                             */
      __IOM uint32_t ENB15      : 1;            /*!< Alternate enable for timer 15                                             */
            uint32_t            : 13;
      __IOM uint32_t ENABLEALLINPUTS : 1;       /*!< Override to enable all GPIO inputs                                        */
      __IOM uint32_t ADCEN      : 1;            /*!< ADC controls enable for timer 3                                           */
            uint32_t            : 1;
    } GLOBEN_b;
  } ;
  __IM  uint32_t  RESERVED1[19];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t TMR00INT   : 1;            /*!< Counter/Timer 0 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR01INT   : 1;            /*!< Counter/Timer 0 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR10INT   : 1;            /*!< Counter/Timer 1 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR11INT   : 1;            /*!< Counter/Timer 1 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR20INT   : 1;            /*!< Counter/Timer 2 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR21INT   : 1;            /*!< Counter/Timer 2 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR30INT   : 1;            /*!< Counter/Timer 3 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR31INT   : 1;            /*!< Counter/Timer 3 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR40INT   : 1;            /*!< Counter/Timer 4 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR41INT   : 1;            /*!< Counter/Timer 4 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR50INT   : 1;            /*!< Counter/Timer 5 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR51INT   : 1;            /*!< Counter/Timer 5 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR60INT   : 1;            /*!< Counter/Timer 6 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR61INT   : 1;            /*!< Counter/Timer 6 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR70INT   : 1;            /*!< Counter/Timer 7 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR71INT   : 1;            /*!< Counter/Timer 7 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR80INT   : 1;            /*!< Counter/Timer 8 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR81INT   : 1;            /*!< Counter/Timer 8 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR90INT   : 1;            /*!< Counter/Timer 9 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR91INT   : 1;            /*!< Counter/Timer 9 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR100INT  : 1;            /*!< Counter/Timer 10 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR101INT  : 1;            /*!< Counter/Timer 10 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR110INT  : 1;            /*!< Counter/Timer 11 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR111INT  : 1;            /*!< Counter/Timer 11 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR120INT  : 1;            /*!< Counter/Timer 12 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR121INT  : 1;            /*!< Counter/Timer 12 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR130INT  : 1;            /*!< Counter/Timer 13 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR131INT  : 1;            /*!< Counter/Timer 13 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR140INT  : 1;            /*!< Counter/Timer 14 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR141INT  : 1;            /*!< Counter/Timer 14 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR150INT  : 1;            /*!< Counter/Timer 15 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR151INT  : 1;            /*!< Counter/Timer 15 interrupt based on CMP1.                                 */
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

