zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR15TRIGSEL : 8;          /*!< Counter/Timer 15 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE15_b;
  } ;

  union {
    __IOM uint32_t TMR15LMTVAL;                 /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR15LMTVAL : 8;           /*!< Counter/Timer 15 Limit Readback                                           */
            uint32_t            : 24;
    } TMR15LMTVAL_b;
  } ;

  union {
    __IOM uint32_t TIMERSPARES;                 /*!< Timer Spare Regs                                                          */

    struct {
      __IOM uint32_t TMRSPARES  : 32;           /*!< Placeholer spare registes that can be used as needed for future
                                                     use                                                                       */
    } TIMERSPARES_b;
  } ;
} TIMER_Type;                                   /*!< Size = 1020 (0x3fc)                                                       */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial UART (UART0)
  */

typedef struct {                                /*!< UART0 Structure                                                           */

  union {
    __IOM uint32_t DR;                          /*!< UART Data                                                                 */

    struct {
      __IOM uint32_t DATA       : 8;            /*!< Receive (read) data character. Transmit (write) data character.           */
      __IOM uint32_t FEDATA     : 1;            /*!< Framing error. When set to 1, it indicates that the received
                                                     character did not have a valid stop bit (a valid stop bit
                                                     is 1). In FIFO mode, this error is associated with the
                                                     character at the top of the FIFO.                                         */
      __IOM uint32_t PEDATA     : 1;            /*!< Parity error. When set to 1, it indicates that the parity of
                                                     the received data character does not match the parity that
                                                     the EPS and SPS bits in the Line Control Register, UARTLCRH
                                                     select. In FIFO mode, this error is associated with the
                                                     character at the top of the FIFO.                                         */
      __IOM uint32_t BEDATA     : 1;            /*!< Break error. This bit is set to 1 if a break condition was detected,
                                                     indicating that the received data input was held LOW for
                                                     longer than a full-word transmission time (defined as start,
                                                     data, parity and stop bits). In FIFO mode, this error is
                                                     associated with the character at the top of the FIFO. When
                                                     a break occurs, only one 0 character is loaded into the
                                                     FIFO. The next character is only enabled after the receive
                                                     data input goes to a 1 (marking state), and the next valid
                                                     start bit is received.                                                    */
      __IOM uint32_t OEDATA     : 1;            /*!< Overrun error. This bit is set to 1 if data is received and
                                                     the receive FIFO is already full. This is cleared to 0
                                                     once there is an empty space in the FIFO and a new character
                                                     can be written to it.                                                     */
            uint32_t            : 20;
    } DR_b;
  } ;

  union {
    __IOM uint32_t RSR;                         /*!< UART Status                                                               */

    struct {
      __IOM uint32_t FESTAT     : 1;            /*!< Framing error. When set to 1, it indicates that the received
                                                     character did not have a valid stop bit (a valid stop bit
                                                     is 1). This bit is cleared to 0 by a write to UARTECR.
                                                     In FIFO mode, this error is associated with the character
                                                     at the top of the FIFO.                                                   */
      __IOM uint32_t PESTAT     : 1;            /*!< Parity error. When set to 1, it indicates that the parity of
                                                     the received data character does not match the parity that
                                                     the EPS and SPS bits in the Line Control Register, UARTLCRH
                                                     select. This bit is cleared to 0 by a write to UARTECR.
                                                     In FIFO mode, this error is associated with the character
                                                     at the top of the FIFO.                                                   */
      __IOM uint32_t BESTAT     : 1;            /*!< Break error. This bit is set to 1 if a break condition was detected,
                                                     indicating that the received data input was held LOW for
                                                     longer than a full-word transmission time (defined as start,
                                                     data, parity, and stop bits). This bit is cleared to 0
                                                     after a write to UARTECR. In FIFO mode, this error is associated
                                                     with the character at the top of the FIFO. When a break
                                                     occurs, only one 0 character is loaded into the FIFO. The
                                                     next character is only enabled after the receive data input
                                                     goes to a 1 (marking state) and the next valid start bit
                                                     is received.                                                              */
      __IOM uint32_t OESTAT     : 1;            /*!< Overrun error. This bit is set to 1 if data is received and
                                                     the FIFO is already full. This bit is cleared to 0 by a
                                                     write to UARTECR. The FIFO contents remain valid because
                                                     no more data is written when the FIFO is full, only the
                                                     contents of the shift register are overwritten. The CPU
                                                     must now read the data, to empty the FIFO.                                */
      __IOM uint32_t DMACPL     : 1;            /*!< This is the DMA transfer complete indicator.                              */
      __IOM uint32_t DMAERR     : 1;            /*!< This is the DMA transfer error indicator.                                 */
            uint32_t            : 26;
    } RSR_b;
  } ;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t FR;                          /*!< Flags                                                                     */

