zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t BRK        : 1;            /*!< This bit holds the break set. If this bit is set to 1, a low-level
                                                     is continually output on the UARTTXD output, after completing
                                                     transmission of the current character. For the proper execution
                                                     of the break command, the software must set this bit for
                                                     at least two complete frames. For normal use, this bit
                                                     must be cleared to 0.                                                     */
      __IOM uint32_t PEN        : 1;            /*!< This bit holds the parity enable. 0 = parity is disabled and
                                                     no parity bit added to the data frame. 1 = parity checking
                                                     and generation is enabled.                                                */
      __IOM uint32_t EPS        : 1;            /*!< This bit holds the even parity select. Controls the type of
                                                     parity the UART uses during transmission and reception:
                                                     0 = odd parity. The UART generates or checks for an odd
                                                     number of 1s in the data and parity bits. 1 = even parity.
                                                     The UART generates or checks for an even number of 1s in
                                                     the data and parity bits. This bit has no effect when the
                                                     PEN bit disables parity checking and generation.                          */
      __IOM uint32_t STP2       : 1;            /*!< This bit holds the two stop bits select. If this bit is set
                                                     to 1, two stop bits are transmitted at the end of the frame.              */
      __IOM uint32_t FEN        : 1;            /*!< This bit holds the FIFO enable. 0 = FIFOs are disabled (character
                                                     mode) that is, the FIFOs become 1-byte-deep holding registers.
                                                     1 = transmit and receive FIFO buffers are enabled (FIFO
                                                     mode).                                                                    */
      __IOM uint32_t WLEN       : 2;            /*!< These bits hold the write length. These bits indicate the number
                                                     of data bits transmitted or received in a frame as follows:
                                                     b11 = 8 bits, b10 = 7 bits, b01 = 6 bits, b00 = 5 bits.                   */
      __IOM uint32_t SPS        : 1;            /*!< This bit holds the stick parity select. If the EPS bit is 0
                                                     then the parity bit is transmitted and checked as a 1.
                                                     If the EPS bit is 1 then the parity bit is transmitted
                                                     and checked as a 0. This bit has no effect when the PEN
                                                     bit disables parity checking and generation.                              */
      __IOM uint32_t RXSTP2     : 1;            /*!< This bit holds the two stop bits select. If this bit is set
                                                     to 1, the receive logic wll check for two stop bits being
                                                     received.                                                                 */
            uint32_t            : 23;
    } LCRH_b;
  } ;

  union {
    __IOM uint32_t CR;                          /*!< Control                                                                   */

    struct {
      __IOM uint32_t UARTEN     : 1;            /*!< This bit is the UART enable. 0 = UART is disabled. If the UART
                                                     is disabled in the middle of transmission or reception,
                                                     it completes the current character before stopping. 1 =
                                                     the UART is enabled. Data transmission and reception occurs
                                                     for either UART signals or SIR signals depending on the
                                                     setting of the SIREN bit.                                                 */
      __IOM uint32_t SIREN      : 1;            /*!< This bit is the SIR ENDEC enable. If this bit is set to 1, the
                                                     IrDA SIR ENDEC is enabled. This bit has no effect if the
                                                     UART is not enabled by bit 0 being set to 1. When the IrDA
                                                     SIR ENDEC is enabled, data is transmitted and received
                                                     on nSIROUT and SIRIN. UARTTXD remains in the marking state
                                                     (set to 1). Signal transitions on UARTRXD or modem status
                                                     inputs have no effect. When the IrDA SIR ENDEC is disabled,
                                                     nSIROUT remains cleared to 0 (no light pulse generated),
                                                     and signal transitions on SIRIN have no effect. NOTE: The
                                                     SIR input (SIRIN) is mapped to the UARTRX pin (selected
                                                     via GPIO configuration) and the SIR output (nSIROUT) is
                                                     mapped to the UARTTX pin when SIREN is enabled.                           */
      __IOM uint32_t SIRLP      : 1;            /*!< This bit is the SIR low power select. This bit selects the IrDA
                                                     encoding mode. If this bit is cleared to 0, low-level bits
                                                     are transmitted as an active high pulse with a width of
                                                     3/16th of the bit period. If this bit is set to 1, low-level
                                                     bits are transmitted with a pulse width which is 3 times
                                                     the period of the IrLPBaud16 input signal, regardless of
                                                     the selected bit rate. Setting this bit uses less power,
                                                     but might reduce transmission distances.                                  */
      __IOM uint32_t RSVDB      : 1;            /*!< This bitfield is reserved for future use.                                 */
      __IOM uint32_t RSVDA      : 3;            /*!< This bitfield is reserved for future use.                                 */
      __IOM uint32_t LBE        : 1;            /*!< This bit is the loopback enable. If this bit is set to 1 and
                                                     the SIREN bit is set to 1 and the SIRTEST bit in the Test
                                                     Control Register, UARTTCR is set to 1, then the nSIROUT
                                                     path is inverted, and fed through to the SIRIN path. The
                                                     SIRTEST bit in the test register must be set to 1 to override
                                                     the normal half-duplex SIR operation. This must be the
                                                     requirement for accessing the test registers during normal
                                                     operation, and SIRTEST must be cleared to 0 when loopback
                                                     testing is finished. This feature reduces the amount of
                                                     external coupling required during system test. If this
                                                     bit is set to 1, and the SIRTEST bit is set to 0, the UARTTXD
                                                     path is fed through to the UARTRXD path. In either SIR
                                                     mode or UART mode, when this bit is set, the modem outputs
                                                     are also fed through to the modem inputs. This bit is cleared
                                                     to 0 on reset, to disable loopback.                                       */
      __IOM uint32_t TXE        : 1;            /*!< This bit is the transmit enable. If this bit is set to 1, the
                                                     transmit section of the UART is enabled. Data transmission
                                                     occurs for either UART signals, or SIR signals depending
                                                     on the setting of the SIREN bit. When the UART is disabled
                                                     in the middle of transmission, it completes the current
                                                     character before stopping.                                                */
      __IOM uint32_t RXE        : 1;            /*!< This bit is the receive enable. If this bit is set to 1, the
                                                     receive section of the UART is enabled. Data reception
                                                     occurs for either UART signals or SIR signals depending
                                                     on the setting of the SIREN bit. When the UART is disabled
                                                     in the middle of reception, it completes the current character
                                                     before stopping.                                                          */
      __IOM uint32_t DTR        : 1;            /*!< This bit enables data transmit ready. This bit is the complement
                                                     of the UART data transmit ready, nUARTDTR, modem status
                                                     output. That is, when the bit is programmed to a 1 then
                                                     nUARTDTR is LOW.                                                          */
      __IOM uint32_t RTS        : 1;            /*!< This bit enables request to send. This bit is the complement
                                                     of the UART request to send, nUARTRTS, modem status output.
                                                     That is, when the bit is programmed to a 1 then nUARTRTS
                                                     is LOW.                                                                   */
      __IOM uint32_t OUT1       : 1;            /*!< This bit is the complement of the UART Out1 (nUARTOut1) modem
                                                     status output. That is, when the bit is programmed to a
                                                     1 the output is 0. For DTE this can be used as Data Carrier
                                                     Detect (DCD).                                                             */
      __IOM uint32_t OUT2       : 1;            /*!< This bit is the complement of the UART Out2 (nUARTOut2) modem
                                                     status output. That is, when the bit is programmed to a
                                                     1, the output is 0. For DTE this can be used as Ring Indicator
                                                     (RI).                                                                     */
      __IOM uint32_t RTSEN      : 1;            /*!< This bit enables RTS hardware flow control. If this bit is set
                                                     to 1, RTS hardware flow control is enabled. Data is only
                                                     requested when there is space in the receive FIFO for it
                                                     to be received.                                                           */
      __IOM uint32_t CTSEN      : 1;            /*!< This bit enables CTS hardware flow control. If this bit is set
                                                     to 1, CTS hardware flow control is enabled. Data is only
                                                     transmitted when the nUARTCTS signal is asserted.                         */
            uint32_t            : 16;
    } CR_b;
  } ;

  union {
    __IOM uint32_t IFLS;                        /*!< FIFO Interrupt Level Select                                               */

