zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
    struct {
      __IOM uint32_t BF20       : 3;            /*!< Manually set the Tx Clock phase select. These bits will tune
                                                     the HS TX path sample timing between digital and analog
                                                     inside PHY 0x0 represents the earliest phase 0x7 represents
                                                     the latest phase The delay associated with each step is
                                                     256ps                                                                     */
      __IOM uint32_t BF43       : 2;            /*!< Squelch detector bias current tuning, 0x0 represents the minimum
                                                     bias current 0x3 represents the maximum bias current                      */
      __IOM uint32_t BF55       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF76       : 2;            /*!< disconnect detector bias current tuning                                   */
            uint32_t            : 24;
    } REG04_b;
  } ;

  union {
    __IOM uint32_t REG08;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF30       : 4;            /*!< 0x0 represents the minimum bias current 0x3 represents the maximum
                                                     bias current Rx squelch trigger point configures. Allows
                                                     tuning of the squelch trigger point in order to compensate
                                                     for package and board level parasitic. 0x0:112.5mV 0x1:150mV
                                                     0x2:87.5mV 0x3:162.5mV 0x4:100mV 0x5:137.5mV 0x6:75mV 0x7:150mV
                                                     0x8:125mV 0x9:162.5mV 0xA:100mV 0xB:175mV 0xC:150mV(default)
                                                     0xD:187.5mV 0xE:125mV 0xF:200mV                                           */
      __IOM uint32_t BF64       : 3;            /*!< HS eye height tuning 0x0:400mV(default) 0x1:475mV 0x2:350mV
                                                     0x3:500mV 0x4:412.5mV 0x5:425mV 0x6:437.5mV 0x7:450mV                     */
      __IOM uint32_t BF77       : 1;            /*!< digital squelch filter select, this bit is used to filter the
                                                     glitch on the HS RX squelch signal. 1: 1 clock cycle filter
                                                     0: 2 clock cycle fitter                                                   */
            uint32_t            : 24;
    } REG08_b;
  } ;

  union {
    __IOM uint32_t REG0C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< BG output voltage reference adjust, normally these bits are
                                                     recommended to be kept as the default values. 00: standard
                                                     center level around 1.25v output, recommended 01: relative
                                                     higher output 1x: relative higher output                                  */
      __IOM uint32_t BF62       : 5;            /*!< 45ohm HS ODT value tuning and FS/LS driver strength tuning 5'b11111:
                                                     smallest HS ODT value and largest FS/LS driver strength
                                                     and fastest FS/LS slew rate 5'b10000: biggest HS ODT value
                                                     and smallest FS/LS driver strength and slowest FS/LS slew
                                                     rate                                                                      */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG0C_b;
  } ;

  union {
    __IOM uint32_t REG10;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Bypass squelch trigger point configure in chirp modes , active
                                                     high, keep the default value is strongly recommended .
                                                     1: Bypass squelch trigger point configure in chirp modes
                                                     , 0: squelch trigger point set to 250mV in chirp modes.                   */
      __IOM uint32_t BF11       : 1;            /*!< Turn off LS/FS differential receiver in suspend mode, active
                                                     low 1: keep the LS/FS differential receiver , pin fss_rxrcv
                                                     will toggling according to the DP/DM state 0: turn off
                                                     the LS/FS differential receiver, pin fss_rxrcv will not
                                                     toggling according to the DP/DM state                                     */
      __IOM uint32_t BF22       : 1;            /*!< Half bit pre-emphasis enable. Active high 1: half bit pre-emphasize
                                                     mode, recommended 0: full bit pre-emphasize mode                          */
      __IOM uint32_t BF33       : 1;            /*!< Single ended disconnect detection enable, active high. 1: enable
                                                     Single ended disconnect detection 0: disenable Single ended
                                                     disconnect detection                                                      */
      __IOM uint32_t BF74       : 4;            /*!< HOST disconnect detection trigger point. Only valid in host
                                                     mode. Allows compensation for package and board level parasitics
                                                     which tend to drop in the input voltage. 4'b0000:625mV
                                                     4'b0001:675mV 4'b0010:612.5mV 4'b0011:575mV 4'b0100:550mV
                                                     4'b0101:600mV (default) 4'b0110:537.5mV 4'b0111:500mV 4'b1000:600mV
                                                     4'b1001:650mV 4'b1010:587.5mV 4'b1011:550mV 4'b1100:575mV
                                                     4'b1101:625mV 4'b1110:562.5mV 4'b1111:525mV                               */
            uint32_t            : 24;
    } REG10_b;
  } ;

  union {
    __IOM uint32_t REG14;                       /*!< Register description here                                                 */

