zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
#define DC_LAYER0MODE_FlipYenable_Msk     (0x80UL)                  /*!< FlipYenable (Bitfield-Mask: 0x01)                     */
#define DC_LAYER0MODE_FlipXenable_Pos     (6UL)                     /*!< FlipXenable (Bit 6)                                   */
#define DC_LAYER0MODE_FlipXenable_Msk     (0x40UL)                  /*!< FlipXenable (Bitfield-Mask: 0x01)                     */
#define DC_LAYER0MODE_MODElayerregisterprotect_Pos (5UL)            /*!< MODElayerregisterprotect (Bit 5)                      */
#define DC_LAYER0MODE_MODElayerregisterprotect_Msk (0x20UL)         /*!< MODElayerregisterprotect (Bitfield-Mask: 0x01)        */
#define DC_LAYER0MODE_LAYER0COLMODE_Pos   (0UL)                     /*!< LAYER0COLMODE (Bit 0)                                 */
#define DC_LAYER0MODE_LAYER0COLMODE_Msk   (0x1fUL)                  /*!< LAYER0COLMODE (Bitfield-Mask: 0x1f)                   */
/* =====================================================  LAYER0STARTXY  ===================================================== */
#define DC_LAYER0STARTXY_LAYER0XOFF_Pos   (16UL)                    /*!< LAYER0XOFF (Bit 16)                                   */
#define DC_LAYER0STARTXY_LAYER0XOFF_Msk   (0xffff0000UL)            /*!< LAYER0XOFF (Bitfield-Mask: 0xffff)                    */
#define DC_LAYER0STARTXY_LAYER0YOFF_Pos   (0UL)                     /*!< LAYER0YOFF (Bit 0)                                    */
#define DC_LAYER0STARTXY_LAYER0YOFF_Msk   (0xffffUL)                /*!< LAYER0YOFF (Bitfield-Mask: 0xffff)                    */
/* =====================================================  LAYER0SIZEXY  ====================================================== */
#define DC_LAYER0SIZEXY_LAYER0PIXSZEX_Pos (16UL)                    /*!< LAYER0PIXSZEX (Bit 16)                                */
#define DC_LAYER0SIZEXY_LAYER0PIXSZEX_Msk (0xffff0000UL)            /*!< LAYER0PIXSZEX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER0SIZEXY_LAYER0PIXSZEY_Pos (0UL)                     /*!< LAYER0PIXSZEY (Bit 0)                                 */
#define DC_LAYER0SIZEXY_LAYER0PIXSZEY_Msk (0xffffUL)                /*!< LAYER0PIXSZEY (Bitfield-Mask: 0xffff)                 */
/* ======================================================  LAYER0ADDR  ======================================================= */
#define DC_LAYER0ADDR_LAYER0STARTADDRFBUF_Pos (0UL)                 /*!< LAYER0STARTADDRFBUF (Bit 0)                           */
#define DC_LAYER0ADDR_LAYER0STARTADDRFBUF_Msk (0xffffffffUL)        /*!< LAYER0STARTADDRFBUF (Bitfield-Mask: 0xffffffff)       */
/* =====================================================  LAYER0STRIDE  ====================================================== */
#define DC_LAYER0STRIDE_RSVD021_Pos       (21UL)                    /*!< RSVD021 (Bit 21)                                      */
#define DC_LAYER0STRIDE_RSVD021_Msk       (0xffe00000UL)            /*!< RSVD021 (Bitfield-Mask: 0x7ff)                        */
#define DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_Pos (19UL)                /*!< LAYER0AXIFIFOTHLD (Bit 19)                            */
#define DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_Msk (0x180000UL)          /*!< LAYER0AXIFIFOTHLD (Bitfield-Mask: 0x03)               */
#define DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_Pos (16UL)               /*!< LAYER0AXIBURSTBITS (Bit 16)                           */
#define DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_Msk (0x70000UL)          /*!< LAYER0AXIBURSTBITS (Bitfield-Mask: 0x07)              */
#define DC_LAYER0STRIDE_LAYER0STRIDEDIST_Pos (0UL)                  /*!< LAYER0STRIDEDIST (Bit 0)                              */
#define DC_LAYER0STRIDE_LAYER0STRIDEDIST_Msk (0xffffUL)             /*!< LAYER0STRIDEDIST (Bitfield-Mask: 0xffff)              */
/* ======================================================  LAYER0RESXY  ====================================================== */
#define DC_LAYER0RESXY_LAYER0PIXRESX_Pos  (16UL)                    /*!< LAYER0PIXRESX (Bit 16)                                */
#define DC_LAYER0RESXY_LAYER0PIXRESX_Msk  (0xffff0000UL)            /*!< LAYER0PIXRESX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER0RESXY_LAYER0PIXRESY_Pos  (0UL)                     /*!< LAYER0PIXRESY (Bit 0)                                 */
#define DC_LAYER0RESXY_LAYER0PIXRESY_Msk  (0xffffUL)                /*!< LAYER0PIXRESY (Bitfield-Mask: 0xffff)                 */
/* ========================================================  DBICMD  ========================================================= */
#define DC_DBICMD_RSVD31_Pos              (31UL)                    /*!< RSVD31 (Bit 31)                                       */
#define DC_DBICMD_RSVD31_Msk              (0x80000000UL)            /*!< RSVD31 (Bitfield-Mask: 0x01)                          */
#define DC_DBICMD_DIRECTDATA_Pos          (30UL)                    /*!< DIRECTDATA (Bit 30)                                   */
#define DC_DBICMD_DIRECTDATA_Msk          (0x40000000UL)            /*!< DIRECTDATA (Bitfield-Mask: 0x01)                      */
#define DC_DBICMD_RSVD29_Pos              (29UL)                    /*!< RSVD29 (Bit 29)                                       */
#define DC_DBICMD_RSVD29_Msk              (0x20000000UL)            /*!< RSVD29 (Bitfield-Mask: 0x01)                          */
#define DC_DBICMD_READDBI_Pos             (28UL)                    /*!< READDBI (Bit 28)                                      */
#define DC_DBICMD_READDBI_Msk             (0x10000000UL)            /*!< READDBI (Bitfield-Mask: 0x01)                         */
#define DC_DBICMD_LOCALSTORE_Pos          (27UL)                    /*!< LOCALSTORE (Bit 27)                                   */
#define DC_DBICMD_LOCALSTORE_Msk          (0x8000000UL)             /*!< LOCALSTORE (Bitfield-Mask: 0x01)                      */
#define DC_DBICMD_RSVD11_Pos              (16UL)                    /*!< RSVD11 (Bit 16)                                       */
#define DC_DBICMD_RSVD11_Msk              (0x7ff0000UL)             /*!< RSVD11 (Bitfield-Mask: 0x7ff)                         */
#define DC_DBICMD_DATA2DBI_Pos            (0UL)                     /*!< DATA2DBI (Bit 0)                                      */
#define DC_DBICMD_DATA2DBI_Msk            (0xffffUL)                /*!< DATA2DBI (Bitfield-Mask: 0xffff)                      */
/* ========================================================  DBIRDAT  ======================================================== */
#define DC_DBIRDAT_READTYPEB_Pos          (0UL)                     /*!< READTYPEB (Bit 0)                                     */
#define DC_DBIRDAT_READTYPEB_Msk          (0xffffffffUL)            /*!< READTYPEB (Bitfield-Mask: 0xffffffff)                 */
/* =========================================================  CONFG  ========================================================= */
#define DC_CONFG_CFGLAYER3TSCMEM_Pos      (31UL)                    /*!< CFGLAYER3TSCMEM (Bit 31)                              */
#define DC_CONFG_CFGLAYER3TSCMEM_Msk      (0x80000000UL)            /*!< CFGLAYER3TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER2TSCMEM_Pos      (30UL)                    /*!< CFGLAYER2TSCMEM (Bit 30)                              */
#define DC_CONFG_CFGLAYER2TSCMEM_Msk      (0x40000000UL)            /*!< CFGLAYER2TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER1TSCMEM_Pos      (29UL)                    /*!< CFGLAYER1TSCMEM (Bit 29)                              */
#define DC_CONFG_CFGLAYER1TSCMEM_Msk      (0x20000000UL)            /*!< CFGLAYER1TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER0TSCMEM_Pos      (28UL)                    /*!< CFGLAYER0TSCMEM (Bit 28)                              */
#define DC_CONFG_CFGLAYER0TSCMEM_Msk      (0x10000000UL)            /*!< CFGLAYER0TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_RSVD25_Pos               (25UL)                    /*!< RSVD25 (Bit 25)                                       */
#define DC_CONFG_RSVD25_Msk               (0xe000000UL)             /*!< RSVD25 (Bitfield-Mask: 0x07)                          */
#define DC_CONFG_CFGSPIINTERFACE_Pos      (24UL)                    /*!< CFGSPIINTERFACE (Bit 24)                              */
#define DC_CONFG_CFGSPIINTERFACE_Msk      (0x1000000UL)             /*!< CFGSPIINTERFACE (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER3GAMMALUT_Pos    (23UL)                    /*!< CFGLAYER3GAMMALUT (Bit 23)                            */
#define DC_CONFG_CFGLAYER3GAMMALUT_Msk    (0x800000UL)              /*!< CFGLAYER3GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD22_Pos               (22UL)                    /*!< RSVD22 (Bit 22)                                       */
#define DC_CONFG_RSVD22_Msk               (0x400000UL)              /*!< RSVD22 (Bitfield-Mask: 0x01)                          */
#define DC_CONFG_CFGLAYER3BLENDER_Pos     (21UL)                    /*!< CFGLAYER3BLENDER (Bit 21)                             */
#define DC_CONFG_CFGLAYER3BLENDER_Msk     (0x200000UL)              /*!< CFGLAYER3BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER3EN_Pos          (20UL)                    /*!< CFGLAYER3EN (Bit 20)                                  */
#define DC_CONFG_CFGLAYER3EN_Msk          (0x100000UL)              /*!< CFGLAYER3EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER2GAMMALUT_Pos    (19UL)                    /*!< CFGLAYER2GAMMALUT (Bit 19)                            */
#define DC_CONFG_CFGLAYER2GAMMALUT_Msk    (0x80000UL)               /*!< CFGLAYER2GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD1801_Pos             (18UL)                    /*!< RSVD1801 (Bit 18)                                     */
#define DC_CONFG_RSVD1801_Msk             (0x40000UL)               /*!< RSVD1801 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGLAYER2BLENDER_Pos     (17UL)                    /*!< CFGLAYER2BLENDER (Bit 17)                             */
#define DC_CONFG_CFGLAYER2BLENDER_Msk     (0x20000UL)               /*!< CFGLAYER2BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER2EN_Pos          (16UL)                    /*!< CFGLAYER2EN (Bit 16)                                  */
#define DC_CONFG_CFGLAYER2EN_Msk          (0x10000UL)               /*!< CFGLAYER2EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER1GAMMALUT_Pos    (15UL)                    /*!< CFGLAYER1GAMMALUT (Bit 15)                            */
#define DC_CONFG_CFGLAYER1GAMMALUT_Msk    (0x8000UL)                /*!< CFGLAYER1GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD1401_Pos             (14UL)                    /*!< RSVD1401 (Bit 14)                                     */
#define DC_CONFG_RSVD1401_Msk             (0x4000UL)                /*!< RSVD1401 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGLAYER1BLENDER_Pos     (13UL)                    /*!< CFGLAYER1BLENDER (Bit 13)                             */
#define DC_CONFG_CFGLAYER1BLENDER_Msk     (0x2000UL)                /*!< CFGLAYER1BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER1EN_Pos          (12UL)                    /*!< CFGLAYER1EN (Bit 12)                                  */
#define DC_CONFG_CFGLAYER1EN_Msk          (0x1000UL)                /*!< CFGLAYER1EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER0GAMMALUT_Pos    (11UL)                    /*!< CFGLAYER0GAMMALUT (Bit 11)                            */
#define DC_CONFG_CFGLAYER0GAMMALUT_Msk    (0x800UL)                 /*!< CFGLAYER0GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD3_Pos                (10UL)                    /*!< RSVD3 (Bit 10)                                        */
#define DC_CONFG_RSVD3_Msk                (0x400UL)                 /*!< RSVD3 (Bitfield-Mask: 0x01)                           */
#define DC_CONFG_CFGLAYER0BLENDER_Pos     (9UL)                     /*!< CFGLAYER0BLENDER (Bit 9)                              */
#define DC_CONFG_CFGLAYER0BLENDER_Msk     (0x200UL)                 /*!< CFGLAYER0BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER0EN_Pos          (8UL)                     /*!< CFGLAYER0EN (Bit 8)                                   */
#define DC_CONFG_CFGLAYER0EN_Msk          (0x100UL)                 /*!< CFGLAYER0EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGRGB2YUVEN_Pos         (7UL)                     /*!< CFGRGB2YUVEN (Bit 7)                                  */
#define DC_CONFG_CFGRGB2YUVEN_Msk         (0x80UL)                  /*!< CFGRGB2YUVEN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGDBITYPEBEN_Pos        (6UL)                     /*!< CFGDBITYPEBEN (Bit 6)                                 */
#define DC_CONFG_CFGDBITYPEBEN_Msk        (0x40UL)                  /*!< CFGDBITYPEBEN (Bitfield-Mask: 0x01)                   */
#define DC_CONFG_RSVD0501_Pos             (5UL)                     /*!< RSVD0501 (Bit 5)                                      */
#define DC_CONFG_RSVD0501_Msk             (0x20UL)                  /*!< RSVD0501 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGFORMATTEN_Pos         (4UL)                     /*!< CFGFORMATTEN (Bit 4)                                  */
#define DC_CONFG_CFGFORMATTEN_Msk         (0x10UL)                  /*!< CFGFORMATTEN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGDITHEREN_Pos          (3UL)                     /*!< CFGDITHEREN (Bit 3)                                   */
#define DC_CONFG_CFGDITHEREN_Msk          (0x8UL)                   /*!< CFGDITHEREN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_RSVD0201_Pos             (2UL)                     /*!< RSVD0201 (Bit 2)                                      */
#define DC_CONFG_RSVD0201_Msk             (0x4UL)                   /*!< RSVD0201 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGFCURSOREN_Pos         (1UL)                     /*!< CFGFCURSOREN (Bit 1)                                  */
#define DC_CONFG_CFGFCURSOREN_Msk         (0x2UL)                   /*!< CFGFCURSOREN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGGLBGAMMAEN_Pos        (0UL)                     /*!< CFGGLBGAMMAEN (Bit 0)                                 */
#define DC_CONFG_CFGGLBGAMMAEN_Msk        (0x1UL)                   /*!< CFGGLBGAMMAEN (Bitfield-Mask: 0x01)                   */
/* =======================================================  INTERRUPT  ======================================================= */
#define DC_INTERRUPT_INTTRIGGER_Pos       (31UL)                    /*!< INTTRIGGER (Bit 31)                                   */
#define DC_INTERRUPT_INTTRIGGER_Msk       (0x80000000UL)            /*!< INTTRIGGER (Bitfield-Mask: 0x01)                      */
#define DC_INTERRUPT_IRQ_Pos              (30UL)                    /*!< IRQ (Bit 30)                                          */
#define DC_INTERRUPT_IRQ_Msk              (0x40000000UL)            /*!< IRQ (Bitfield-Mask: 0x01)                             */
#define DC_INTERRUPT_INTSPICMD_Pos        (6UL)                     /*!< INTSPICMD (Bit 6)                                     */
#define DC_INTERRUPT_INTSPICMD_Msk        (0x40UL)                  /*!< INTSPICMD (Bitfield-Mask: 0x01)                       */
#define DC_INTERRUPT_INTSPIFRMEND_Pos     (5UL)                     /*!< INTSPIFRMEND (Bit 5)                                  */
#define DC_INTERRUPT_INTSPIFRMEND_Msk     (0x20UL)                  /*!< INTSPIFRMEND (Bitfield-Mask: 0x01)                    */
#define DC_INTERRUPT_INTFRMEND_Pos        (4UL)                     /*!< INTFRMEND (Bit 4)                                     */
#define DC_INTERRUPT_INTFRMEND_Msk        (0x10UL)                  /*!< INTFRMEND (Bitfield-Mask: 0x01)                       */
#define DC_INTERRUPT_INTTEEN_Pos          (3UL)                     /*!< INTTEEN (Bit 3)                                       */
#define DC_INTERRUPT_INTTEEN_Msk          (0x8UL)                   /*!< INTTEEN (Bitfield-Mask: 0x01)                         */
#define DC_INTERRUPT_INTMMUERR_Pos        (2UL)                     /*!< INTMMUERR (Bit 2)                                     */
#define DC_INTERRUPT_INTMMUERR_Msk        (0x4UL)                   /*!< INTMMUERR (Bitfield-Mask: 0x01)                       */
#define DC_INTERRUPT_INTHSYNCEN_Pos       (1UL)                     /*!< INTHSYNCEN (Bit 1)                                    */
#define DC_INTERRUPT_INTHSYNCEN_Msk       (0x2UL)                   /*!< INTHSYNCEN (Bitfield-Mask: 0x01)                      */
#define DC_INTERRUPT_INTVSYNCEN_Pos       (0UL)                     /*!< INTVSYNCEN (Bit 0)                                    */
#define DC_INTERRUPT_INTVSYNCEN_Msk       (0x1UL)                   /*!< INTVSYNCEN (Bitfield-Mask: 0x01)                      */
/* ========================================================  STATUS  ========================================================= */
#define DC_STATUS_RSVD19_Pos              (19UL)                    /*!< RSVD19 (Bit 19)                                       */
#define DC_STATUS_RSVD19_Msk              (0xfff80000UL)            /*!< RSVD19 (Bitfield-Mask: 0x1fff)                        */
#define DC_STATUS_GPISTACK_Pos            (18UL)                    /*!< GPISTACK (Bit 18)                                     */
#define DC_STATUS_GPISTACK_Msk            (0x40000UL)               /*!< GPISTACK (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_CRCREADY_Pos            (17UL)                    /*!< CRCREADY (Bit 17)                                     */
#define DC_STATUS_CRCREADY_Msk            (0x20000UL)               /*!< CRCREADY (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_SPIRDWR_Pos             (16UL)                    /*!< SPIRDWR (Bit 16)                                      */
#define DC_STATUS_SPIRDWR_Msk             (0x10000UL)               /*!< SPIRDWR (Bitfield-Mask: 0x01)                         */
#define DC_STATUS_CMDFIFOACK_Pos          (15UL)                    /*!< CMDFIFOACK (Bit 15)                                   */
#define DC_STATUS_CMDFIFOACK_Msk          (0x8000UL)                /*!< CMDFIFOACK (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_DBISPICS_Pos            (14UL)                    /*!< DBISPICS (Bit 14)                                     */
#define DC_STATUS_DBISPICS_Msk            (0x4000UL)                /*!< DBISPICS (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_FRAMEEND_Pos            (13UL)                    /*!< FRAMEEND (Bit 13)                                     */
#define DC_STATUS_FRAMEEND_Msk            (0x2000UL)                /*!< FRAMEEND (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATDBIPENDTRANS_Pos    (12UL)                    /*!< STATDBIPENDTRANS (Bit 12)                             */
#define DC_STATUS_STATDBIPENDTRANS_Msk    (0x1000UL)                /*!< STATDBIPENDTRANS (Bitfield-Mask: 0x01)                */
#define DC_STATUS_STATDBIPENDCOM_Pos      (11UL)                    /*!< STATDBIPENDCOM (Bit 11)                               */
#define DC_STATUS_STATDBIPENDCOM_Msk      (0x800UL)                 /*!< STATDBIPENDCOM (Bitfield-Mask: 0x01)                  */
#define DC_STATUS_STATDBIRGB_Pos          (10UL)                    /*!< STATDBIRGB (Bit 10)                                   */
#define DC_STATUS_STATDBIRGB_Msk          (0x400UL)                 /*!< STATDBIRGB (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_RSVD09_Pos              (9UL)                     /*!< RSVD09 (Bit 9)                                        */
#define DC_STATUS_RSVD09_Msk              (0x200UL)                 /*!< RSVD09 (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATTEAR_Pos            (8UL)                     /*!< STATTEAR (Bit 8)                                      */
#define DC_STATUS_STATTEAR_Msk            (0x100UL)                 /*!< STATTEAR (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATSTICKY_Pos          (7UL)                     /*!< STATSTICKY (Bit 7)                                    */
#define DC_STATUS_STATSTICKY_Msk          (0x80UL)                  /*!< STATSTICKY (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_STATUF_Pos              (6UL)                     /*!< STATUF (Bit 6)                                        */
#define DC_STATUS_STATUF_Msk              (0x40UL)                  /*!< STATUF (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATLAST_Pos            (5UL)                     /*!< STATLAST (Bit 5)                                      */
#define DC_STATUS_STATLAST_Msk            (0x20UL)                  /*!< STATLAST (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATCSYNC_Pos           (4UL)                     /*!< STATCSYNC (Bit 4)                                     */
#define DC_STATUS_STATCSYNC_Msk           (0x10UL)                  /*!< STATCSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATVSYNC_Pos           (3UL)                     /*!< STATVSYNC (Bit 3)                                     */
#define DC_STATUS_STATVSYNC_Msk           (0x8UL)                   /*!< STATVSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATHSYNC_Pos           (2UL)                     /*!< STATHSYNC (Bit 2)                                     */
#define DC_STATUS_STATHSYNC_Msk           (0x4UL)                   /*!< STATHSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATDE_Pos              (1UL)                     /*!< STATDE (Bit 1)                                        */
#define DC_STATUS_STATDE_Msk              (0x2UL)                   /*!< STATDE (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATNOTBLANK_Pos        (0UL)                     /*!< STATNOTBLANK (Bit 0)                                  */
#define DC_STATUS_STATNOTBLANK_Msk        (0x1UL)                   /*!< STATNOTBLANK (Bitfield-Mask: 0x01)                    */
/* ========================================================  COLMOD  ========================================================= */
#define DC_COLMOD_RSVD30_Pos              (30UL)                    /*!< RSVD30 (Bit 30)                                       */
#define DC_COLMOD_RSVD30_Msk              (0xc0000000UL)            /*!< RSVD30 (Bitfield-Mask: 0x03)                          */
#define DC_COLMOD_JDI_Pos                 (29UL)                    /*!< JDI (Bit 29)                                          */
#define DC_COLMOD_JDI_Msk                 (0x20000000UL)            /*!< JDI (Bitfield-Mask: 0x01)                             */
#define DC_COLMOD_RSVD28_Pos              (28UL)                    /*!< RSVD28 (Bit 28)                                       */
#define DC_COLMOD_RSVD28_Msk              (0x10000000UL)            /*!< RSVD28 (Bitfield-Mask: 0x01)                          */
#define DC_COLMOD_FLIPY_Pos               (27UL)                    /*!< FLIPY (Bit 27)                                        */
#define DC_COLMOD_FLIPY_Msk               (0x8000000UL)             /*!< FLIPY (Bitfield-Mask: 0x01)                           */
#define DC_COLMOD_LAYER3FLIPX_Pos         (26UL)                    /*!< LAYER3FLIPX (Bit 26)                                  */
#define DC_COLMOD_LAYER3FLIPX_Msk         (0x4000000UL)             /*!< LAYER3FLIPX (Bitfield-Mask: 0x01)                     */
