zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
#define DC_COLMOD_LAYER2FLIPX_Pos         (25UL)                    /*!< LAYER2FLIPX (Bit 25)                                  */
#define DC_COLMOD_LAYER2FLIPX_Msk         (0x2000000UL)             /*!< LAYER2FLIPX (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_LAYER1FLIPX_Pos         (24UL)                    /*!< LAYER1FLIPX (Bit 24)                                  */
#define DC_COLMOD_LAYER1FLIPX_Msk         (0x1000000UL)             /*!< LAYER1FLIPX (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_LAYER0FLIPX_Pos         (23UL)                    /*!< LAYER0FLIPX (Bit 23)                                  */
#define DC_COLMOD_LAYER0FLIPX_Msk         (0x800000UL)              /*!< LAYER0FLIPX (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_RSVD20_Pos              (20UL)                    /*!< RSVD20 (Bit 20)                                       */
#define DC_COLMOD_RSVD20_Msk              (0x700000UL)              /*!< RSVD20 (Bitfield-Mask: 0x07)                          */
#define DC_COLMOD_DBIBEXTERNAL_Pos        (19UL)                    /*!< DBIBEXTERNAL (Bit 19)                                 */
#define DC_COLMOD_DBIBEXTERNAL_Msk        (0x80000UL)               /*!< DBIBEXTERNAL (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_TSC6_Pos                (18UL)                    /*!< TSC6 (Bit 18)                                         */
#define DC_COLMOD_TSC6_Msk                (0x40000UL)               /*!< TSC6 (Bitfield-Mask: 0x01)                            */
#define DC_COLMOD_TSC4_Pos                (17UL)                    /*!< TSC4 (Bit 17)                                         */
#define DC_COLMOD_TSC4_Msk                (0x20000UL)               /*!< TSC4 (Bitfield-Mask: 0x01)                            */
#define DC_COLMOD_RSVD0017_Pos            (0UL)                     /*!< RSVD0017 (Bit 0)                                      */
#define DC_COLMOD_RSVD0017_Msk            (0x1ffffUL)               /*!< RSVD0017 (Bitfield-Mask: 0x1ffff)                     */
/* =================================================  LAYER0COLORDECSTARTXY  ================================================= */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTY_Pos (16UL)         /*!< COCLORDECSTARTY (Bit 16)                              */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTY_Msk (0xffff0000UL) /*!< COCLORDECSTARTY (Bitfield-Mask: 0xffff)               */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTX_Pos (0UL)          /*!< COCLORDECSTARTX (Bit 0)                               */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTX_Msk (0xffffUL)     /*!< COCLORDECSTARTX (Bitfield-Mask: 0xffff)               */
/* ===================================================  LAYER0COLORFORMAT  =================================================== */
#define DC_LAYER0COLORFORMAT_RSVD_Pos     (6UL)                     /*!< RSVD (Bit 6)                                          */
#define DC_LAYER0COLORFORMAT_RSVD_Msk     (0xffffffc0UL)            /*!< RSVD (Bitfield-Mask: 0x3ffffff)                       */
#define DC_LAYER0COLORFORMAT_COLORMODE_Pos (0UL)                    /*!< COLORMODE (Bit 0)                                     */
#define DC_LAYER0COLORFORMAT_COLORMODE_Msk (0x3fUL)                 /*!< COLORMODE (Bitfield-Mask: 0x3f)                       */
/* =====================================================  LAYERPARTIAL  ====================================================== */
#define DC_LAYERPARTIAL_LAYERSELECTION_Pos (30UL)                   /*!< LAYERSELECTION (Bit 30)                               */
#define DC_LAYERPARTIAL_LAYERSELECTION_Msk (0xc0000000UL)           /*!< LAYERSELECTION (Bitfield-Mask: 0x03)                  */
#define DC_LAYERPARTIAL_RSVD_Pos          (24UL)                    /*!< RSVD (Bit 24)                                         */
#define DC_LAYERPARTIAL_RSVD_Msk          (0x3f000000UL)            /*!< RSVD (Bitfield-Mask: 0x3f)                            */
#define DC_LAYERPARTIAL_LAYERPARTIALEND_Pos (12UL)                  /*!< LAYERPARTIALEND (Bit 12)                              */
#define DC_LAYERPARTIAL_LAYERPARTIALEND_Msk (0xfff000UL)            /*!< LAYERPARTIALEND (Bitfield-Mask: 0xfff)                */
#define DC_LAYERPARTIAL_LAYERPARTIALSTART_Pos (0UL)                 /*!< LAYERPARTIALSTART (Bit 0)                             */
#define DC_LAYERPARTIAL_LAYERPARTIALSTART_Msk (0xfffUL)             /*!< LAYERPARTIALSTART (Bitfield-Mask: 0xfff)              */
/* ========================================================  MIPCFG1  ======================================================== */
#define DC_MIPCFG1_VCKCGKFFWD_Pos         (24UL)                    /*!< VCKCGKFFWD (Bit 24)                                   */
#define DC_MIPCFG1_VCKCGKFFWD_Msk         (0xff000000UL)            /*!< VCKCGKFFWD (Bitfield-Mask: 0xff)                      */
#define DC_MIPCFG1_RSVD_Pos               (10UL)                    /*!< RSVD (Bit 10)                                         */
#define DC_MIPCFG1_RSVD_Msk               (0xfffc00UL)              /*!< RSVD (Bitfield-Mask: 0x3fff)                          */
#define DC_MIPCFG1_HCKBCKSTART_Pos        (0UL)                     /*!< HCKBCKSTART (Bit 0)                                   */
#define DC_MIPCFG1_HCKBCKSTART_Msk        (0x3ffUL)                 /*!< HCKBCKSTART (Bitfield-Mask: 0x3ff)                    */
/* ========================================================  MIPCFG2  ======================================================== */
#define DC_MIPCFG2_VCKGCKOFFSET_Pos       (24UL)                    /*!< VCKGCKOFFSET (Bit 24)                                 */
#define DC_MIPCFG2_VCKGCKOFFSET_Msk       (0xff000000UL)            /*!< VCKGCKOFFSET (Bitfield-Mask: 0xff)                    */
#define DC_MIPCFG2_RSVD_Pos               (22UL)                    /*!< RSVD (Bit 22)                                         */
#define DC_MIPCFG2_RSVD_Msk               (0xc00000UL)              /*!< RSVD (Bitfield-Mask: 0x03)                            */
#define DC_MIPCFG2_VCKGCKWIDTH_Pos        (12UL)                    /*!< VCKGCKWIDTH (Bit 12)                                  */
#define DC_MIPCFG2_VCKGCKWIDTH_Msk        (0x3ff000UL)              /*!< VCKGCKWIDTH (Bitfield-Mask: 0x3ff)                    */
#define DC_MIPCFG2_LASTVCKGCKPOINT_Pos    (0UL)                     /*!< LASTVCKGCKPOINT (Bit 0)                               */
#define DC_MIPCFG2_LASTVCKGCKPOINT_Msk    (0xfffUL)                 /*!< LASTVCKGCKPOINT (Bitfield-Mask: 0xfff)                */
/* ========================================================  MIPCFG3  ======================================================== */
#define DC_MIPCFG3_ENPARTIALUPDATE_Pos    (31UL)                    /*!< ENPARTIALUPDATE (Bit 31)                              */
#define DC_MIPCFG3_ENPARTIALUPDATE_Msk    (0x80000000UL)            /*!< ENPARTIALUPDATE (Bitfield-Mask: 0x01)                 */
#define DC_MIPCFG3_FIFOANDREGSRESET_Pos   (30UL)                    /*!< FIFOANDREGSRESET (Bit 30)                             */
#define DC_MIPCFG3_FIFOANDREGSRESET_Msk   (0x40000000UL)            /*!< FIFOANDREGSRESET (Bitfield-Mask: 0x01)                */
#define DC_MIPCFG3_RSVD1_Pos              (20UL)                    /*!< RSVD1 (Bit 20)                                        */
#define DC_MIPCFG3_RSVD1_Msk              (0x3ff00000UL)            /*!< RSVD1 (Bitfield-Mask: 0x3ff)                          */
#define DC_MIPCFG3_VCKGCKIDLECYCLES_Pos   (15UL)                    /*!< VCKGCKIDLECYCLES (Bit 15)                             */
#define DC_MIPCFG3_VCKGCKIDLECYCLES_Msk   (0xf8000UL)               /*!< VCKGCKIDLECYCLES (Bitfield-Mask: 0x1f)                */
#define DC_MIPCFG3_VCKGCKLASTCYCLES_Pos   (10UL)                    /*!< VCKGCKLASTCYCLES (Bit 10)                             */
#define DC_MIPCFG3_VCKGCKLASTCYCLES_Msk   (0x7c00UL)                /*!< VCKGCKLASTCYCLES (Bitfield-Mask: 0x1f)                */
#define DC_MIPCFG3_RSVD0_Pos              (0UL)                     /*!< RSVD0 (Bit 0)                                         */
#define DC_MIPCFG3_RSVD0_Msk              (0x3ffUL)                 /*!< RSVD0 (Bitfield-Mask: 0x3ff)                          */
/* ======================================================  MIPPARTIAL  ======================================================= */
#define DC_MIPPARTIAL_RSVD_Pos            (24UL)                    /*!< RSVD (Bit 24)                                         */
#define DC_MIPPARTIAL_RSVD_Msk            (0xff000000UL)            /*!< RSVD (Bitfield-Mask: 0xff)                            */
#define DC_MIPPARTIAL_MIPPARTIALEND_Pos   (12UL)                    /*!< MIPPARTIALEND (Bit 12)                                */
#define DC_MIPPARTIAL_MIPPARTIALEND_Msk   (0xfff000UL)              /*!< MIPPARTIALEND (Bitfield-Mask: 0xfff)                  */
#define DC_MIPPARTIAL_MIPPARTIALSTART_Pos (0UL)                     /*!< MIPPARTIALSTART (Bit 0)                               */
#define DC_MIPPARTIAL_MIPPARTIALSTART_Msk (0xfffUL)                 /*!< MIPPARTIALSTART (Bitfield-Mask: 0xfff)                */
/* =======================================================  IPVERSION  ======================================================= */
#define DC_IPVERSION_TLCDVERSION_Pos      (0UL)                     /*!< TLCDVERSION (Bit 0)                                   */
#define DC_IPVERSION_TLCDVERSION_Msk      (0xffffffffUL)            /*!< TLCDVERSION (Bitfield-Mask: 0xffffffff)               */
/* ==========================================================  CRC  ========================================================== */
#define DC_CRC_CRCREG_Pos                 (0UL)                     /*!< CRCREG (Bit 0)                                        */
#define DC_CRC_CRCREG_Msk                 (0xffffffffUL)            /*!< CRCREG (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  FORMATTRL  ======================================================= */
#define DC_FORMATTRL_MUTEPIDBIBGE_Pos     (31UL)                    /*!< MUTEPIDBIBGE (Bit 31)                                 */
#define DC_FORMATTRL_MUTEPIDBIBGE_Msk     (0x80000000UL)            /*!< MUTEPIDBIBGE (Bitfield-Mask: 0x01)                    */
#define DC_FORMATTRL_MASKPIREADYDBIBGE_Pos (30UL)                   /*!< MASKPIREADYDBIBGE (Bit 30)                            */
#define DC_FORMATTRL_MASKPIREADYDBIBGE_Msk (0x40000000UL)           /*!< MASKPIREADYDBIBGE (Bitfield-Mask: 0x01)               */
#define DC_FORMATTRL_RSVD_Pos             (29UL)                    /*!< RSVD (Bit 29)                                         */
#define DC_FORMATTRL_RSVD_Msk             (0x20000000UL)            /*!< RSVD (Bitfield-Mask: 0x01)                            */
#define DC_FORMATTRL_HSTIDTH_Pos          (26UL)                    /*!< HSTIDTH (Bit 26)                                      */
#define DC_FORMATTRL_HSTIDTH_Msk          (0x1c000000UL)            /*!< HSTIDTH (Bitfield-Mask: 0x07)                         */
#define DC_FORMATTRL_HSTFFSET_Pos         (23UL)                    /*!< HSTFFSET (Bit 23)                                     */
#define DC_FORMATTRL_HSTFFSET_Msk         (0x3800000UL)             /*!< HSTFFSET (Bitfield-Mask: 0x07)                        */
#define DC_FORMATTRL_VSTIDTHHIGHBITS_Pos  (22UL)                    /*!< VSTIDTHHIGHBITS (Bit 22)                              */
#define DC_FORMATTRL_VSTIDTHHIGHBITS_Msk  (0x400000UL)              /*!< VSTIDTHHIGHBITS (Bitfield-Mask: 0x01)                 */
#define DC_FORMATTRL_SPIDCYCLESMIPVSTWD_Pos (16UL)                  /*!< SPIDCYCLESMIPVSTWD (Bit 16)                           */
#define DC_FORMATTRL_SPIDCYCLESMIPVSTWD_Msk (0x3f0000UL)            /*!< SPIDCYCLESMIPVSTWD (Bitfield-Mask: 0x3f)              */
#define DC_FORMATTRL_DBIBTHBMIPVSTWD_Pos  (13UL)                    /*!< DBIBTHBMIPVSTWD (Bit 13)                              */
#define DC_FORMATTRL_DBIBTHBMIPVSTWD_Msk  (0xe000UL)                /*!< DBIBTHBMIPVSTWD (Bitfield-Mask: 0x07)                 */
#define DC_FORMATTRL_DBIBTLBMIPVSTOFST_Pos (8UL)                    /*!< DBIBTLBMIPVSTOFST (Bit 8)                             */
#define DC_FORMATTRL_DBIBTLBMIPVSTOFST_Msk (0x1f00UL)               /*!< DBIBTLBMIPVSTOFST (Bitfield-Mask: 0x1f)               */
#define DC_FORMATTRL_DBIBTHBMIPVSTOFST_Pos (3UL)                    /*!< DBIBTHBMIPVSTOFST (Bit 3)                             */
#define DC_FORMATTRL_DBIBTHBMIPVSTOFST_Msk (0xf8UL)                 /*!< DBIBTHBMIPVSTOFST (Bitfield-Mask: 0x1f)               */
#define DC_FORMATTRL_DBIBTLB_Pos          (0UL)                     /*!< DBIBTLB (Bit 0)                                       */
#define DC_FORMATTRL_DBIBTLB_Msk          (0x7UL)                   /*!< DBIBTLB (Bitfield-Mask: 0x07)                         */
/* ======================================================  FORMATTRL2  ======================================================= */
#define DC_FORMATTRL2_SELDBIBCLK_Pos      (30UL)                    /*!< SELDBIBCLK (Bit 30)                                   */
#define DC_FORMATTRL2_SELDBIBCLK_Msk      (0xc0000000UL)            /*!< SELDBIBCLK (Bitfield-Mask: 0x03)                      */
#define DC_FORMATTRL2_MIPRST_Pos          (20UL)                    /*!< MIPRST (Bit 20)                                       */
#define DC_FORMATTRL2_MIPRST_Msk          (0x3ff00000UL)            /*!< MIPRST (Bitfield-Mask: 0x3ff)                         */
#define DC_FORMATTRL2_MIPIDTHHB_Pos       (16UL)                    /*!< MIPIDTHHB (Bit 16)                                    */
#define DC_FORMATTRL2_MIPIDTHHB_Msk       (0xf0000UL)               /*!< MIPIDTHHB (Bitfield-Mask: 0x0f)                       */
#define DC_FORMATTRL2_BLNKGORMIPWIDTHLB_Pos (10UL)                  /*!< BLNKGORMIPWIDTHLB (Bit 10)                            */
#define DC_FORMATTRL2_BLNKGORMIPWIDTHLB_Msk (0xfc00UL)              /*!< BLNKGORMIPWIDTHLB (Bitfield-Mask: 0x3f)               */
#define DC_FORMATTRL2_BLNKGORMIPEN_Pos    (0UL)                     /*!< BLNKGORMIPEN (Bit 0)                                  */
#define DC_FORMATTRL2_BLNKGORMIPEN_Msk    (0x3ffUL)                 /*!< BLNKGORMIPEN (Bitfield-Mask: 0x3ff)                   */
/* =======================================================  CLKCTRLCG  ======================================================= */
#define DC_CLKCTRLCG_RSVD1_Pos            (26UL)                    /*!< RSVD1 (Bit 26)                                        */
#define DC_CLKCTRLCG_RSVD1_Msk            (0xfc000000UL)            /*!< RSVD1 (Bitfield-Mask: 0x3f)                           */
#define DC_CLKCTRLCG_LAYER0BUSCG_Pos      (25UL)                    /*!< LAYER0BUSCG (Bit 25)                                  */
#define DC_CLKCTRLCG_LAYER0BUSCG_Msk      (0x2000000UL)             /*!< LAYER0BUSCG (Bitfield-Mask: 0x01)                     */
#define DC_CLKCTRLCG_LAYER0PIXCG_Pos      (24UL)                    /*!< LAYER0PIXCG (Bit 24)                                  */
#define DC_CLKCTRLCG_LAYER0PIXCG_Msk      (0x1000000UL)             /*!< LAYER0PIXCG (Bitfield-Mask: 0x01)                     */
#define DC_CLKCTRLCG_CGYPASS_Pos          (23UL)                    /*!< CGYPASS (Bit 23)                                      */
#define DC_CLKCTRLCG_CGYPASS_Msk          (0x800000UL)              /*!< CGYPASS (Bitfield-Mask: 0x01)                         */
#define DC_CLKCTRLCG_RSVD0_Pos            (22UL)                    /*!< RSVD0 (Bit 22)                                        */
#define DC_CLKCTRLCG_RSVD0_Msk            (0x400000UL)              /*!< RSVD0 (Bitfield-Mask: 0x01)                           */
#define DC_CLKCTRLCG_IFBUSCG_Pos          (21UL)                    /*!< IFBUSCG (Bit 21)                                      */
#define DC_CLKCTRLCG_IFBUSCG_Msk          (0x200000UL)              /*!< IFBUSCG (Bitfield-Mask: 0x01)                         */
#define DC_CLKCTRLCG_IFPIXCG_Pos          (20UL)                    /*!< IFPIXCG (Bit 20)                                      */
#define DC_CLKCTRLCG_IFPIXCG_Msk          (0x100000UL)              /*!< IFPIXCG (Bitfield-Mask: 0x01)                         */
#define DC_CLKCTRLCG_IFFMTCG_Pos          (19UL)                    /*!< IFFMTCG (Bit 19)                                      */
#define DC_CLKCTRLCG_IFFMTCG_Msk          (0x80000UL)               /*!< IFFMTCG (Bitfield-Mask: 0x01)                         */
#define DC_CLKCTRLCG_PALETTEBUSCG_Pos     (18UL)                    /*!< PALETTEBUSCG (Bit 18)                                 */
#define DC_CLKCTRLCG_PALETTEBUSCG_Msk     (0x40000UL)               /*!< PALETTEBUSCG (Bitfield-Mask: 0x01)                    */
#define DC_CLKCTRLCG_PALETTEPIXCG_Pos     (17UL)                    /*!< PALETTEPIXCG (Bit 17)                                 */
#define DC_CLKCTRLCG_PALETTEPIXCG_Msk     (0x20000UL)               /*!< PALETTEPIXCG (Bitfield-Mask: 0x01)                    */
#define DC_CLKCTRLCG_RSVD_Pos             (3UL)                     /*!< RSVD (Bit 3)                                          */
#define DC_CLKCTRLCG_RSVD_Msk             (0x1fff8UL)               /*!< RSVD (Bitfield-Mask: 0x3fff)                          */
#define DC_CLKCTRLCG_PIXORMATCLKSWAP_Pos  (2UL)                     /*!< PIXORMATCLKSWAP (Bit 2)                               */
#define DC_CLKCTRLCG_PIXORMATCLKSWAP_Msk  (0x4UL)                   /*!< PIXORMATCLKSWAP (Bitfield-Mask: 0x01)                 */
#define DC_CLKCTRLCG_CLKOL_Pos            (1UL)                     /*!< CLKOL (Bit 1)                                         */
#define DC_CLKCTRLCG_CLKOL_Msk            (0x2UL)                   /*!< CLKOL (Bitfield-Mask: 0x01)                           */
#define DC_CLKCTRLCG_CLKIV_Pos            (0UL)                     /*!< CLKIV (Bit 0)                                         */
#define DC_CLKCTRLCG_CLKIV_Msk            (0x1UL)                   /*!< CLKIV (Bitfield-Mask: 0x01)                           */
/* ======================================================  FORMATTRL3  ======================================================= */
#define DC_FORMATTRL3_RSVD_Pos            (26UL)                    /*!< RSVD (Bit 26)                                         */
#define DC_FORMATTRL3_RSVD_Msk            (0xfc000000UL)            /*!< RSVD (Bitfield-Mask: 0x3f)                            */
#define DC_FORMATTRL3_HCKBCKMAX_Pos       (16UL)                    /*!< HCKBCKMAX (Bit 16)                                    */
#define DC_FORMATTRL3_HCKBCKMAX_Msk       (0x3ff0000UL)             /*!< HCKBCKMAX (Bitfield-Mask: 0x3ff)                      */
#define DC_FORMATTRL3_SPIDBIBCSDELAYDEASSERT_Pos (13UL)             /*!< SPIDBIBCSDELAYDEASSERT (Bit 13)                       */
#define DC_FORMATTRL3_SPIDBIBCSDELAYDEASSERT_Msk (0xe000UL)         /*!< SPIDBIBCSDELAYDEASSERT (Bitfield-Mask: 0x07)          */
#define DC_FORMATTRL3_SPIDBIBCSDELAYASSERT_Pos (10UL)               /*!< SPIDBIBCSDELAYASSERT (Bit 10)                         */
#define DC_FORMATTRL3_SPIDBIBCSDELAYASSERT_Msk (0x1c00UL)           /*!< SPIDBIBCSDELAYASSERT (Bitfield-Mask: 0x07)            */
#define DC_FORMATTRL3_XRST_Pos            (0UL)                     /*!< XRST (Bit 0)                                          */
#define DC_FORMATTRL3_XRST_Msk            (0x3ffUL)                 /*!< XRST (Bitfield-Mask: 0x3ff)                           */
/* =========================================================  L0LUT  ========================================================= */
#define DC_L0LUT_L0LUT0GAMRAMPA_Pos       (24UL)                    /*!< L0LUT0GAMRAMPA (Bit 24)                               */
#define DC_L0LUT_L0LUT0GAMRAMPA_Msk       (0xff000000UL)            /*!< L0LUT0GAMRAMPA (Bitfield-Mask: 0xff)                  */
#define DC_L0LUT_L0LUT0GAMRAMPR_Pos       (16UL)                    /*!< L0LUT0GAMRAMPR (Bit 16)                               */
#define DC_L0LUT_L0LUT0GAMRAMPR_Msk       (0xff0000UL)              /*!< L0LUT0GAMRAMPR (Bitfield-Mask: 0xff)                  */
#define DC_L0LUT_L0LUT0GAMRAMPG_Pos       (8UL)                     /*!< L0LUT0GAMRAMPG (Bit 8)                                */
#define DC_L0LUT_L0LUT0GAMRAMPG_Msk       (0xff00UL)                /*!< L0LUT0GAMRAMPG (Bitfield-Mask: 0xff)                  */
#define DC_L0LUT_L0LUT0GAMRAMPB_Pos       (0UL)                     /*!< L0LUT0GAMRAMPB (Bit 0)                                */
#define DC_L0LUT_L0LUT0GAMRAMPB_Msk       (0xffUL)                  /*!< L0LUT0GAMRAMPB (Bitfield-Mask: 0xff)                  */


/* =========================================================================================================================== */
/* ================                                            DSI                                            ================ */
/* =========================================================================================================================== */

