zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
#define IOSLAVEFD0_INTSET_FRDERR_Msk      (0x8UL)                   /*!< FRDERR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_FUNDFL_Pos      (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOSLAVEFD0_INTSET_FUNDFL_Msk      (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_FOVFL_Pos       (1UL)                     /*!< FOVFL (Bit 1)                                         */
#define IOSLAVEFD0_INTSET_FOVFL_Msk       (0x2UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOSLAVEFD0_INTSET_FSIZE_Pos       (0UL)                     /*!< FSIZE (Bit 0)                                         */
#define IOSLAVEFD0_INTSET_FSIZE_Msk       (0x1UL)                   /*!< FSIZE (Bitfield-Mask: 0x01)                           */
/* ======================================================  REGACCINTEN  ====================================================== */
#define IOSLAVEFD0_REGACCINTEN_REGACC_Pos (0UL)                     /*!< REGACC (Bit 0)                                        */
#define IOSLAVEFD0_REGACCINTEN_REGACC_Msk (0xffffffffUL)            /*!< REGACC (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  REGACCINTSTAT  ===================================================== */
#define IOSLAVEFD0_REGACCINTSTAT_REGACC_Pos (0UL)                   /*!< REGACC (Bit 0)                                        */
#define IOSLAVEFD0_REGACCINTSTAT_REGACC_Msk (0xffffffffUL)          /*!< REGACC (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  REGACCINTCLR  ====================================================== */
#define IOSLAVEFD0_REGACCINTCLR_REGACC_Pos (0UL)                    /*!< REGACC (Bit 0)                                        */
#define IOSLAVEFD0_REGACCINTCLR_REGACC_Msk (0xffffffffUL)           /*!< REGACC (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  REGACCINTSET  ====================================================== */
#define IOSLAVEFD0_REGACCINTSET_REGACC_Pos (0UL)                    /*!< REGACC (Bit 0)                                        */
#define IOSLAVEFD0_REGACCINTSET_REGACC_Msk (0xffffffffUL)           /*!< REGACC (Bitfield-Mask: 0xffffffff)                    */


/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CHIPPN  ========================================================= */
#define MCUCTRL_CHIPPN_PN_Pos             (24UL)                    /*!< PN (Bit 24)                                           */
#define MCUCTRL_CHIPPN_PN_Msk             (0xff000000UL)            /*!< PN (Bitfield-Mask: 0xff)                              */
#define MCUCTRL_CHIPPN_DEVTYPE_Pos        (23UL)                    /*!< DEVTYPE (Bit 23)                                      */
#define MCUCTRL_CHIPPN_DEVTYPE_Msk        (0x800000UL)              /*!< DEVTYPE (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_CHIPPN_MRAMSIZE_Pos       (20UL)                    /*!< MRAMSIZE (Bit 20)                                     */
#define MCUCTRL_CHIPPN_MRAMSIZE_Msk       (0x700000UL)              /*!< MRAMSIZE (Bitfield-Mask: 0x07)                        */
#define MCUCTRL_CHIPPN_SRAMSIZE_Pos       (16UL)                    /*!< SRAMSIZE (Bit 16)                                     */
#define MCUCTRL_CHIPPN_SRAMSIZE_Msk       (0xf0000UL)               /*!< SRAMSIZE (Bitfield-Mask: 0x0f)                        */
#define MCUCTRL_CHIPPN_REVMAJ_Pos         (12UL)                    /*!< REVMAJ (Bit 12)                                       */
#define MCUCTRL_CHIPPN_REVMAJ_Msk         (0xf000UL)                /*!< REVMAJ (Bitfield-Mask: 0x0f)                          */
#define MCUCTRL_CHIPPN_REVMIN_Pos         (8UL)                     /*!< REVMIN (Bit 8)                                        */
#define MCUCTRL_CHIPPN_REVMIN_Msk         (0xf00UL)                 /*!< REVMIN (Bitfield-Mask: 0x0f)                          */
#define MCUCTRL_CHIPPN_PKG_Pos            (6UL)                     /*!< PKG (Bit 6)                                           */
#define MCUCTRL_CHIPPN_PKG_Msk            (0xc0UL)                  /*!< PKG (Bitfield-Mask: 0x03)                             */
#define MCUCTRL_CHIPPN_PINS_Pos           (3UL)                     /*!< PINS (Bit 3)                                          */
#define MCUCTRL_CHIPPN_PINS_Msk           (0x38UL)                  /*!< PINS (Bitfield-Mask: 0x07)                            */
#define MCUCTRL_CHIPPN_TEMP_Pos           (1UL)                     /*!< TEMP (Bit 1)                                          */
#define MCUCTRL_CHIPPN_TEMP_Msk           (0x6UL)                   /*!< TEMP (Bitfield-Mask: 0x03)                            */
#define MCUCTRL_CHIPPN_RSVD_Pos           (0UL)                     /*!< RSVD (Bit 0)                                          */
#define MCUCTRL_CHIPPN_RSVD_Msk           (0x1UL)                   /*!< RSVD (Bitfield-Mask: 0x01)                            */
/* ========================================================  CHIPID0  ======================================================== */
#define MCUCTRL_CHIPID0_CHIPID0_Pos       (0UL)                     /*!< CHIPID0 (Bit 0)                                       */
#define MCUCTRL_CHIPID0_CHIPID0_Msk       (0xffffffffUL)            /*!< CHIPID0 (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  CHIPID1  ======================================================== */
#define MCUCTRL_CHIPID1_CHIPID1_Pos       (0UL)                     /*!< CHIPID1 (Bit 0)                                       */
#define MCUCTRL_CHIPID1_CHIPID1_Msk       (0xffffffffUL)            /*!< CHIPID1 (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  CHIPREV  ======================================================== */
#define MCUCTRL_CHIPREV_SIPART_Pos        (8UL)                     /*!< SIPART (Bit 8)                                        */
#define MCUCTRL_CHIPREV_SIPART_Msk        (0xfff00UL)               /*!< SIPART (Bitfield-Mask: 0xfff)                         */
#define MCUCTRL_CHIPREV_REVMAJ_Pos        (4UL)                     /*!< REVMAJ (Bit 4)                                        */
#define MCUCTRL_CHIPREV_REVMAJ_Msk        (0xf0UL)                  /*!< REVMAJ (Bitfield-Mask: 0x0f)                          */
#define MCUCTRL_CHIPREV_REVMIN_Pos        (0UL)                     /*!< REVMIN (Bit 0)                                        */
#define MCUCTRL_CHIPREV_REVMIN_Msk        (0xfUL)                   /*!< REVMIN (Bitfield-Mask: 0x0f)                          */
/* =======================================================  VENDORID  ======================================================== */
#define MCUCTRL_VENDORID_VENDORID_Pos     (0UL)                     /*!< VENDORID (Bit 0)                                      */
#define MCUCTRL_VENDORID_VENDORID_Msk     (0xffffffffUL)            /*!< VENDORID (Bitfield-Mask: 0xffffffff)                  */
/* ==========================================================  SKU  ========================================================== */
#define MCUCTRL_SKU_SKUCM4DEBUG_Pos       (22UL)                    /*!< SKUCM4DEBUG (Bit 22)                                  */
#define MCUCTRL_SKU_SKUCM4DEBUG_Msk       (0x400000UL)              /*!< SKUCM4DEBUG (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SKU_SKUMVE_Pos            (20UL)                    /*!< SKUMVE (Bit 20)                                       */
#define MCUCTRL_SKU_SKUMVE_Msk            (0x300000UL)              /*!< SKUMVE (Bitfield-Mask: 0x03)                          */
#define MCUCTRL_SKU_SKUFPU_Pos            (19UL)                    /*!< SKUFPU (Bit 19)                                       */
#define MCUCTRL_SKU_SKUFPU_Msk            (0x80000UL)               /*!< SKUFPU (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKU_SKUDTCM_Pos           (15UL)                    /*!< SKUDTCM (Bit 15)                                      */
#define MCUCTRL_SKU_SKUDTCM_Msk           (0x78000UL)               /*!< SKUDTCM (Bitfield-Mask: 0x0f)                         */
#define MCUCTRL_SKU_SKURADIOMM_Pos        (13UL)                    /*!< SKURADIOMM (Bit 13)                                   */
#define MCUCTRL_SKU_SKURADIOMM_Msk        (0x2000UL)                /*!< SKURADIOMM (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SKU_SKURADIOBTBLE_Pos     (12UL)                    /*!< SKURADIOBTBLE (Bit 12)                                */
#define MCUCTRL_SKU_SKURADIOBTBLE_Msk     (0x1000UL)                /*!< SKURADIOBTBLE (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SKU_SKURADIODISABLE_Pos   (11UL)                    /*!< SKURADIODISABLE (Bit 11)                              */
#define MCUCTRL_SKU_SKURADIODISABLE_Msk   (0x800UL)                 /*!< SKURADIODISABLE (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SKU_SKUSECURESPOT_Pos     (10UL)                    /*!< SKUSECURESPOT (Bit 10)                                */
#define MCUCTRL_SKU_SKUSECURESPOT_Msk     (0x400UL)                 /*!< SKUSECURESPOT (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SKU_SKUUSB_Pos            (9UL)                     /*!< SKUUSB (Bit 9)                                        */
#define MCUCTRL_SKU_SKUUSB_Msk            (0x200UL)                 /*!< SKUUSB (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKU_SKUGFX_Pos            (8UL)                     /*!< SKUGFX (Bit 8)                                        */
#define MCUCTRL_SKU_SKUGFX_Msk            (0x100UL)                 /*!< SKUGFX (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKU_SKUMIPIDSI_Pos        (7UL)                     /*!< SKUMIPIDSI (Bit 7)                                    */
#define MCUCTRL_SKU_SKUMIPIDSI_Msk        (0x80UL)                  /*!< SKUMIPIDSI (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SKU_SKUTURBOSPOT_Pos      (5UL)                     /*!< SKUTURBOSPOT (Bit 5)                                  */
#define MCUCTRL_SKU_SKUTURBOSPOT_Msk      (0x60UL)                  /*!< SKUTURBOSPOT (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_SKU_SKUDISP_Pos           (4UL)                     /*!< SKUDISP (Bit 4)                                       */
#define MCUCTRL_SKU_SKUDISP_Msk           (0x10UL)                  /*!< SKUDISP (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_SKU_SKUMRAMSIZE_Pos       (2UL)                     /*!< SKUMRAMSIZE (Bit 2)                                   */
#define MCUCTRL_SKU_SKUMRAMSIZE_Msk       (0xcUL)                   /*!< SKUMRAMSIZE (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SKU_SKUSRAMSIZE_Pos       (0UL)                     /*!< SKUSRAMSIZE (Bit 0)                                   */
#define MCUCTRL_SKU_SKUSRAMSIZE_Msk       (0x1UL)                   /*!< SKUSRAMSIZE (Bitfield-Mask: 0x01)                     */
/* =======================================================  DEBUGGER  ======================================================== */
#define MCUCTRL_DEBUGGER_LOCKOUT_Pos      (0UL)                     /*!< LOCKOUT (Bit 0)                                       */
#define MCUCTRL_DEBUGGER_LOCKOUT_Msk      (0xffffffffUL)            /*!< LOCKOUT (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ACRG  ========================================================== */
#define MCUCTRL_ACRG_ACRGTRIM_Pos         (3UL)                     /*!< ACRGTRIM (Bit 3)                                      */
#define MCUCTRL_ACRG_ACRGTRIM_Msk         (0xf8UL)                  /*!< ACRGTRIM (Bitfield-Mask: 0x1f)                        */
#define MCUCTRL_ACRG_ACRGIBIASSEL_Pos     (2UL)                     /*!< ACRGIBIASSEL (Bit 2)                                  */
#define MCUCTRL_ACRG_ACRGIBIASSEL_Msk     (0x4UL)                   /*!< ACRGIBIASSEL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_ACRG_ACRGPWD_Pos          (1UL)                     /*!< ACRGPWD (Bit 1)                                       */
#define MCUCTRL_ACRG_ACRGPWD_Msk          (0x2UL)                   /*!< ACRGPWD (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_ACRG_ACRGSWE_Pos          (0UL)                     /*!< ACRGSWE (Bit 0)                                       */
#define MCUCTRL_ACRG_ACRGSWE_Msk          (0x1UL)                   /*!< ACRGSWE (Bitfield-Mask: 0x01)                         */
/* =======================================================  VREFGEN2  ======================================================== */
#define MCUCTRL_VREFGEN2_TVRGCBODTRIM_Pos (17UL)                    /*!< TVRGCBODTRIM (Bit 17)                                 */
#define MCUCTRL_VREFGEN2_TVRGCBODTRIM_Msk (0x60000UL)               /*!< TVRGCBODTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_VREFGEN2_TVRGCREFBOOST_Pos (16UL)                   /*!< TVRGCREFBOOST (Bit 16)                                */
#define MCUCTRL_VREFGEN2_TVRGCREFBOOST_Msk (0x10000UL)              /*!< TVRGCREFBOOST (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_VREFGEN2_TVRGCCURRENTTRIM_Pos (15UL)                /*!< TVRGCCURRENTTRIM (Bit 15)                             */
#define MCUCTRL_VREFGEN2_TVRGCCURRENTTRIM_Msk (0x8000UL)            /*!< TVRGCCURRENTTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFGEN2_TVRGCHSENRESDIV_Pos (14UL)                 /*!< TVRGCHSENRESDIV (Bit 14)                              */
#define MCUCTRL_VREFGEN2_TVRGCHSENRESDIV_Msk (0x4000UL)             /*!< TVRGCHSENRESDIV (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN2_TVRGCPDNB_Pos    (13UL)                    /*!< TVRGCPDNB (Bit 13)                                    */
#define MCUCTRL_VREFGEN2_TVRGCPDNB_Msk    (0x2000UL)                /*!< TVRGCPDNB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_VREFGEN2_TVRGCSELVREF_Pos (12UL)                    /*!< TVRGCSELVREF (Bit 12)                                 */
#define MCUCTRL_VREFGEN2_TVRGCSELVREF_Msk (0x1000UL)                /*!< TVRGCSELVREF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VREFGEN2_TVRGCTEMPCOTRIM_Pos (7UL)                  /*!< TVRGCTEMPCOTRIM (Bit 7)                               */
#define MCUCTRL_VREFGEN2_TVRGCTEMPCOTRIM_Msk (0xf80UL)              /*!< TVRGCTEMPCOTRIM (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_VREFGEN2_TVRGCVREFTRIM_Pos (0UL)                    /*!< TVRGCVREFTRIM (Bit 0)                                 */
#define MCUCTRL_VREFGEN2_TVRGCVREFTRIM_Msk (0x7fUL)                 /*!< TVRGCVREFTRIM (Bitfield-Mask: 0x7f)                   */
/* =======================================================  VREFGEN3  ======================================================== */
#define MCUCTRL_VREFGEN3_TVRGCLVBODTRIM_Pos (17UL)                  /*!< TVRGCLVBODTRIM (Bit 17)                               */
#define MCUCTRL_VREFGEN3_TVRGCLVBODTRIM_Msk (0x60000UL)             /*!< TVRGCLVBODTRIM (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_VREFGEN3_TVRGCLVREFBOOST_Pos (16UL)                 /*!< TVRGCLVREFBOOST (Bit 16)                              */
#define MCUCTRL_VREFGEN3_TVRGCLVREFBOOST_Msk (0x10000UL)            /*!< TVRGCLVREFBOOST (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN3_TVRGCLVCURRENTTRIM_Pos (15UL)              /*!< TVRGCLVCURRENTTRIM (Bit 15)                           */
#define MCUCTRL_VREFGEN3_TVRGCLVCURRENTTRIM_Msk (0x8000UL)          /*!< TVRGCLVCURRENTTRIM (Bitfield-Mask: 0x01)              */
#define MCUCTRL_VREFGEN3_TVRGCLVHSENRESDIV_Pos (14UL)               /*!< TVRGCLVHSENRESDIV (Bit 14)                            */
#define MCUCTRL_VREFGEN3_TVRGCLVHSENRESDIV_Msk (0x4000UL)           /*!< TVRGCLVHSENRESDIV (Bitfield-Mask: 0x01)               */
#define MCUCTRL_VREFGEN3_TVRGCLVPDNB_Pos  (13UL)                    /*!< TVRGCLVPDNB (Bit 13)                                  */
#define MCUCTRL_VREFGEN3_TVRGCLVPDNB_Msk  (0x2000UL)                /*!< TVRGCLVPDNB (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_VREFGEN3_TVRGCLVSELVREF_Pos (12UL)                  /*!< TVRGCLVSELVREF (Bit 12)                               */
#define MCUCTRL_VREFGEN3_TVRGCLVSELVREF_Msk (0x1000UL)              /*!< TVRGCLVSELVREF (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_VREFGEN3_TVRGCLVTEMPCOTRIM_Pos (7UL)                /*!< TVRGCLVTEMPCOTRIM (Bit 7)                             */
#define MCUCTRL_VREFGEN3_TVRGCLVTEMPCOTRIM_Msk (0xf80UL)            /*!< TVRGCLVTEMPCOTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_VREFGEN3_TVRGCLVVREFTRIM_Pos (0UL)                  /*!< TVRGCLVVREFTRIM (Bit 0)                               */
#define MCUCTRL_VREFGEN3_TVRGCLVVREFTRIM_Msk (0x7fUL)               /*!< TVRGCLVVREFTRIM (Bitfield-Mask: 0x7f)                 */
/* =======================================================  VREFGEN4  ======================================================== */
#define MCUCTRL_VREFGEN4_TVRGFSELVREF_Pos (24UL)                    /*!< TVRGFSELVREF (Bit 24)                                 */
#define MCUCTRL_VREFGEN4_TVRGFSELVREF_Msk (0x3000000UL)             /*!< TVRGFSELVREF (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_VREFGEN4_TVRGFBODTRIM_Pos (22UL)                    /*!< TVRGFBODTRIM (Bit 22)                                 */
#define MCUCTRL_VREFGEN4_TVRGFBODTRIM_Msk (0xc00000UL)              /*!< TVRGFBODTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_VREFGEN4_TVRGFPWLGAINADJ_Pos (21UL)                 /*!< TVRGFPWLGAINADJ (Bit 21)                              */
#define MCUCTRL_VREFGEN4_TVRGFPWLGAINADJ_Msk (0x200000UL)           /*!< TVRGFPWLGAINADJ (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN4_TVRGFCURRENTTRIM_Pos (20UL)                /*!< TVRGFCURRENTTRIM (Bit 20)                             */
#define MCUCTRL_VREFGEN4_TVRGFCURRENTTRIM_Msk (0x100000UL)          /*!< TVRGFCURRENTTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFGEN4_TVRGFHSENRESDIV_Pos (19UL)                 /*!< TVRGFHSENRESDIV (Bit 19)                              */
#define MCUCTRL_VREFGEN4_TVRGFHSENRESDIV_Msk (0x80000UL)            /*!< TVRGFHSENRESDIV (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN4_TVRGFPDNB_Pos    (18UL)                    /*!< TVRGFPDNB (Bit 18)                                    */
#define MCUCTRL_VREFGEN4_TVRGFPDNB_Msk    (0x40000UL)               /*!< TVRGFPDNB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_VREFGEN4_TVRGFPWLTEMPCOTRIM_Pos (13UL)              /*!< TVRGFPWLTEMPCOTRIM (Bit 13)                           */
#define MCUCTRL_VREFGEN4_TVRGFPWLTEMPCOTRIM_Msk (0x3e000UL)         /*!< TVRGFPWLTEMPCOTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_VREFGEN4_TVRGFTEMPCOTRIM_Pos (7UL)                  /*!< TVRGFTEMPCOTRIM (Bit 7)                               */
#define MCUCTRL_VREFGEN4_TVRGFTEMPCOTRIM_Msk (0xf80UL)              /*!< TVRGFTEMPCOTRIM (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_VREFGEN4_TVRGFVREFTRIM_Pos (0UL)                    /*!< TVRGFVREFTRIM (Bit 0)                                 */
#define MCUCTRL_VREFGEN4_TVRGFVREFTRIM_Msk (0x7fUL)                 /*!< TVRGFVREFTRIM (Bitfield-Mask: 0x7f)                   */
/* =======================================================  VREFGEN5  ======================================================== */
#define MCUCTRL_VREFGEN5_TVRGSBODTRIM_Pos (22UL)                    /*!< TVRGSBODTRIM (Bit 22)                                 */
#define MCUCTRL_VREFGEN5_TVRGSBODTRIM_Msk (0xc00000UL)              /*!< TVRGSBODTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_VREFGEN5_TVRGSPWLGAINADJ_Pos (21UL)                 /*!< TVRGSPWLGAINADJ (Bit 21)                              */
#define MCUCTRL_VREFGEN5_TVRGSPWLGAINADJ_Msk (0x200000UL)           /*!< TVRGSPWLGAINADJ (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN5_TVRGSCURRENTTRIM_Pos (20UL)                /*!< TVRGSCURRENTTRIM (Bit 20)                             */
#define MCUCTRL_VREFGEN5_TVRGSCURRENTTRIM_Msk (0x100000UL)          /*!< TVRGSCURRENTTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFGEN5_TVRGSHSENRESDIV_Pos (19UL)                 /*!< TVRGSHSENRESDIV (Bit 19)                              */
#define MCUCTRL_VREFGEN5_TVRGSHSENRESDIV_Msk (0x80000UL)            /*!< TVRGSHSENRESDIV (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN5_TVRGSPDNB_Pos    (18UL)                    /*!< TVRGSPDNB (Bit 18)                                    */
#define MCUCTRL_VREFGEN5_TVRGSPDNB_Msk    (0x40000UL)               /*!< TVRGSPDNB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_VREFGEN5_TVRGSPWLTEMPCOTRIM_Pos (13UL)              /*!< TVRGSPWLTEMPCOTRIM (Bit 13)                           */
#define MCUCTRL_VREFGEN5_TVRGSPWLTEMPCOTRIM_Msk (0x3e000UL)         /*!< TVRGSPWLTEMPCOTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_VREFGEN5_TVRGSSELVREF_Pos (12UL)                    /*!< TVRGSSELVREF (Bit 12)                                 */
#define MCUCTRL_VREFGEN5_TVRGSSELVREF_Msk (0x1000UL)                /*!< TVRGSSELVREF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VREFGEN5_TVRGSTEMPCOTRIM_Pos (7UL)                  /*!< TVRGSTEMPCOTRIM (Bit 7)                               */
#define MCUCTRL_VREFGEN5_TVRGSTEMPCOTRIM_Msk (0xf80UL)              /*!< TVRGSTEMPCOTRIM (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_VREFGEN5_TVRGSVREFTRIM_Pos (0UL)                    /*!< TVRGSVREFTRIM (Bit 0)                                 */
#define MCUCTRL_VREFGEN5_TVRGSVREFTRIM_Msk (0x7fUL)                 /*!< TVRGSVREFTRIM (Bitfield-Mask: 0x7f)                   */
/* ========================================================  VREFBUF  ======================================================== */
#define MCUCTRL_VREFBUF_VREFBUFCCOMPTRIM_Pos (14UL)                 /*!< VREFBUFCCOMPTRIM (Bit 14)                             */
#define MCUCTRL_VREFBUF_VREFBUFCCOMPTRIM_Msk (0x1c000UL)            /*!< VREFBUFCCOMPTRIM (Bitfield-Mask: 0x07)                */
#define MCUCTRL_VREFBUF_VREFBUFIBIASTRIM_Pos (13UL)                 /*!< VREFBUFIBIASTRIM (Bit 13)                             */
#define MCUCTRL_VREFBUF_VREFBUFIBIASTRIM_Msk (0x2000UL)             /*!< VREFBUFIBIASTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFBUF_VREFBUFMISCTRIM_Pos (7UL)                   /*!< VREFBUFMISCTRIM (Bit 7)                               */
#define MCUCTRL_VREFBUF_VREFBUFMISCTRIM_Msk (0x1f80UL)              /*!< VREFBUFMISCTRIM (Bitfield-Mask: 0x3f)                 */
#define MCUCTRL_VREFBUF_VREFBUFPDNB_Pos   (6UL)                     /*!< VREFBUFPDNB (Bit 6)                                   */
#define MCUCTRL_VREFBUF_VREFBUFPDNB_Msk   (0x40UL)                  /*!< VREFBUFPDNB (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_VREFBUF_VREFBUFVOLTTRIM_Pos (0UL)                   /*!< VREFBUFVOLTTRIM (Bit 0)                               */
