zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
#define MCUCTRL_SIMOBUCK1_RXCLKFORCEUSEHFRC_Pos (7UL)               /*!< RXCLKFORCEUSEHFRC (Bit 7)                             */
#define MCUCTRL_SIMOBUCK1_RXCLKFORCEUSEHFRC_Msk (0x80UL)            /*!< RXCLKFORCEUSEHFRC (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SIMOBUCK1_RXCLKALLOWUSEHFRC_Pos (6UL)               /*!< RXCLKALLOWUSEHFRC (Bit 6)                             */
#define MCUCTRL_SIMOBUCK1_RXCLKALLOWUSEHFRC_Msk (0x40UL)            /*!< RXCLKALLOWUSEHFRC (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SIMOBUCK1_RXCLKHFRCDIVSEL_Pos (3UL)                 /*!< RXCLKHFRCDIVSEL (Bit 3)                               */
#define MCUCTRL_SIMOBUCK1_RXCLKHFRCDIVSEL_Msk (0x38UL)              /*!< RXCLKHFRCDIVSEL (Bitfield-Mask: 0x07)                 */
#define MCUCTRL_SIMOBUCK1_RXCLKLOCALDIVSEL_Pos (0UL)                /*!< RXCLKLOCALDIVSEL (Bit 0)                              */
#define MCUCTRL_SIMOBUCK1_RXCLKLOCALDIVSEL_Msk (0x7UL)              /*!< RXCLKLOCALDIVSEL (Bitfield-Mask: 0x07)                */
/* =======================================================  SIMOBUCK2  ======================================================= */
#define MCUCTRL_SIMOBUCK2_VDDSTONDEEPSLEEPTRIMLV_Pos (25UL)         /*!< VDDSTONDEEPSLEEPTRIMLV (Bit 25)                       */
#define MCUCTRL_SIMOBUCK2_VDDSTONDEEPSLEEPTRIMLV_Msk (0x3e000000UL) /*!< VDDSTONDEEPSLEEPTRIMLV (Bitfield-Mask: 0x1f)          */
#define MCUCTRL_SIMOBUCK2_VDDSTONACTHPTRIMLV_Pos (20UL)             /*!< VDDSTONACTHPTRIMLV (Bit 20)                           */
#define MCUCTRL_SIMOBUCK2_VDDSTONACTHPTRIMLV_Msk (0x1f00000UL)      /*!< VDDSTONACTHPTRIMLV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK2_VDDSTONACTLPTRIMLV_Pos (15UL)             /*!< VDDSTONACTLPTRIMLV (Bit 15)                           */
#define MCUCTRL_SIMOBUCK2_VDDSTONACTLPTRIMLV_Msk (0xf8000UL)        /*!< VDDSTONACTLPTRIMLV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK2_VDDFTONDEEPSLEEPTRIMLV_Pos (10UL)         /*!< VDDFTONDEEPSLEEPTRIMLV (Bit 10)                       */
#define MCUCTRL_SIMOBUCK2_VDDFTONDEEPSLEEPTRIMLV_Msk (0x7c00UL)     /*!< VDDFTONDEEPSLEEPTRIMLV (Bitfield-Mask: 0x1f)          */
#define MCUCTRL_SIMOBUCK2_VDDFTONACTHPTRIMLV_Pos (5UL)              /*!< VDDFTONACTHPTRIMLV (Bit 5)                            */
#define MCUCTRL_SIMOBUCK2_VDDFTONACTHPTRIMLV_Msk (0x3e0UL)          /*!< VDDFTONACTHPTRIMLV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK2_VDDFTONACTLPTRIMLV_Pos (0UL)              /*!< VDDFTONACTLPTRIMLV (Bit 0)                            */
#define MCUCTRL_SIMOBUCK2_VDDFTONACTLPTRIMLV_Msk (0x1fUL)           /*!< VDDFTONACTLPTRIMLV (Bitfield-Mask: 0x1f)              */
/* =======================================================  SIMOBUCK3  ======================================================= */
#define MCUCTRL_SIMOBUCK3_VDDCLVTONDEEPSLEEPTRIMLV_Pos (25UL)       /*!< VDDCLVTONDEEPSLEEPTRIMLV (Bit 25)                     */
#define MCUCTRL_SIMOBUCK3_VDDCLVTONDEEPSLEEPTRIMLV_Msk (0x3e000000UL) /*!< VDDCLVTONDEEPSLEEPTRIMLV (Bitfield-Mask: 0x1f)      */
#define MCUCTRL_SIMOBUCK3_VDDCLVTONACTHPTRIMLV_Pos (20UL)           /*!< VDDCLVTONACTHPTRIMLV (Bit 20)                         */
#define MCUCTRL_SIMOBUCK3_VDDCLVTONACTHPTRIMLV_Msk (0x1f00000UL)    /*!< VDDCLVTONACTHPTRIMLV (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK3_VDDCLVTONACTLPTRIMLV_Pos (15UL)           /*!< VDDCLVTONACTLPTRIMLV (Bit 15)                         */
#define MCUCTRL_SIMOBUCK3_VDDCLVTONACTLPTRIMLV_Msk (0xf8000UL)      /*!< VDDCLVTONACTLPTRIMLV (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK3_VDDCTONDEEPSLEEPTRIMLV_Pos (10UL)         /*!< VDDCTONDEEPSLEEPTRIMLV (Bit 10)                       */
#define MCUCTRL_SIMOBUCK3_VDDCTONDEEPSLEEPTRIMLV_Msk (0x7c00UL)     /*!< VDDCTONDEEPSLEEPTRIMLV (Bitfield-Mask: 0x1f)          */
#define MCUCTRL_SIMOBUCK3_VDDCTONACTHPTRIMLV_Pos (5UL)              /*!< VDDCTONACTHPTRIMLV (Bit 5)                            */
#define MCUCTRL_SIMOBUCK3_VDDCTONACTHPTRIMLV_Msk (0x3e0UL)          /*!< VDDCTONACTHPTRIMLV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK3_VDDCTONACTLPTRIMLV_Pos (0UL)              /*!< VDDCTONACTLPTRIMLV (Bit 0)                            */
#define MCUCTRL_SIMOBUCK3_VDDCTONACTLPTRIMLV_Msk (0x1fUL)           /*!< VDDCTONACTLPTRIMLV (Bitfield-Mask: 0x1f)              */
/* =======================================================  SIMOBUCK4  ======================================================= */
#define MCUCTRL_SIMOBUCK4_VDDRFCOMPTRIMMINUS_Pos (24UL)             /*!< VDDRFCOMPTRIMMINUS (Bit 24)                           */
#define MCUCTRL_SIMOBUCK4_VDDRFCOMPTRIMMINUS_Msk (0x1f000000UL)     /*!< VDDRFCOMPTRIMMINUS (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK4_VDDRFDEEPSLEEPOFFSETEN_Pos (23UL)         /*!< VDDRFDEEPSLEEPOFFSETEN (Bit 23)                       */
#define MCUCTRL_SIMOBUCK4_VDDRFDEEPSLEEPOFFSETEN_Msk (0x800000UL)   /*!< VDDRFDEEPSLEEPOFFSETEN (Bitfield-Mask: 0x01)          */
#define MCUCTRL_SIMOBUCK4_VDDRFRXCOMPTRIMEN_Pos (22UL)              /*!< VDDRFRXCOMPTRIMEN (Bit 22)                            */
#define MCUCTRL_SIMOBUCK4_VDDRFRXCOMPTRIMEN_Msk (0x400000UL)        /*!< VDDRFRXCOMPTRIMEN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SIMOBUCK4_VDDRFDIVSEL_Pos (17UL)                    /*!< VDDRFDIVSEL (Bit 17)                                  */
#define MCUCTRL_SIMOBUCK4_VDDRFDIVSEL_Msk (0x3e0000UL)              /*!< VDDRFDIVSEL (Bitfield-Mask: 0x1f)                     */
#define MCUCTRL_SIMOBUCK4_VDDRFRESDIVEN_Pos (16UL)                  /*!< VDDRFRESDIVEN (Bit 16)                                */
#define MCUCTRL_SIMOBUCK4_VDDRFRESDIVEN_Msk (0x10000UL)             /*!< VDDRFRESDIVEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK4_VDDRFSWCAPDIVEN_Pos (15UL)                /*!< VDDRFSWCAPDIVEN (Bit 15)                              */
#define MCUCTRL_SIMOBUCK4_VDDRFSWCAPDIVEN_Msk (0x8000UL)            /*!< VDDRFSWCAPDIVEN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK4_VDDRFTONDEEPSLEEPTRIMLV_Pos (10UL)        /*!< VDDRFTONDEEPSLEEPTRIMLV (Bit 10)                      */
#define MCUCTRL_SIMOBUCK4_VDDRFTONDEEPSLEEPTRIMLV_Msk (0x7c00UL)    /*!< VDDRFTONDEEPSLEEPTRIMLV (Bitfield-Mask: 0x1f)         */
#define MCUCTRL_SIMOBUCK4_VDDRFTONACTHPTRIMLV_Pos (5UL)             /*!< VDDRFTONACTHPTRIMLV (Bit 5)                           */
#define MCUCTRL_SIMOBUCK4_VDDRFTONACTHPTRIMLV_Msk (0x3e0UL)         /*!< VDDRFTONACTHPTRIMLV (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK4_VDDRFTONACTLPTRIMLV_Pos (0UL)             /*!< VDDRFTONACTLPTRIMLV (Bit 0)                           */
#define MCUCTRL_SIMOBUCK4_VDDRFTONACTLPTRIMLV_Msk (0x1fUL)          /*!< VDDRFTONACTLPTRIMLV (Bitfield-Mask: 0x1f)             */
/* =======================================================  SIMOBUCK6  ======================================================= */
#define MCUCTRL_SIMOBUCK6_VDDSDEEPSLEEPOFFSETEN_Pos (28UL)          /*!< VDDSDEEPSLEEPOFFSETEN (Bit 28)                        */
#define MCUCTRL_SIMOBUCK6_VDDSDEEPSLEEPOFFSETEN_Msk (0x10000000UL)  /*!< VDDSDEEPSLEEPOFFSETEN (Bitfield-Mask: 0x01)           */
#define MCUCTRL_SIMOBUCK6_VDDSRXCOMPTRIMMINUS_Pos (23UL)            /*!< VDDSRXCOMPTRIMMINUS (Bit 23)                          */
#define MCUCTRL_SIMOBUCK6_VDDSRXCOMPTRIMMINUS_Msk (0xf800000UL)     /*!< VDDSRXCOMPTRIMMINUS (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK6_VDDSRXCOMPTRIMPLUS_Pos (18UL)             /*!< VDDSRXCOMPTRIMPLUS (Bit 18)                           */
#define MCUCTRL_SIMOBUCK6_VDDSRXCOMPTRIMPLUS_Msk (0x7c0000UL)       /*!< VDDSRXCOMPTRIMPLUS (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK6_VDDSRXCOMPTRIMEN_Pos (17UL)               /*!< VDDSRXCOMPTRIMEN (Bit 17)                             */
#define MCUCTRL_SIMOBUCK6_VDDSRXCOMPTRIMEN_Msk (0x20000UL)          /*!< VDDSRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK6_VDDRFCOMPTRIMPLUS_Pos (12UL)              /*!< VDDRFCOMPTRIMPLUS (Bit 12)                            */
#define MCUCTRL_SIMOBUCK6_VDDRFCOMPTRIMPLUS_Msk (0x1f000UL)         /*!< VDDRFCOMPTRIMPLUS (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK6_VDDFDEEPSLEEPOFFSETEN_Pos (11UL)          /*!< VDDFDEEPSLEEPOFFSETEN (Bit 11)                        */
#define MCUCTRL_SIMOBUCK6_VDDFDEEPSLEEPOFFSETEN_Msk (0x800UL)       /*!< VDDFDEEPSLEEPOFFSETEN (Bitfield-Mask: 0x01)           */
#define MCUCTRL_SIMOBUCK6_VDDFRXCOMPTRIMMINUS_Pos (6UL)             /*!< VDDFRXCOMPTRIMMINUS (Bit 6)                           */
#define MCUCTRL_SIMOBUCK6_VDDFRXCOMPTRIMMINUS_Msk (0x7c0UL)         /*!< VDDFRXCOMPTRIMMINUS (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK6_VDDFRXCOMPTRIMPLUS_Pos (1UL)              /*!< VDDFRXCOMPTRIMPLUS (Bit 1)                            */
#define MCUCTRL_SIMOBUCK6_VDDFRXCOMPTRIMPLUS_Msk (0x3eUL)           /*!< VDDFRXCOMPTRIMPLUS (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK6_VDDFRXCOMPTRIMEN_Pos (0UL)                /*!< VDDFRXCOMPTRIMEN (Bit 0)                              */
#define MCUCTRL_SIMOBUCK6_VDDFRXCOMPTRIMEN_Msk (0x1UL)              /*!< VDDFRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
/* =======================================================  SIMOBUCK7  ======================================================= */
#define MCUCTRL_SIMOBUCK7_SIMOBUCKTVRGCREFSEL_Pos (24UL)            /*!< SIMOBUCKTVRGCREFSEL (Bit 24)                          */
#define MCUCTRL_SIMOBUCK7_SIMOBUCKTVRGCREFSEL_Msk (0x1000000UL)     /*!< SIMOBUCKTVRGCREFSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SIMOBUCK7_VDDCLVDEEPSLEEPOFFSETEN_Pos (23UL)        /*!< VDDCLVDEEPSLEEPOFFSETEN (Bit 23)                      */
#define MCUCTRL_SIMOBUCK7_VDDCLVDEEPSLEEPOFFSETEN_Msk (0x800000UL)  /*!< VDDCLVDEEPSLEEPOFFSETEN (Bitfield-Mask: 0x01)         */
#define MCUCTRL_SIMOBUCK7_VDDCLVRXCOMPTRIMMINUS_Pos (18UL)          /*!< VDDCLVRXCOMPTRIMMINUS (Bit 18)                        */
#define MCUCTRL_SIMOBUCK7_VDDCLVRXCOMPTRIMMINUS_Msk (0x7c0000UL)    /*!< VDDCLVRXCOMPTRIMMINUS (Bitfield-Mask: 0x1f)           */
#define MCUCTRL_SIMOBUCK7_VDDCLVRXCOMPTRIMPLUS_Pos (13UL)           /*!< VDDCLVRXCOMPTRIMPLUS (Bit 13)                         */
#define MCUCTRL_SIMOBUCK7_VDDCLVRXCOMPTRIMPLUS_Msk (0x3e000UL)      /*!< VDDCLVRXCOMPTRIMPLUS (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK7_VDDCLVRXCOMPTRIMEN_Pos (12UL)             /*!< VDDCLVRXCOMPTRIMEN (Bit 12)                           */
#define MCUCTRL_SIMOBUCK7_VDDCLVRXCOMPTRIMEN_Msk (0x1000UL)         /*!< VDDCLVRXCOMPTRIMEN (Bitfield-Mask: 0x01)              */
#define MCUCTRL_SIMOBUCK7_VDDCDEEPSLEEPOFFSETEN_Pos (11UL)          /*!< VDDCDEEPSLEEPOFFSETEN (Bit 11)                        */
#define MCUCTRL_SIMOBUCK7_VDDCDEEPSLEEPOFFSETEN_Msk (0x800UL)       /*!< VDDCDEEPSLEEPOFFSETEN (Bitfield-Mask: 0x01)           */
#define MCUCTRL_SIMOBUCK7_VDDCRXCOMPTRIMMINUS_Pos (6UL)             /*!< VDDCRXCOMPTRIMMINUS (Bit 6)                           */
#define MCUCTRL_SIMOBUCK7_VDDCRXCOMPTRIMMINUS_Msk (0x7c0UL)         /*!< VDDCRXCOMPTRIMMINUS (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK7_VDDCRXCOMPTRIMPLUS_Pos (1UL)              /*!< VDDCRXCOMPTRIMPLUS (Bit 1)                            */
#define MCUCTRL_SIMOBUCK7_VDDCRXCOMPTRIMPLUS_Msk (0x3eUL)           /*!< VDDCRXCOMPTRIMPLUS (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK7_VDDCRXCOMPTRIMEN_Pos (0UL)                /*!< VDDCRXCOMPTRIMEN (Bit 0)                              */
#define MCUCTRL_SIMOBUCK7_VDDCRXCOMPTRIMEN_Msk (0x1UL)              /*!< VDDCRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
/* =======================================================  SIMOBUCK8  ======================================================= */
#define MCUCTRL_SIMOBUCK8_VDDSTONDEEPSLEEPTRIMHV_Pos (25UL)         /*!< VDDSTONDEEPSLEEPTRIMHV (Bit 25)                       */
#define MCUCTRL_SIMOBUCK8_VDDSTONDEEPSLEEPTRIMHV_Msk (0x3e000000UL) /*!< VDDSTONDEEPSLEEPTRIMHV (Bitfield-Mask: 0x1f)          */
#define MCUCTRL_SIMOBUCK8_VDDSTONACTHPTRIMHV_Pos (20UL)             /*!< VDDSTONACTHPTRIMHV (Bit 20)                           */
#define MCUCTRL_SIMOBUCK8_VDDSTONACTHPTRIMHV_Msk (0x1f00000UL)      /*!< VDDSTONACTHPTRIMHV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK8_VDDSTONACTLPTRIMHV_Pos (15UL)             /*!< VDDSTONACTLPTRIMHV (Bit 15)                           */
#define MCUCTRL_SIMOBUCK8_VDDSTONACTLPTRIMHV_Msk (0xf8000UL)        /*!< VDDSTONACTLPTRIMHV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK8_VDDFTONDEEPSLEEPTRIMHV_Pos (10UL)         /*!< VDDFTONDEEPSLEEPTRIMHV (Bit 10)                       */
#define MCUCTRL_SIMOBUCK8_VDDFTONDEEPSLEEPTRIMHV_Msk (0x7c00UL)     /*!< VDDFTONDEEPSLEEPTRIMHV (Bitfield-Mask: 0x1f)          */
#define MCUCTRL_SIMOBUCK8_VDDFTONACTHPTRIMHV_Pos (5UL)              /*!< VDDFTONACTHPTRIMHV (Bit 5)                            */
#define MCUCTRL_SIMOBUCK8_VDDFTONACTHPTRIMHV_Msk (0x3e0UL)          /*!< VDDFTONACTHPTRIMHV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK8_VDDFTONACTLPTRIMHV_Pos (0UL)              /*!< VDDFTONACTLPTRIMHV (Bit 0)                            */
#define MCUCTRL_SIMOBUCK8_VDDFTONACTLPTRIMHV_Msk (0x1fUL)           /*!< VDDFTONACTLPTRIMHV (Bitfield-Mask: 0x1f)              */
/* =======================================================  SIMOBUCK9  ======================================================= */
#define MCUCTRL_SIMOBUCK9_VDDCLVTONDEEPSLEEPTRIMHV_Pos (25UL)       /*!< VDDCLVTONDEEPSLEEPTRIMHV (Bit 25)                     */
#define MCUCTRL_SIMOBUCK9_VDDCLVTONDEEPSLEEPTRIMHV_Msk (0x3e000000UL) /*!< VDDCLVTONDEEPSLEEPTRIMHV (Bitfield-Mask: 0x1f)      */
#define MCUCTRL_SIMOBUCK9_VDDCLVTONACTHPTRIMHV_Pos (20UL)           /*!< VDDCLVTONACTHPTRIMHV (Bit 20)                         */
#define MCUCTRL_SIMOBUCK9_VDDCLVTONACTHPTRIMHV_Msk (0x1f00000UL)    /*!< VDDCLVTONACTHPTRIMHV (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK9_VDDCLVTONACTLPTRIMHV_Pos (15UL)           /*!< VDDCLVTONACTLPTRIMHV (Bit 15)                         */
#define MCUCTRL_SIMOBUCK9_VDDCLVTONACTLPTRIMHV_Msk (0xf8000UL)      /*!< VDDCLVTONACTLPTRIMHV (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK9_VDDCTONDEEPSLEEPTRIMHV_Pos (10UL)         /*!< VDDCTONDEEPSLEEPTRIMHV (Bit 10)                       */
#define MCUCTRL_SIMOBUCK9_VDDCTONDEEPSLEEPTRIMHV_Msk (0x7c00UL)     /*!< VDDCTONDEEPSLEEPTRIMHV (Bitfield-Mask: 0x1f)          */
#define MCUCTRL_SIMOBUCK9_VDDCTONACTHPTRIMHV_Pos (5UL)              /*!< VDDCTONACTHPTRIMHV (Bit 5)                            */
#define MCUCTRL_SIMOBUCK9_VDDCTONACTHPTRIMHV_Msk (0x3e0UL)          /*!< VDDCTONACTHPTRIMHV (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK9_VDDCTONACTLPTRIMHV_Pos (0UL)              /*!< VDDCTONACTLPTRIMHV (Bit 0)                            */
#define MCUCTRL_SIMOBUCK9_VDDCTONACTLPTRIMHV_Msk (0x1fUL)           /*!< VDDCTONACTLPTRIMHV (Bitfield-Mask: 0x1f)              */
/* ======================================================  SIMOBUCK10  ======================================================= */
#define MCUCTRL_SIMOBUCK10_TONVOLTAGESWSEL_Pos (16UL)               /*!< TONVOLTAGESWSEL (Bit 16)                              */
#define MCUCTRL_SIMOBUCK10_TONVOLTAGESWSEL_Msk (0x10000UL)          /*!< TONVOLTAGESWSEL (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK10_TONVOLTAGEMUXSELCTRL_Pos (15UL)          /*!< TONVOLTAGEMUXSELCTRL (Bit 15)                         */
#define MCUCTRL_SIMOBUCK10_TONVOLTAGEMUXSELCTRL_Msk (0x8000UL)      /*!< TONVOLTAGEMUXSELCTRL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_SIMOBUCK10_VDDRFTONDEEPSLEEPTRIMHV_Pos (10UL)       /*!< VDDRFTONDEEPSLEEPTRIMHV (Bit 10)                      */
#define MCUCTRL_SIMOBUCK10_VDDRFTONDEEPSLEEPTRIMHV_Msk (0x7c00UL)   /*!< VDDRFTONDEEPSLEEPTRIMHV (Bitfield-Mask: 0x1f)         */
#define MCUCTRL_SIMOBUCK10_VDDRFTONACTHPTRIMHV_Pos (5UL)            /*!< VDDRFTONACTHPTRIMHV (Bit 5)                           */
#define MCUCTRL_SIMOBUCK10_VDDRFTONACTHPTRIMHV_Msk (0x3e0UL)        /*!< VDDRFTONACTHPTRIMHV (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK10_VDDRFTONACTLPTRIMHV_Pos (0UL)            /*!< VDDRFTONACTLPTRIMHV (Bit 0)                           */
#define MCUCTRL_SIMOBUCK10_VDDRFTONACTLPTRIMHV_Msk (0x1fUL)         /*!< VDDRFTONACTLPTRIMHV (Bitfield-Mask: 0x1f)             */
/* ======================================================  SIMOBUCK11  ======================================================= */
#define MCUCTRL_SIMOBUCK11_SIMOBUCKD2ASPARE_Pos (0UL)               /*!< SIMOBUCKD2ASPARE (Bit 0)                              */
#define MCUCTRL_SIMOBUCK11_SIMOBUCKD2ASPARE_Msk (0xffffffffUL)      /*!< SIMOBUCKD2ASPARE (Bitfield-Mask: 0xffffffff)          */
/* =======================================================  D2ASPARE2  ======================================================= */
#define MCUCTRL_D2ASPARE2_D2ASPARE2_Pos   (0UL)                     /*!< D2ASPARE2 (Bit 0)                                     */
#define MCUCTRL_D2ASPARE2_D2ASPARE2_Msk   (0xffffffffUL)            /*!< D2ASPARE2 (Bitfield-Mask: 0xffffffff)                 */
/* ======================================================  USBLDOCTRL  ======================================================= */
#define MCUCTRL_USBLDOCTRL_USBLDOTRIMSEL_Pos (5UL)                  /*!< USBLDOTRIMSEL (Bit 5)                                 */
#define MCUCTRL_USBLDOCTRL_USBLDOTRIMSEL_Msk (0x7e0UL)              /*!< USBLDOTRIMSEL (Bitfield-Mask: 0x3f)                   */
#define MCUCTRL_USBLDOCTRL_USBLDOVREFSEL_Pos (4UL)                  /*!< USBLDOVREFSEL (Bit 4)                                 */
#define MCUCTRL_USBLDOCTRL_USBLDOVREFSEL_Msk (0x10UL)               /*!< USBLDOVREFSEL (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_USBLDOCTRL_USBLDOTESTEN_Pos (3UL)                   /*!< USBLDOTESTEN (Bit 3)                                  */
#define MCUCTRL_USBLDOCTRL_USBLDOTESTEN_Msk (0x8UL)                 /*!< USBLDOTESTEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_USBLDOCTRL_USBLDOPULLDNDIS_Pos (2UL)                /*!< USBLDOPULLDNDIS (Bit 2)                               */
#define MCUCTRL_USBLDOCTRL_USBLDOPULLDNDIS_Msk (0x4UL)              /*!< USBLDOPULLDNDIS (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_USBLDOCTRL_USBLDOPDNB_Pos (1UL)                     /*!< USBLDOPDNB (Bit 1)                                    */
#define MCUCTRL_USBLDOCTRL_USBLDOPDNB_Msk (0x2UL)                   /*!< USBLDOPDNB (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_USBLDOCTRL_USBLDOIBIASSEL_Pos (0UL)                 /*!< USBLDOIBIASSEL (Bit 0)                                */
#define MCUCTRL_USBLDOCTRL_USBLDOIBIASSEL_Msk (0x1UL)               /*!< USBLDOIBIASSEL (Bitfield-Mask: 0x01)                  */
/* ======================================================  I3CPHYCTRL  ======================================================= */
#define MCUCTRL_I3CPHYCTRL_I3CPHYPULLDN_Pos (0UL)                   /*!< I3CPHYPULLDN (Bit 0)                                  */
#define MCUCTRL_I3CPHYCTRL_I3CPHYPULLDN_Msk (0x1UL)                 /*!< I3CPHYPULLDN (Bitfield-Mask: 0x01)                    */
/* ========================================================  PWRSW0  ========================================================= */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGNOVERRIDE_Pos (31UL)           /*!< PWRSWVDDRCPUPGNOVERRIDE (Bit 31)                      */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGNOVERRIDE_Msk (0x80000000UL)   /*!< PWRSWVDDRCPUPGNOVERRIDE (Bitfield-Mask: 0x01)         */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Pos (30UL)               /*!< PWRSWVDDRCPUSTATSEL (Bit 30)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Msk (0x40000000UL)       /*!< PWRSWVDDRCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Pos (29UL)                   /*!< PWRSWVDDRCPUPGN (Bit 29)                              */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Msk (0x20000000UL)           /*!< PWRSWVDDRCPUPGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSELOVERRIDE_Pos (28UL)        /*!< PWRSWVDDRCPUDYNSELOVERRIDE (Bit 28)                   */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSELOVERRIDE_Msk (0x10000000UL) /*!< PWRSWVDDRCPUDYNSELOVERRIDE (Bitfield-Mask: 0x01)     */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Pos (27UL)                /*!< PWRSWVDDRCPUDYNSEL (Bit 27)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Msk (0x8000000UL)         /*!< PWRSWVDDRCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Pos (26UL)                /*!< PWRSWVDDMLOVERRIDE (Bit 26)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Msk (0x4000000UL)         /*!< PWRSWVDDMLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Pos (25UL)                 /*!< PWRSWVDDMLSTATSEL (Bit 25)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Msk (0x2000000UL)          /*!< PWRSWVDDMLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Pos (24UL)                  /*!< PWRSWVDDMLDYNSEL (Bit 24)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Msk (0x1000000UL)           /*!< PWRSWVDDMLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSELPOLSEL_Pos (18UL)         /*!< PWRSWVDDMCPUSTATSELPOLSEL (Bit 18)                    */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSELPOLSEL_Msk (0x40000UL)    /*!< PWRSWVDDMCPUSTATSELPOLSEL (Bitfield-Mask: 0x01)       */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Pos (17UL)              /*!< PWRSWVDDMCPUOVERRIDE (Bit 17)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Msk (0x20000UL)         /*!< PWRSWVDDMCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Pos (16UL)               /*!< PWRSWVDDMCPUSTATSEL (Bit 16)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Msk (0x10000UL)          /*!< PWRSWVDDMCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Pos (15UL)                /*!< PWRSWVDDMCPUDYNSEL (Bit 15)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Msk (0x8000UL)            /*!< PWRSWVDDMCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSELBITSWAP_Pos (10UL)          /*!< PWRSWVDDCPUDYNSELBITSWAP (Bit 10)                     */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSELBITSWAP_Msk (0x400UL)       /*!< PWRSWVDDCPUDYNSELBITSWAP (Bitfield-Mask: 0x01)        */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSELBITSWAP_Pos (9UL)          /*!< PWRSWVDDCAORDYNSELBITSWAP (Bit 9)                     */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSELBITSWAP_Msk (0x200UL)      /*!< PWRSWVDDCAORDYNSELBITSWAP (Bitfield-Mask: 0x01)       */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORPGNOVERRIDE_Pos (8UL)            /*!< PWRSWVDDCAORPGNOVERRIDE (Bit 8)                       */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORPGNOVERRIDE_Msk (0x100UL)        /*!< PWRSWVDDCAORPGNOVERRIDE (Bitfield-Mask: 0x01)         */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Pos (7UL)               /*!< PWRSWVDDCAOROVERRIDE (Bit 7)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Msk (0x80UL)            /*!< PWRSWVDDCAOROVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Pos (5UL)                 /*!< PWRSWVDDCAORDYNSEL (Bit 5)                            */
