zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================================  SDMA  ========================================================== */
#define SDIO0_SDMA_SDMASYSTEMADDRESS_Pos  (0UL)                     /*!< SDMASYSTEMADDRESS (Bit 0)                             */
#define SDIO0_SDMA_SDMASYSTEMADDRESS_Msk  (0xffffffffUL)            /*!< SDMASYSTEMADDRESS (Bitfield-Mask: 0xffffffff)         */
/* =========================================================  BLOCK  ========================================================= */
#define SDIO0_BLOCK_BLKCNT_Pos            (16UL)                    /*!< BLKCNT (Bit 16)                                       */
#define SDIO0_BLOCK_BLKCNT_Msk            (0xffff0000UL)            /*!< BLKCNT (Bitfield-Mask: 0xffff)                        */
#define SDIO0_BLOCK_HOSTSDMABUFSZ_Pos     (12UL)                    /*!< HOSTSDMABUFSZ (Bit 12)                                */
#define SDIO0_BLOCK_HOSTSDMABUFSZ_Msk     (0x7000UL)                /*!< HOSTSDMABUFSZ (Bitfield-Mask: 0x07)                   */
#define SDIO0_BLOCK_TRANSFERBLOCKSIZE_Pos (0UL)                     /*!< TRANSFERBLOCKSIZE (Bit 0)                             */
#define SDIO0_BLOCK_TRANSFERBLOCKSIZE_Msk (0xfffUL)                 /*!< TRANSFERBLOCKSIZE (Bitfield-Mask: 0xfff)              */
/* =======================================================  ARGUMENT1  ======================================================= */
#define SDIO0_ARGUMENT1_CMDARG1_Pos       (0UL)                     /*!< CMDARG1 (Bit 0)                                       */
#define SDIO0_ARGUMENT1_CMDARG1_Msk       (0xffffffffUL)            /*!< CMDARG1 (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  TRANSFER  ======================================================== */
#define SDIO0_TRANSFER_CMDIDX_Pos         (24UL)                    /*!< CMDIDX (Bit 24)                                       */
#define SDIO0_TRANSFER_CMDIDX_Msk         (0x3f000000UL)            /*!< CMDIDX (Bitfield-Mask: 0x3f)                          */
#define SDIO0_TRANSFER_CMDTYPE_Pos        (22UL)                    /*!< CMDTYPE (Bit 22)                                      */
#define SDIO0_TRANSFER_CMDTYPE_Msk        (0xc00000UL)              /*!< CMDTYPE (Bitfield-Mask: 0x03)                         */
#define SDIO0_TRANSFER_DATAPRSNTSEL_Pos   (21UL)                    /*!< DATAPRSNTSEL (Bit 21)                                 */
#define SDIO0_TRANSFER_DATAPRSNTSEL_Msk   (0x200000UL)              /*!< DATAPRSNTSEL (Bitfield-Mask: 0x01)                    */
#define SDIO0_TRANSFER_CMDIDXCHKEN_Pos    (20UL)                    /*!< CMDIDXCHKEN (Bit 20)                                  */
#define SDIO0_TRANSFER_CMDIDXCHKEN_Msk    (0x100000UL)              /*!< CMDIDXCHKEN (Bitfield-Mask: 0x01)                     */
#define SDIO0_TRANSFER_CMDCRCCHKEN_Pos    (19UL)                    /*!< CMDCRCCHKEN (Bit 19)                                  */
#define SDIO0_TRANSFER_CMDCRCCHKEN_Msk    (0x80000UL)               /*!< CMDCRCCHKEN (Bitfield-Mask: 0x01)                     */
#define SDIO0_TRANSFER_RESPTYPESEL_Pos    (16UL)                    /*!< RESPTYPESEL (Bit 16)                                  */
#define SDIO0_TRANSFER_RESPTYPESEL_Msk    (0x30000UL)               /*!< RESPTYPESEL (Bitfield-Mask: 0x03)                     */
#define SDIO0_TRANSFER_BLKSEL_Pos         (5UL)                     /*!< BLKSEL (Bit 5)                                        */
#define SDIO0_TRANSFER_BLKSEL_Msk         (0x20UL)                  /*!< BLKSEL (Bitfield-Mask: 0x01)                          */
#define SDIO0_TRANSFER_DXFERDIRSEL_Pos    (4UL)                     /*!< DXFERDIRSEL (Bit 4)                                   */
#define SDIO0_TRANSFER_DXFERDIRSEL_Msk    (0x10UL)                  /*!< DXFERDIRSEL (Bitfield-Mask: 0x01)                     */
#define SDIO0_TRANSFER_ACMDEN_Pos         (2UL)                     /*!< ACMDEN (Bit 2)                                        */
#define SDIO0_TRANSFER_ACMDEN_Msk         (0xcUL)                   /*!< ACMDEN (Bitfield-Mask: 0x03)                          */
#define SDIO0_TRANSFER_BLKCNTEN_Pos       (1UL)                     /*!< BLKCNTEN (Bit 1)                                      */
#define SDIO0_TRANSFER_BLKCNTEN_Msk       (0x2UL)                   /*!< BLKCNTEN (Bitfield-Mask: 0x01)                        */
#define SDIO0_TRANSFER_DMAEN_Pos          (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define SDIO0_TRANSFER_DMAEN_Msk          (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* =======================================================  RESPONSE0  ======================================================= */
#define SDIO0_RESPONSE0_CMDRESP0_Pos      (0UL)                     /*!< CMDRESP0 (Bit 0)                                      */
#define SDIO0_RESPONSE0_CMDRESP0_Msk      (0xffffffffUL)            /*!< CMDRESP0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  RESPONSE1  ======================================================= */
#define SDIO0_RESPONSE1_CMDRESP1_Pos      (0UL)                     /*!< CMDRESP1 (Bit 0)                                      */
#define SDIO0_RESPONSE1_CMDRESP1_Msk      (0xffffffffUL)            /*!< CMDRESP1 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  RESPONSE2  ======================================================= */
#define SDIO0_RESPONSE2_CMDRESP2_Pos      (0UL)                     /*!< CMDRESP2 (Bit 0)                                      */
#define SDIO0_RESPONSE2_CMDRESP2_Msk      (0xffffffffUL)            /*!< CMDRESP2 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  RESPONSE3  ======================================================= */
#define SDIO0_RESPONSE3_CMDRESP3_Pos      (0UL)                     /*!< CMDRESP3 (Bit 0)                                      */
#define SDIO0_RESPONSE3_CMDRESP3_Msk      (0xffffffffUL)            /*!< CMDRESP3 (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  BUFFER  ========================================================= */
#define SDIO0_BUFFER_BUFFERDATA_Pos       (0UL)                     /*!< BUFFERDATA (Bit 0)                                    */
#define SDIO0_BUFFER_BUFFERDATA_Msk       (0xffffffffUL)            /*!< BUFFERDATA (Bitfield-Mask: 0xffffffff)                */
/* ========================================================  PRESENT  ======================================================== */
#define SDIO0_PRESENT_DAT74LINE_Pos       (25UL)                    /*!< DAT74LINE (Bit 25)                                    */
#define SDIO0_PRESENT_DAT74LINE_Msk       (0x1e000000UL)            /*!< DAT74LINE (Bitfield-Mask: 0x0f)                       */
#define SDIO0_PRESENT_CMDLINE_Pos         (24UL)                    /*!< CMDLINE (Bit 24)                                      */
#define SDIO0_PRESENT_CMDLINE_Msk         (0x1000000UL)             /*!< CMDLINE (Bitfield-Mask: 0x01)                         */
#define SDIO0_PRESENT_DAT30LINE_Pos       (20UL)                    /*!< DAT30LINE (Bit 20)                                    */
#define SDIO0_PRESENT_DAT30LINE_Msk       (0xf00000UL)              /*!< DAT30LINE (Bitfield-Mask: 0x0f)                       */
#define SDIO0_PRESENT_WRPROTSW_Pos        (19UL)                    /*!< WRPROTSW (Bit 19)                                     */
#define SDIO0_PRESENT_WRPROTSW_Msk        (0x80000UL)               /*!< WRPROTSW (Bitfield-Mask: 0x01)                        */
#define SDIO0_PRESENT_CARDDET_Pos         (18UL)                    /*!< CARDDET (Bit 18)                                      */
#define SDIO0_PRESENT_CARDDET_Msk         (0x40000UL)               /*!< CARDDET (Bitfield-Mask: 0x01)                         */
#define SDIO0_PRESENT_CARDSTABLE_Pos      (17UL)                    /*!< CARDSTABLE (Bit 17)                                   */
#define SDIO0_PRESENT_CARDSTABLE_Msk      (0x20000UL)               /*!< CARDSTABLE (Bitfield-Mask: 0x01)                      */
#define SDIO0_PRESENT_CARDINSERTED_Pos    (16UL)                    /*!< CARDINSERTED (Bit 16)                                 */
#define SDIO0_PRESENT_CARDINSERTED_Msk    (0x10000UL)               /*!< CARDINSERTED (Bitfield-Mask: 0x01)                    */
#define SDIO0_PRESENT_BUFRDEN_Pos         (11UL)                    /*!< BUFRDEN (Bit 11)                                      */
#define SDIO0_PRESENT_BUFRDEN_Msk         (0x800UL)                 /*!< BUFRDEN (Bitfield-Mask: 0x01)                         */
#define SDIO0_PRESENT_BUFWREN_Pos         (10UL)                    /*!< BUFWREN (Bit 10)                                      */
#define SDIO0_PRESENT_BUFWREN_Msk         (0x400UL)                 /*!< BUFWREN (Bitfield-Mask: 0x01)                         */
#define SDIO0_PRESENT_RDXFERACT_Pos       (9UL)                     /*!< RDXFERACT (Bit 9)                                     */
#define SDIO0_PRESENT_RDXFERACT_Msk       (0x200UL)                 /*!< RDXFERACT (Bitfield-Mask: 0x01)                       */
#define SDIO0_PRESENT_WRXFERACT_Pos       (8UL)                     /*!< WRXFERACT (Bit 8)                                     */
#define SDIO0_PRESENT_WRXFERACT_Msk       (0x100UL)                 /*!< WRXFERACT (Bitfield-Mask: 0x01)                       */
#define SDIO0_PRESENT_RETUNINGREQUEST_Pos (3UL)                     /*!< RETUNINGREQUEST (Bit 3)                               */
#define SDIO0_PRESENT_RETUNINGREQUEST_Msk (0x8UL)                   /*!< RETUNINGREQUEST (Bitfield-Mask: 0x01)                 */
#define SDIO0_PRESENT_DLINEACT_Pos        (2UL)                     /*!< DLINEACT (Bit 2)                                      */
#define SDIO0_PRESENT_DLINEACT_Msk        (0x4UL)                   /*!< DLINEACT (Bitfield-Mask: 0x01)                        */
#define SDIO0_PRESENT_CMDINHDAT_Pos       (1UL)                     /*!< CMDINHDAT (Bit 1)                                     */
#define SDIO0_PRESENT_CMDINHDAT_Msk       (0x2UL)                   /*!< CMDINHDAT (Bitfield-Mask: 0x01)                       */
#define SDIO0_PRESENT_CMDINHCMD_Pos       (0UL)                     /*!< CMDINHCMD (Bit 0)                                     */
#define SDIO0_PRESENT_CMDINHCMD_Msk       (0x1UL)                   /*!< CMDINHCMD (Bitfield-Mask: 0x01)                       */
/* =======================================================  HOSTCTRL1  ======================================================= */
#define SDIO0_HOSTCTRL1_WUENCARDREMOVL_Pos (26UL)                   /*!< WUENCARDREMOVL (Bit 26)                               */
#define SDIO0_HOSTCTRL1_WUENCARDREMOVL_Msk (0x4000000UL)            /*!< WUENCARDREMOVL (Bitfield-Mask: 0x01)                  */
#define SDIO0_HOSTCTRL1_WUENCARDINSERT_Pos (25UL)                   /*!< WUENCARDINSERT (Bit 25)                               */
#define SDIO0_HOSTCTRL1_WUENCARDINSERT_Msk (0x2000000UL)            /*!< WUENCARDINSERT (Bitfield-Mask: 0x01)                  */
#define SDIO0_HOSTCTRL1_WUENCARDINT_Pos   (24UL)                    /*!< WUENCARDINT (Bit 24)                                  */
#define SDIO0_HOSTCTRL1_WUENCARDINT_Msk   (0x1000000UL)             /*!< WUENCARDINT (Bitfield-Mask: 0x01)                     */
#define SDIO0_HOSTCTRL1_BOOTACKCHK_Pos    (23UL)                    /*!< BOOTACKCHK (Bit 23)                                   */
#define SDIO0_HOSTCTRL1_BOOTACKCHK_Msk    (0x800000UL)              /*!< BOOTACKCHK (Bitfield-Mask: 0x01)                      */
#define SDIO0_HOSTCTRL1_ALTBOOTEN_Pos     (22UL)                    /*!< ALTBOOTEN (Bit 22)                                    */
#define SDIO0_HOSTCTRL1_ALTBOOTEN_Msk     (0x400000UL)              /*!< ALTBOOTEN (Bitfield-Mask: 0x01)                       */
#define SDIO0_HOSTCTRL1_BOOTEN_Pos        (21UL)                    /*!< BOOTEN (Bit 21)                                       */
#define SDIO0_HOSTCTRL1_BOOTEN_Msk        (0x200000UL)              /*!< BOOTEN (Bitfield-Mask: 0x01)                          */
#define SDIO0_HOSTCTRL1_SPIMODE_Pos       (20UL)                    /*!< SPIMODE (Bit 20)                                      */
#define SDIO0_HOSTCTRL1_SPIMODE_Msk       (0x100000UL)              /*!< SPIMODE (Bitfield-Mask: 0x01)                         */
#define SDIO0_HOSTCTRL1_GAP_Pos           (19UL)                    /*!< GAP (Bit 19)                                          */
#define SDIO0_HOSTCTRL1_GAP_Msk           (0x80000UL)               /*!< GAP (Bitfield-Mask: 0x01)                             */
#define SDIO0_HOSTCTRL1_READWAITCTRL_Pos  (18UL)                    /*!< READWAITCTRL (Bit 18)                                 */
#define SDIO0_HOSTCTRL1_READWAITCTRL_Msk  (0x40000UL)               /*!< READWAITCTRL (Bitfield-Mask: 0x01)                    */
#define SDIO0_HOSTCTRL1_CONTREQ_Pos       (17UL)                    /*!< CONTREQ (Bit 17)                                      */
#define SDIO0_HOSTCTRL1_CONTREQ_Msk       (0x20000UL)               /*!< CONTREQ (Bitfield-Mask: 0x01)                         */
#define SDIO0_HOSTCTRL1_STOPATBLOCKGAPREQUEST_Pos (16UL)            /*!< STOPATBLOCKGAPREQUEST (Bit 16)                        */
#define SDIO0_HOSTCTRL1_STOPATBLOCKGAPREQUEST_Msk (0x10000UL)       /*!< STOPATBLOCKGAPREQUEST (Bitfield-Mask: 0x01)           */
#define SDIO0_HOSTCTRL1_HWRESET_Pos       (12UL)                    /*!< HWRESET (Bit 12)                                      */
#define SDIO0_HOSTCTRL1_HWRESET_Msk       (0x1000UL)                /*!< HWRESET (Bitfield-Mask: 0x01)                         */
#define SDIO0_HOSTCTRL1_VOLTSELECT_Pos    (9UL)                     /*!< VOLTSELECT (Bit 9)                                    */
#define SDIO0_HOSTCTRL1_VOLTSELECT_Msk    (0xe00UL)                 /*!< VOLTSELECT (Bitfield-Mask: 0x07)                      */
#define SDIO0_HOSTCTRL1_SDBUSPOWER_Pos    (8UL)                     /*!< SDBUSPOWER (Bit 8)                                    */
#define SDIO0_HOSTCTRL1_SDBUSPOWER_Msk    (0x100UL)                 /*!< SDBUSPOWER (Bitfield-Mask: 0x01)                      */
#define SDIO0_HOSTCTRL1_CARDSRC_Pos       (7UL)                     /*!< CARDSRC (Bit 7)                                       */
#define SDIO0_HOSTCTRL1_CARDSRC_Msk       (0x80UL)                  /*!< CARDSRC (Bitfield-Mask: 0x01)                         */
#define SDIO0_HOSTCTRL1_TESTLEVEL_Pos     (6UL)                     /*!< TESTLEVEL (Bit 6)                                     */
#define SDIO0_HOSTCTRL1_TESTLEVEL_Msk     (0x40UL)                  /*!< TESTLEVEL (Bitfield-Mask: 0x01)                       */
#define SDIO0_HOSTCTRL1_XFERWIDTH_Pos     (5UL)                     /*!< XFERWIDTH (Bit 5)                                     */
#define SDIO0_HOSTCTRL1_XFERWIDTH_Msk     (0x20UL)                  /*!< XFERWIDTH (Bitfield-Mask: 0x01)                       */
#define SDIO0_HOSTCTRL1_DMASELECT_Pos     (3UL)                     /*!< DMASELECT (Bit 3)                                     */
#define SDIO0_HOSTCTRL1_DMASELECT_Msk     (0x18UL)                  /*!< DMASELECT (Bitfield-Mask: 0x03)                       */
#define SDIO0_HOSTCTRL1_HISPEEDEN_Pos     (2UL)                     /*!< HISPEEDEN (Bit 2)                                     */
#define SDIO0_HOSTCTRL1_HISPEEDEN_Msk     (0x4UL)                   /*!< HISPEEDEN (Bitfield-Mask: 0x01)                       */
#define SDIO0_HOSTCTRL1_DATATRANSFERWIDTH_Pos (1UL)                 /*!< DATATRANSFERWIDTH (Bit 1)                             */
#define SDIO0_HOSTCTRL1_DATATRANSFERWIDTH_Msk (0x2UL)               /*!< DATATRANSFERWIDTH (Bitfield-Mask: 0x01)               */
#define SDIO0_HOSTCTRL1_LEDCONTROL_Pos    (0UL)                     /*!< LEDCONTROL (Bit 0)                                    */
#define SDIO0_HOSTCTRL1_LEDCONTROL_Msk    (0x1UL)                   /*!< LEDCONTROL (Bitfield-Mask: 0x01)                      */
/* =======================================================  CLOCKCTRL  ======================================================= */
#define SDIO0_CLOCKCTRL_SWRSTDAT_Pos      (26UL)                    /*!< SWRSTDAT (Bit 26)                                     */
#define SDIO0_CLOCKCTRL_SWRSTDAT_Msk      (0x4000000UL)             /*!< SWRSTDAT (Bitfield-Mask: 0x01)                        */
#define SDIO0_CLOCKCTRL_SWRSTCMD_Pos      (25UL)                    /*!< SWRSTCMD (Bit 25)                                     */
#define SDIO0_CLOCKCTRL_SWRSTCMD_Msk      (0x2000000UL)             /*!< SWRSTCMD (Bitfield-Mask: 0x01)                        */
#define SDIO0_CLOCKCTRL_SWRSTALL_Pos      (24UL)                    /*!< SWRSTALL (Bit 24)                                     */
#define SDIO0_CLOCKCTRL_SWRSTALL_Msk      (0x1000000UL)             /*!< SWRSTALL (Bitfield-Mask: 0x01)                        */
#define SDIO0_CLOCKCTRL_TIMEOUTCNT_Pos    (16UL)                    /*!< TIMEOUTCNT (Bit 16)                                   */
#define SDIO0_CLOCKCTRL_TIMEOUTCNT_Msk    (0xf0000UL)               /*!< TIMEOUTCNT (Bitfield-Mask: 0x0f)                      */
#define SDIO0_CLOCKCTRL_FREQSEL_Pos       (8UL)                     /*!< FREQSEL (Bit 8)                                       */
#define SDIO0_CLOCKCTRL_FREQSEL_Msk       (0xff00UL)                /*!< FREQSEL (Bitfield-Mask: 0xff)                         */
#define SDIO0_CLOCKCTRL_UPRCLKDIV_Pos     (6UL)                     /*!< UPRCLKDIV (Bit 6)                                     */
#define SDIO0_CLOCKCTRL_UPRCLKDIV_Msk     (0xc0UL)                  /*!< UPRCLKDIV (Bitfield-Mask: 0x03)                       */
#define SDIO0_CLOCKCTRL_CLKGENSEL_Pos     (5UL)                     /*!< CLKGENSEL (Bit 5)                                     */
#define SDIO0_CLOCKCTRL_CLKGENSEL_Msk     (0x20UL)                  /*!< CLKGENSEL (Bitfield-Mask: 0x01)                       */
#define SDIO0_CLOCKCTRL_SDCLKEN_Pos       (2UL)                     /*!< SDCLKEN (Bit 2)                                       */
#define SDIO0_CLOCKCTRL_SDCLKEN_Msk       (0x4UL)                   /*!< SDCLKEN (Bitfield-Mask: 0x01)                         */
#define SDIO0_CLOCKCTRL_CLKSTABLE_Pos     (1UL)                     /*!< CLKSTABLE (Bit 1)                                     */
#define SDIO0_CLOCKCTRL_CLKSTABLE_Msk     (0x2UL)                   /*!< CLKSTABLE (Bitfield-Mask: 0x01)                       */
#define SDIO0_CLOCKCTRL_CLKEN_Pos         (0UL)                     /*!< CLKEN (Bit 0)                                         */
#define SDIO0_CLOCKCTRL_CLKEN_Msk         (0x1UL)                   /*!< CLKEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  INTSTAT  ======================================================== */
#define SDIO0_INTSTAT_VNDERRSTAT_Pos      (29UL)                    /*!< VNDERRSTAT (Bit 29)                                   */
#define SDIO0_INTSTAT_VNDERRSTAT_Msk      (0xe0000000UL)            /*!< VNDERRSTAT (Bitfield-Mask: 0x07)                      */
#define SDIO0_INTSTAT_TGTRESPERR_Pos      (28UL)                    /*!< TGTRESPERR (Bit 28)                                   */
#define SDIO0_INTSTAT_TGTRESPERR_Msk      (0x10000000UL)            /*!< TGTRESPERR (Bitfield-Mask: 0x01)                      */
#define SDIO0_INTSTAT_ADMAERROR_Pos       (25UL)                    /*!< ADMAERROR (Bit 25)                                    */
#define SDIO0_INTSTAT_ADMAERROR_Msk       (0x2000000UL)             /*!< ADMAERROR (Bitfield-Mask: 0x01)                       */
#define SDIO0_INTSTAT_AUTOCMDERROR_Pos    (24UL)                    /*!< AUTOCMDERROR (Bit 24)                                 */
#define SDIO0_INTSTAT_AUTOCMDERROR_Msk    (0x1000000UL)             /*!< AUTOCMDERROR (Bitfield-Mask: 0x01)                    */
#define SDIO0_INTSTAT_CURRENTLIMITERROR_Pos (23UL)                  /*!< CURRENTLIMITERROR (Bit 23)                            */
#define SDIO0_INTSTAT_CURRENTLIMITERROR_Msk (0x800000UL)            /*!< CURRENTLIMITERROR (Bitfield-Mask: 0x01)               */
#define SDIO0_INTSTAT_DATAENDBITERROR_Pos (22UL)                    /*!< DATAENDBITERROR (Bit 22)                              */
#define SDIO0_INTSTAT_DATAENDBITERROR_Msk (0x400000UL)              /*!< DATAENDBITERROR (Bitfield-Mask: 0x01)                 */
#define SDIO0_INTSTAT_DATACRCERROR_Pos    (21UL)                    /*!< DATACRCERROR (Bit 21)                                 */
#define SDIO0_INTSTAT_DATACRCERROR_Msk    (0x200000UL)              /*!< DATACRCERROR (Bitfield-Mask: 0x01)                    */
#define SDIO0_INTSTAT_DATATIMEOUTERROR_Pos (20UL)                   /*!< DATATIMEOUTERROR (Bit 20)                             */
#define SDIO0_INTSTAT_DATATIMEOUTERROR_Msk (0x100000UL)             /*!< DATATIMEOUTERROR (Bitfield-Mask: 0x01)                */
#define SDIO0_INTSTAT_COMMANDINDEXERROR_Pos (19UL)                  /*!< COMMANDINDEXERROR (Bit 19)                            */
#define SDIO0_INTSTAT_COMMANDINDEXERROR_Msk (0x80000UL)             /*!< COMMANDINDEXERROR (Bitfield-Mask: 0x01)               */
#define SDIO0_INTSTAT_COMMANDENDBITERROR_Pos (18UL)                 /*!< COMMANDENDBITERROR (Bit 18)                           */
#define SDIO0_INTSTAT_COMMANDENDBITERROR_Msk (0x40000UL)            /*!< COMMANDENDBITERROR (Bitfield-Mask: 0x01)              */
#define SDIO0_INTSTAT_COMMANDCRCERROR_Pos (17UL)                    /*!< COMMANDCRCERROR (Bit 17)                              */
#define SDIO0_INTSTAT_COMMANDCRCERROR_Msk (0x20000UL)               /*!< COMMANDCRCERROR (Bitfield-Mask: 0x01)                 */
#define SDIO0_INTSTAT_COMMANDTIMEOUTERROR_Pos (16UL)                /*!< COMMANDTIMEOUTERROR (Bit 16)                          */
#define SDIO0_INTSTAT_COMMANDTIMEOUTERROR_Msk (0x10000UL)           /*!< COMMANDTIMEOUTERROR (Bitfield-Mask: 0x01)             */
#define SDIO0_INTSTAT_ERRORINTERRUPT_Pos  (15UL)                    /*!< ERRORINTERRUPT (Bit 15)                               */
#define SDIO0_INTSTAT_ERRORINTERRUPT_Msk  (0x8000UL)                /*!< ERRORINTERRUPT (Bitfield-Mask: 0x01)                  */
#define SDIO0_INTSTAT_BOOTTERMINATE_Pos   (14UL)                    /*!< BOOTTERMINATE (Bit 14)                                */
#define SDIO0_INTSTAT_BOOTTERMINATE_Msk   (0x4000UL)                /*!< BOOTTERMINATE (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSTAT_BOOTACKRCV_Pos      (13UL)                    /*!< BOOTACKRCV (Bit 13)                                   */
#define SDIO0_INTSTAT_BOOTACKRCV_Msk      (0x2000UL)                /*!< BOOTACKRCV (Bitfield-Mask: 0x01)                      */
#define SDIO0_INTSTAT_RETUNINGEVENT_Pos   (12UL)                    /*!< RETUNINGEVENT (Bit 12)                                */
#define SDIO0_INTSTAT_RETUNINGEVENT_Msk   (0x1000UL)                /*!< RETUNINGEVENT (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSTAT_INTC_Pos            (11UL)                    /*!< INTC (Bit 11)                                         */
#define SDIO0_INTSTAT_INTC_Msk            (0x800UL)                 /*!< INTC (Bitfield-Mask: 0x01)                            */
#define SDIO0_INTSTAT_INTB_Pos            (10UL)                    /*!< INTB (Bit 10)                                         */
#define SDIO0_INTSTAT_INTB_Msk            (0x400UL)                 /*!< INTB (Bitfield-Mask: 0x01)                            */
#define SDIO0_INTSTAT_INTA_Pos            (9UL)                     /*!< INTA (Bit 9)                                          */
