zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ========================================================  RTCCTL  ========================================================= */
#define SECURERTC_RTCCTL_HR1224_Pos       (5UL)                     /*!< HR1224 (Bit 5)                                        */
#define SECURERTC_RTCCTL_HR1224_Msk       (0x20UL)                  /*!< HR1224 (Bitfield-Mask: 0x01)                          */
#define SECURERTC_RTCCTL_RSTOP_Pos        (4UL)                     /*!< RSTOP (Bit 4)                                         */
#define SECURERTC_RTCCTL_RSTOP_Msk        (0x10UL)                  /*!< RSTOP (Bitfield-Mask: 0x01)                           */
#define SECURERTC_RTCCTL_RPT_Pos          (1UL)                     /*!< RPT (Bit 1)                                           */
#define SECURERTC_RTCCTL_RPT_Msk          (0xeUL)                   /*!< RPT (Bitfield-Mask: 0x07)                             */
#define SECURERTC_RTCCTL_WRTC_Pos         (0UL)                     /*!< WRTC (Bit 0)                                          */
#define SECURERTC_RTCCTL_WRTC_Msk         (0x1UL)                   /*!< WRTC (Bitfield-Mask: 0x01)                            */
/* ========================================================  RTCSTAT  ======================================================== */
#define SECURERTC_RTCSTAT_WRITEBUSY_Pos   (0UL)                     /*!< WRITEBUSY (Bit 0)                                     */
#define SECURERTC_RTCSTAT_WRITEBUSY_Msk   (0x1UL)                   /*!< WRITEBUSY (Bitfield-Mask: 0x01)                       */
/* ========================================================  CTRLOW  ========================================================= */
#define SECURERTC_CTRLOW_CTRHR_Pos        (24UL)                    /*!< CTRHR (Bit 24)                                        */
#define SECURERTC_CTRLOW_CTRHR_Msk        (0x3f000000UL)            /*!< CTRHR (Bitfield-Mask: 0x3f)                           */
#define SECURERTC_CTRLOW_CTRMIN_Pos       (16UL)                    /*!< CTRMIN (Bit 16)                                       */
#define SECURERTC_CTRLOW_CTRMIN_Msk       (0x7f0000UL)              /*!< CTRMIN (Bitfield-Mask: 0x7f)                          */
#define SECURERTC_CTRLOW_CTRSEC_Pos       (8UL)                     /*!< CTRSEC (Bit 8)                                        */
#define SECURERTC_CTRLOW_CTRSEC_Msk       (0x7f00UL)                /*!< CTRSEC (Bitfield-Mask: 0x7f)                          */
#define SECURERTC_CTRLOW_CTR100_Pos       (0UL)                     /*!< CTR100 (Bit 0)                                        */
#define SECURERTC_CTRLOW_CTR100_Msk       (0xffUL)                  /*!< CTR100 (Bitfield-Mask: 0xff)                          */
/* =========================================================  CTRUP  ========================================================= */
#define SECURERTC_CTRUP_CTERR_Pos         (31UL)                    /*!< CTERR (Bit 31)                                        */
#define SECURERTC_CTRUP_CTERR_Msk         (0x80000000UL)            /*!< CTERR (Bitfield-Mask: 0x01)                           */
#define SECURERTC_CTRUP_CEB_Pos           (29UL)                    /*!< CEB (Bit 29)                                          */
#define SECURERTC_CTRUP_CEB_Msk           (0x20000000UL)            /*!< CEB (Bitfield-Mask: 0x01)                             */
#define SECURERTC_CTRUP_CB_Pos            (28UL)                    /*!< CB (Bit 28)                                           */
#define SECURERTC_CTRUP_CB_Msk            (0x10000000UL)            /*!< CB (Bitfield-Mask: 0x01)                              */
#define SECURERTC_CTRUP_CTRWKDY_Pos       (24UL)                    /*!< CTRWKDY (Bit 24)                                      */
#define SECURERTC_CTRUP_CTRWKDY_Msk       (0x7000000UL)             /*!< CTRWKDY (Bitfield-Mask: 0x07)                         */
#define SECURERTC_CTRUP_CTRYR_Pos         (16UL)                    /*!< CTRYR (Bit 16)                                        */
#define SECURERTC_CTRUP_CTRYR_Msk         (0xff0000UL)              /*!< CTRYR (Bitfield-Mask: 0xff)                           */
#define SECURERTC_CTRUP_CTRMO_Pos         (8UL)                     /*!< CTRMO (Bit 8)                                         */
#define SECURERTC_CTRUP_CTRMO_Msk         (0x1f00UL)                /*!< CTRMO (Bitfield-Mask: 0x1f)                           */
#define SECURERTC_CTRUP_CTRDATE_Pos       (0UL)                     /*!< CTRDATE (Bit 0)                                       */
#define SECURERTC_CTRUP_CTRDATE_Msk       (0x3fUL)                  /*!< CTRDATE (Bitfield-Mask: 0x3f)                         */
/* ========================================================  ALMLOW  ========================================================= */
#define SECURERTC_ALMLOW_ALMHR_Pos        (24UL)                    /*!< ALMHR (Bit 24)                                        */
#define SECURERTC_ALMLOW_ALMHR_Msk        (0x3f000000UL)            /*!< ALMHR (Bitfield-Mask: 0x3f)                           */
#define SECURERTC_ALMLOW_ALMMIN_Pos       (16UL)                    /*!< ALMMIN (Bit 16)                                       */
#define SECURERTC_ALMLOW_ALMMIN_Msk       (0x7f0000UL)              /*!< ALMMIN (Bitfield-Mask: 0x7f)                          */
#define SECURERTC_ALMLOW_ALMSEC_Pos       (8UL)                     /*!< ALMSEC (Bit 8)                                        */
#define SECURERTC_ALMLOW_ALMSEC_Msk       (0x7f00UL)                /*!< ALMSEC (Bitfield-Mask: 0x7f)                          */
#define SECURERTC_ALMLOW_ALM100_Pos       (0UL)                     /*!< ALM100 (Bit 0)                                        */
#define SECURERTC_ALMLOW_ALM100_Msk       (0xffUL)                  /*!< ALM100 (Bitfield-Mask: 0xff)                          */
/* =========================================================  ALMUP  ========================================================= */
#define SECURERTC_ALMUP_ALMWKDY_Pos       (16UL)                    /*!< ALMWKDY (Bit 16)                                      */
#define SECURERTC_ALMUP_ALMWKDY_Msk       (0x70000UL)               /*!< ALMWKDY (Bitfield-Mask: 0x07)                         */
#define SECURERTC_ALMUP_ALMMO_Pos         (8UL)                     /*!< ALMMO (Bit 8)                                         */
#define SECURERTC_ALMUP_ALMMO_Msk         (0x1f00UL)                /*!< ALMMO (Bitfield-Mask: 0x1f)                           */
#define SECURERTC_ALMUP_ALMDATE_Pos       (0UL)                     /*!< ALMDATE (Bit 0)                                       */
#define SECURERTC_ALMUP_ALMDATE_Msk       (0x3fUL)                  /*!< ALMDATE (Bitfield-Mask: 0x3f)                         */
/* =========================================================  INTEN  ========================================================= */
#define SECURERTC_INTEN_ALM_Pos           (0UL)                     /*!< ALM (Bit 0)                                           */
#define SECURERTC_INTEN_ALM_Msk           (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTSTAT  ======================================================== */
#define SECURERTC_INTSTAT_ALM_Pos         (0UL)                     /*!< ALM (Bit 0)                                           */
#define SECURERTC_INTSTAT_ALM_Msk         (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTCLR  ========================================================= */
#define SECURERTC_INTCLR_ALM_Pos          (0UL)                     /*!< ALM (Bit 0)                                           */
#define SECURERTC_INTCLR_ALM_Msk          (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTSET  ========================================================= */
#define SECURERTC_INTSET_ALM_Pos          (0UL)                     /*!< ALM (Bit 0)                                           */
#define SECURERTC_INTSET_ALM_Msk          (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                       SECURESTIMER                                        ================ */
/* =========================================================================================================================== */

