zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ==========================================================  CFG  ========================================================== */
#define SECUREWDT_CFG_NMIEN_Pos           (28UL)                    /*!< NMIEN (Bit 28)                                        */
#define SECUREWDT_CFG_NMIEN_Msk           (0x10000000UL)            /*!< NMIEN (Bitfield-Mask: 0x01)                           */
#define SECUREWDT_CFG_CLKSEL_Pos          (24UL)                    /*!< CLKSEL (Bit 24)                                       */
#define SECUREWDT_CFG_CLKSEL_Msk          (0x7000000UL)             /*!< CLKSEL (Bitfield-Mask: 0x07)                          */
#define SECUREWDT_CFG_INTVAL_Pos          (16UL)                    /*!< INTVAL (Bit 16)                                       */
#define SECUREWDT_CFG_INTVAL_Msk          (0xff0000UL)              /*!< INTVAL (Bitfield-Mask: 0xff)                          */
#define SECUREWDT_CFG_RESVAL_Pos          (8UL)                     /*!< RESVAL (Bit 8)                                        */
#define SECUREWDT_CFG_RESVAL_Msk          (0xff00UL)                /*!< RESVAL (Bitfield-Mask: 0xff)                          */
#define SECUREWDT_CFG_RESEN_Pos           (2UL)                     /*!< RESEN (Bit 2)                                         */
#define SECUREWDT_CFG_RESEN_Msk           (0x4UL)                   /*!< RESEN (Bitfield-Mask: 0x01)                           */
#define SECUREWDT_CFG_INTEN_Pos           (1UL)                     /*!< INTEN (Bit 1)                                         */
#define SECUREWDT_CFG_INTEN_Msk           (0x2UL)                   /*!< INTEN (Bitfield-Mask: 0x01)                           */
#define SECUREWDT_CFG_WDTEN_Pos           (0UL)                     /*!< WDTEN (Bit 0)                                         */
#define SECUREWDT_CFG_WDTEN_Msk           (0x1UL)                   /*!< WDTEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  RSTRT  ========================================================= */
#define SECUREWDT_RSTRT_RSTRT_Pos         (0UL)                     /*!< RSTRT (Bit 0)                                         */
#define SECUREWDT_RSTRT_RSTRT_Msk         (0xffUL)                  /*!< RSTRT (Bitfield-Mask: 0xff)                           */
/* =========================================================  LOCK  ========================================================== */
#define SECUREWDT_LOCK_LOCK_Pos           (0UL)                     /*!< LOCK (Bit 0)                                          */
#define SECUREWDT_LOCK_LOCK_Msk           (0xffUL)                  /*!< LOCK (Bitfield-Mask: 0xff)                            */
/* =========================================================  COUNT  ========================================================= */
#define SECUREWDT_COUNT_COUNT_Pos         (0UL)                     /*!< COUNT (Bit 0)                                         */
#define SECUREWDT_COUNT_COUNT_Msk         (0xffUL)                  /*!< COUNT (Bitfield-Mask: 0xff)                           */
/* =======================================================  WDTIEREN  ======================================================== */
#define SECUREWDT_WDTIEREN_WDTINT_Pos     (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define SECUREWDT_WDTIEREN_WDTINT_Msk     (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* ======================================================  WDTIERSTAT  ======================================================= */
#define SECUREWDT_WDTIERSTAT_WDTINT_Pos   (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define SECUREWDT_WDTIERSTAT_WDTINT_Msk   (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERCLR  ======================================================= */
#define SECUREWDT_WDTIERCLR_WDTINT_Pos    (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define SECUREWDT_WDTIERCLR_WDTINT_Msk    (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERSET  ======================================================= */
#define SECUREWDT_WDTIERSET_WDTINT_Pos    (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define SECUREWDT_WDTIERSET_WDTINT_Msk    (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define SECURITY_CTRL_CRCERROR_Pos        (31UL)                    /*!< CRCERROR (Bit 31)                                     */
#define SECURITY_CTRL_CRCERROR_Msk        (0x80000000UL)            /*!< CRCERROR (Bitfield-Mask: 0x01)                        */
#define SECURITY_CTRL_FUNCTION_Pos        (4UL)                     /*!< FUNCTION (Bit 4)                                      */
#define SECURITY_CTRL_FUNCTION_Msk        (0xf0UL)                  /*!< FUNCTION (Bitfield-Mask: 0x0f)                        */
#define SECURITY_CTRL_ENABLE_Pos          (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define SECURITY_CTRL_ENABLE_Msk          (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* ========================================================  SRCADDR  ======================================================== */
#define SECURITY_SRCADDR_ADDR_Pos         (0UL)                     /*!< ADDR (Bit 0)                                          */
#define SECURITY_SRCADDR_ADDR_Msk         (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  LEN  ========================================================== */
#define SECURITY_LEN_LEN_Pos              (2UL)                     /*!< LEN (Bit 2)                                           */
#define SECURITY_LEN_LEN_Msk              (0xfffffcUL)              /*!< LEN (Bitfield-Mask: 0x3fffff)                         */
/* ========================================================  RESULT  ========================================================= */
#define SECURITY_RESULT_CRC_Pos           (0UL)                     /*!< CRC (Bit 0)                                           */
#define SECURITY_RESULT_CRC_Msk           (0xffffffffUL)            /*!< CRC (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  LOCKCTRL  ======================================================== */
#define SECURITY_LOCKCTRL_SELECT_Pos      (0UL)                     /*!< SELECT (Bit 0)                                        */
#define SECURITY_LOCKCTRL_SELECT_Msk      (0xffUL)                  /*!< SELECT (Bitfield-Mask: 0xff)                          */
/* =======================================================  LOCKSTAT  ======================================================== */
#define SECURITY_LOCKSTAT_STATUS_Pos      (0UL)                     /*!< STATUS (Bit 0)                                        */
#define SECURITY_LOCKSTAT_STATUS_Msk      (0xffffffffUL)            /*!< STATUS (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  KEY0  ========================================================== */
#define SECURITY_KEY0_KEY0_Pos            (0UL)                     /*!< KEY0 (Bit 0)                                          */
#define SECURITY_KEY0_KEY0_Msk            (0xffffffffUL)            /*!< KEY0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY1  ========================================================== */
#define SECURITY_KEY1_KEY1_Pos            (0UL)                     /*!< KEY1 (Bit 0)                                          */
#define SECURITY_KEY1_KEY1_Msk            (0xffffffffUL)            /*!< KEY1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY2  ========================================================== */
#define SECURITY_KEY2_KEY2_Pos            (0UL)                     /*!< KEY2 (Bit 0)                                          */
#define SECURITY_KEY2_KEY2_Msk            (0xffffffffUL)            /*!< KEY2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY3  ========================================================== */
#define SECURITY_KEY3_KEY3_Pos            (0UL)                     /*!< KEY3 (Bit 0)                                          */
#define SECURITY_KEY3_KEY3_Msk            (0xffffffffUL)            /*!< KEY3 (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                            SSC                                            ================ */
/* =========================================================================================================================== */

