zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
#define USB_FIFOADD_OUTFIFOADD_Pos        (16UL)                    /*!< OUTFIFOADD (Bit 16)                                   */
#define USB_FIFOADD_OUTFIFOADD_Msk        (0x1fff0000UL)            /*!< OUTFIFOADD (Bitfield-Mask: 0x1fff)                    */
#define USB_FIFOADD_INFIFOADD_Pos         (0UL)                     /*!< INFIFOADD (Bit 0)                                     */
#define USB_FIFOADD_INFIFOADD_Msk         (0x1fffUL)                /*!< INFIFOADD (Bitfield-Mask: 0x1fff)                     */
/* =========================================================  FIFO0  ========================================================= */
#define USB_FIFO0_FIFO_Pos                (0UL)                     /*!< FIFO (Bit 0)                                          */
#define USB_FIFO0_FIFO_Msk                (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  FIFO1  ========================================================= */
#define USB_FIFO1_FIFO_Pos                (0UL)                     /*!< FIFO (Bit 0)                                          */
#define USB_FIFO1_FIFO_Msk                (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  FIFO2  ========================================================= */
#define USB_FIFO2_FIFO_Pos                (0UL)                     /*!< FIFO (Bit 0)                                          */
#define USB_FIFO2_FIFO_Msk                (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  FIFO3  ========================================================= */
#define USB_FIFO3_FIFO_Pos                (0UL)                     /*!< FIFO (Bit 0)                                          */
#define USB_FIFO3_FIFO_Msk                (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  FIFO4  ========================================================= */
#define USB_FIFO4_FIFO_Pos                (0UL)                     /*!< FIFO (Bit 0)                                          */
#define USB_FIFO4_FIFO_Msk                (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  FIFO5  ========================================================= */
#define USB_FIFO5_FIFO_Pos                (0UL)                     /*!< FIFO (Bit 0)                                          */
#define USB_FIFO5_FIFO_Msk                (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  HWVERS  ========================================================= */
#define USB_HWVERS_RC_Pos                 (15UL)                    /*!< RC (Bit 15)                                           */
#define USB_HWVERS_RC_Msk                 (0x8000UL)                /*!< RC (Bitfield-Mask: 0x01)                              */
#define USB_HWVERS_xx_Pos                 (10UL)                    /*!< xx (Bit 10)                                           */
#define USB_HWVERS_xx_Msk                 (0x7c00UL)                /*!< xx (Bitfield-Mask: 0x1f)                              */
#define USB_HWVERS_yyy_Pos                (0UL)                     /*!< yyy (Bit 0)                                           */
#define USB_HWVERS_yyy_Msk                (0x3ffUL)                 /*!< yyy (Bitfield-Mask: 0x3ff)                            */
/* =========================================================  INFO  ========================================================== */
#define USB_INFO_EDMAIN_Pos               (25UL)                    /*!< EDMAIN (Bit 25)                                       */
#define USB_INFO_EDMAIN_Msk               (0x2000000UL)             /*!< EDMAIN (Bitfield-Mask: 0x01)                          */
#define USB_INFO_EDMAOUT_Pos              (24UL)                    /*!< EDMAOUT (Bit 24)                                      */
#define USB_INFO_EDMAOUT_Msk              (0x1000000UL)             /*!< EDMAOUT (Bitfield-Mask: 0x01)                         */
#define USB_INFO_RSTXS_Pos                (17UL)                    /*!< RSTXS (Bit 17)                                        */
#define USB_INFO_RSTXS_Msk                (0x20000UL)               /*!< RSTXS (Bitfield-Mask: 0x01)                           */
#define USB_INFO_RSTS_Pos                 (16UL)                    /*!< RSTS (Bit 16)                                         */
#define USB_INFO_RSTS_Msk                 (0x10000UL)               /*!< RSTS (Bitfield-Mask: 0x01)                            */
#define USB_INFO_DMAChains_Pos            (12UL)                    /*!< DMAChains (Bit 12)                                    */
#define USB_INFO_DMAChains_Msk            (0xf000UL)                /*!< DMAChains (Bitfield-Mask: 0x0f)                       */
#define USB_INFO_RamBits_Pos              (8UL)                     /*!< RamBits (Bit 8)                                       */
#define USB_INFO_RamBits_Msk              (0xf00UL)                 /*!< RamBits (Bitfield-Mask: 0x0f)                         */
#define USB_INFO_OutEndPoints_Pos         (4UL)                     /*!< OutEndPoints (Bit 4)                                  */
#define USB_INFO_OutEndPoints_Msk         (0xf0UL)                  /*!< OutEndPoints (Bitfield-Mask: 0x0f)                    */
#define USB_INFO_InEndPoints_Pos          (0UL)                     /*!< InEndPoints (Bit 0)                                   */
#define USB_INFO_InEndPoints_Msk          (0xfUL)                   /*!< InEndPoints (Bitfield-Mask: 0x0f)                     */
/* =======================================================  TIMEOUT1  ======================================================== */
#define USB_TIMEOUT1_CTUCH_Pos            (0UL)                     /*!< CTUCH (Bit 0)                                         */
#define USB_TIMEOUT1_CTUCH_Msk            (0xffffUL)                /*!< CTUCH (Bitfield-Mask: 0xffff)                         */
/* =======================================================  TIMEOUT2  ======================================================== */
#define USB_TIMEOUT2_CTHRSTN_Pos          (0UL)                     /*!< CTHRSTN (Bit 0)                                       */
#define USB_TIMEOUT2_CTHRSTN_Msk          (0xffffUL)                /*!< CTHRSTN (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CLKCTRL  ======================================================== */
#define USB_CLKCTRL_PHYAPBLCLKDIS_Pos     (16UL)                    /*!< PHYAPBLCLKDIS (Bit 16)                                */
#define USB_CLKCTRL_PHYAPBLCLKDIS_Msk     (0x10000UL)               /*!< PHYAPBLCLKDIS (Bitfield-Mask: 0x01)                   */
#define USB_CLKCTRL_CTRLAPBCLKDIS_Pos     (8UL)                     /*!< CTRLAPBCLKDIS (Bit 8)                                 */
#define USB_CLKCTRL_CTRLAPBCLKDIS_Msk     (0x100UL)                 /*!< CTRLAPBCLKDIS (Bitfield-Mask: 0x01)                   */
#define USB_CLKCTRL_PHYREFCLKDIS_Pos      (0UL)                     /*!< PHYREFCLKDIS (Bit 0)                                  */
#define USB_CLKCTRL_PHYREFCLKDIS_Msk      (0x1UL)                   /*!< PHYREFCLKDIS (Bitfield-Mask: 0x01)                    */
/* =======================================================  SRAMCTRL  ======================================================== */
#define USB_SRAMCTRL_STOV_Pos             (14UL)                    /*!< STOV (Bit 14)                                         */
#define USB_SRAMCTRL_STOV_Msk             (0x4000UL)                /*!< STOV (Bitfield-Mask: 0x01)                            */
#define USB_SRAMCTRL_WABL_Pos             (13UL)                    /*!< WABL (Bit 13)                                         */
#define USB_SRAMCTRL_WABL_Msk             (0x2000UL)                /*!< WABL (Bitfield-Mask: 0x01)                            */
#define USB_SRAMCTRL_WABLM_Pos            (10UL)                    /*!< WABLM (Bit 10)                                        */
#define USB_SRAMCTRL_WABLM_Msk            (0x1c00UL)                /*!< WABLM (Bitfield-Mask: 0x07)                           */
#define USB_SRAMCTRL_RAWL_Pos             (9UL)                     /*!< RAWL (Bit 9)                                          */
#define USB_SRAMCTRL_RAWL_Msk             (0x200UL)                 /*!< RAWL (Bitfield-Mask: 0x01)                            */
#define USB_SRAMCTRL_RAWLM_Pos            (7UL)                     /*!< RAWLM (Bit 7)                                         */
#define USB_SRAMCTRL_RAWLM_Msk            (0x180UL)                 /*!< RAWLM (Bitfield-Mask: 0x03)                           */
#define USB_SRAMCTRL_EMAW_Pos             (5UL)                     /*!< EMAW (Bit 5)                                          */
#define USB_SRAMCTRL_EMAW_Msk             (0x60UL)                  /*!< EMAW (Bitfield-Mask: 0x03)                            */
#define USB_SRAMCTRL_EMAS_Pos             (4UL)                     /*!< EMAS (Bit 4)                                          */
#define USB_SRAMCTRL_EMAS_Msk             (0x10UL)                  /*!< EMAS (Bitfield-Mask: 0x01)                            */
#define USB_SRAMCTRL_EMA_Pos              (1UL)                     /*!< EMA (Bit 1)                                           */
#define USB_SRAMCTRL_EMA_Msk              (0xeUL)                   /*!< EMA (Bitfield-Mask: 0x07)                             */
#define USB_SRAMCTRL_RET1N_Pos            (0UL)                     /*!< RET1N (Bit 0)                                         */
#define USB_SRAMCTRL_RET1N_Msk            (0x1UL)                   /*!< RET1N (Bitfield-Mask: 0x01)                           */
/* ===================================================  UTMISTICKYSTATUS  ==================================================== */
#define USB_UTMISTICKYSTATUS_OBSPORTSTICKY_Pos (0UL)                /*!< OBSPORTSTICKY (Bit 0)                                 */
#define USB_UTMISTICKYSTATUS_OBSPORTSTICKY_Msk (0x3UL)              /*!< OBSPORTSTICKY (Bitfield-Mask: 0x03)                   */
/* ======================================================  OBSCLRSTAT  ======================================================= */
#define USB_OBSCLRSTAT_CLRSTAT_Pos        (0UL)                     /*!< CLRSTAT (Bit 0)                                       */
#define USB_OBSCLRSTAT_CLRSTAT_Msk        (0x1UL)                   /*!< CLRSTAT (Bitfield-Mask: 0x01)                         */
/* =====================================================  DPDMPULLDOWN  ====================================================== */
#define USB_DPDMPULLDOWN_DPPULLDOWN_Pos   (1UL)                     /*!< DPPULLDOWN (Bit 1)                                    */
#define USB_DPDMPULLDOWN_DPPULLDOWN_Msk   (0x2UL)                   /*!< DPPULLDOWN (Bitfield-Mask: 0x01)                      */
#define USB_DPDMPULLDOWN_DMPULLDOWN_Pos   (0UL)                     /*!< DMPULLDOWN (Bit 0)                                    */
#define USB_DPDMPULLDOWN_DMPULLDOWN_Msk   (0x1UL)                   /*!< DMPULLDOWN (Bitfield-Mask: 0x01)                      */
/* ======================================================  BCDETSTATUS  ====================================================== */
#define USB_BCDETSTATUS_DMCOMPOUT_Pos     (5UL)                     /*!< DMCOMPOUT (Bit 5)                                     */
#define USB_BCDETSTATUS_DMCOMPOUT_Msk     (0x20UL)                  /*!< DMCOMPOUT (Bitfield-Mask: 0x01)                       */
#define USB_BCDETSTATUS_DPCOMPOUT_Pos     (4UL)                     /*!< DPCOMPOUT (Bit 4)                                     */
#define USB_BCDETSTATUS_DPCOMPOUT_Msk     (0x10UL)                  /*!< DPCOMPOUT (Bitfield-Mask: 0x01)                       */
#define USB_BCDETSTATUS_DCPDETECTED_Pos   (2UL)                     /*!< DCPDETECTED (Bit 2)                                   */
#define USB_BCDETSTATUS_DCPDETECTED_Msk   (0x4UL)                   /*!< DCPDETECTED (Bitfield-Mask: 0x01)                     */
#define USB_BCDETSTATUS_CPDETECTED_Pos    (1UL)                     /*!< CPDETECTED (Bit 1)                                    */
#define USB_BCDETSTATUS_CPDETECTED_Msk    (0x2UL)                   /*!< CPDETECTED (Bitfield-Mask: 0x01)                      */
#define USB_BCDETSTATUS_DPATTACHED_Pos    (0UL)                     /*!< DPATTACHED (Bit 0)                                    */
#define USB_BCDETSTATUS_DPATTACHED_Msk    (0x1UL)                   /*!< DPATTACHED (Bitfield-Mask: 0x01)                      */
/* ======================================================  BCDETCRTL1  ======================================================= */
#define USB_BCDETCRTL1_USBSWRESET_Pos     (31UL)                    /*!< USBSWRESET (Bit 31)                                   */
#define USB_BCDETCRTL1_USBSWRESET_Msk     (0x80000000UL)            /*!< USBSWRESET (Bitfield-Mask: 0x01)                      */
#define USB_BCDETCRTL1_USBDCOMPEN_Pos     (11UL)                    /*!< USBDCOMPEN (Bit 11)                                   */
#define USB_BCDETCRTL1_USBDCOMPEN_Msk     (0x800UL)                 /*!< USBDCOMPEN (Bitfield-Mask: 0x01)                      */
#define USB_BCDETCRTL1_USBDCOMPREF_Pos    (8UL)                     /*!< USBDCOMPREF (Bit 8)                                   */
#define USB_BCDETCRTL1_USBDCOMPREF_Msk    (0x300UL)                 /*!< USBDCOMPREF (Bitfield-Mask: 0x03)                     */
#define USB_BCDETCRTL1_IDPSINKEN_Pos      (7UL)                     /*!< IDPSINKEN (Bit 7)                                     */
#define USB_BCDETCRTL1_IDPSINKEN_Msk      (0x80UL)                  /*!< IDPSINKEN (Bitfield-Mask: 0x01)                       */
#define USB_BCDETCRTL1_VDMSRCEN_Pos       (6UL)                     /*!< VDMSRCEN (Bit 6)                                      */
#define USB_BCDETCRTL1_VDMSRCEN_Msk       (0x40UL)                  /*!< VDMSRCEN (Bitfield-Mask: 0x01)                        */
#define USB_BCDETCRTL1_RDMPDWNEN_Pos      (5UL)                     /*!< RDMPDWNEN (Bit 5)                                     */
#define USB_BCDETCRTL1_RDMPDWNEN_Msk      (0x20UL)                  /*!< RDMPDWNEN (Bitfield-Mask: 0x01)                       */
#define USB_BCDETCRTL1_VDPSRCEN_Pos       (4UL)                     /*!< VDPSRCEN (Bit 4)                                      */
#define USB_BCDETCRTL1_VDPSRCEN_Msk       (0x10UL)                  /*!< VDPSRCEN (Bitfield-Mask: 0x01)                        */
#define USB_BCDETCRTL1_IDPSRCEN_Pos       (3UL)                     /*!< IDPSRCEN (Bit 3)                                      */
#define USB_BCDETCRTL1_IDPSRCEN_Msk       (0x8UL)                   /*!< IDPSRCEN (Bitfield-Mask: 0x01)                        */
#define USB_BCDETCRTL1_IDMSINKEN_Pos      (2UL)                     /*!< IDMSINKEN (Bit 2)                                     */
#define USB_BCDETCRTL1_IDMSINKEN_Msk      (0x4UL)                   /*!< IDMSINKEN (Bitfield-Mask: 0x01)                       */
#define USB_BCDETCRTL1_BCWEAKPULLDOWNEN_Pos (1UL)                   /*!< BCWEAKPULLDOWNEN (Bit 1)                              */
#define USB_BCDETCRTL1_BCWEAKPULLDOWNEN_Msk (0x2UL)                 /*!< BCWEAKPULLDOWNEN (Bitfield-Mask: 0x01)                */
#define USB_BCDETCRTL1_BCWEAKPULLUPEN_Pos (0UL)                     /*!< BCWEAKPULLUPEN (Bit 0)                                */
#define USB_BCDETCRTL1_BCWEAKPULLUPEN_Msk (0x1UL)                   /*!< BCWEAKPULLUPEN (Bitfield-Mask: 0x01)                  */
/* ======================================================  BCDETCRTL2  ======================================================= */
#define USB_BCDETCRTL2_BCWEAKPULLDOWNTUNE_Pos (10UL)                /*!< BCWEAKPULLDOWNTUNE (Bit 10)                           */
#define USB_BCDETCRTL2_BCWEAKPULLDOWNTUNE_Msk (0xc00UL)             /*!< BCWEAKPULLDOWNTUNE (Bitfield-Mask: 0x03)              */
#define USB_BCDETCRTL2_BCWEAKPULLUPTUNE_Pos (8UL)                   /*!< BCWEAKPULLUPTUNE (Bit 8)                              */
#define USB_BCDETCRTL2_BCWEAKPULLUPTUNE_Msk (0x300UL)               /*!< BCWEAKPULLUPTUNE (Bitfield-Mask: 0x03)                */
#define USB_BCDETCRTL2_FORCEDCPDET_Pos    (3UL)                     /*!< FORCEDCPDET (Bit 3)                                   */
#define USB_BCDETCRTL2_FORCEDCPDET_Msk    (0x8UL)                   /*!< FORCEDCPDET (Bitfield-Mask: 0x01)                     */
#define USB_BCDETCRTL2_FORCECPDET_Pos     (2UL)                     /*!< FORCECPDET (Bit 2)                                    */
#define USB_BCDETCRTL2_FORCECPDET_Msk     (0x4UL)                   /*!< FORCECPDET (Bitfield-Mask: 0x01)                      */
#define USB_BCDETCRTL2_FORCEDPATTACHED_Pos (1UL)                    /*!< FORCEDPATTACHED (Bit 1)                               */
#define USB_BCDETCRTL2_FORCEDPATTACHED_Msk (0x2UL)                  /*!< FORCEDPATTACHED (Bitfield-Mask: 0x01)                 */
#define USB_BCDETCRTL2_CHARGEDETBYP_Pos   (0UL)                     /*!< CHARGEDETBYP (Bit 0)                                  */
#define USB_BCDETCRTL2_CHARGEDETBYP_Msk   (0x1UL)                   /*!< CHARGEDETBYP (Bitfield-Mask: 0x01)                    */
/* ========================================================  DMACTRL  ======================================================== */
#define USB_DMACTRL_TOTCOUNT_Pos          (16UL)                    /*!< TOTCOUNT (Bit 16)                                     */
#define USB_DMACTRL_TOTCOUNT_Msk          (0xfff0000UL)             /*!< TOTCOUNT (Bitfield-Mask: 0xfff)                       */
#define USB_DMACTRL_DMAPRI_Pos            (5UL)                     /*!< DMAPRI (Bit 5)                                        */
#define USB_DMACTRL_DMAPRI_Msk            (0x20UL)                  /*!< DMAPRI (Bitfield-Mask: 0x01)                          */
#define USB_DMACTRL_DMADIR_Pos            (4UL)                     /*!< DMADIR (Bit 4)                                        */
#define USB_DMACTRL_DMADIR_Msk            (0x10UL)                  /*!< DMADIR (Bitfield-Mask: 0x01)                          */
#define USB_DMACTRL_DMAEP_Pos             (1UL)                     /*!< DMAEP (Bit 1)                                         */
#define USB_DMACTRL_DMAEP_Msk             (0xeUL)                   /*!< DMAEP (Bitfield-Mask: 0x07)                           */
#define USB_DMACTRL_DMAEN_Pos             (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define USB_DMACTRL_DMAEN_Msk             (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  DMATARGADDR  ====================================================== */
#define USB_DMATARGADDR_TARGADDR_Pos      (0UL)                     /*!< TARGADDR (Bit 0)                                      */
#define USB_DMATARGADDR_TARGADDR_Msk      (0xffffffffUL)            /*!< TARGADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  DMAINTEN  ======================================================== */
#define USB_DMAINTEN_DMAERR_Pos           (1UL)                     /*!< DMAERR (Bit 1)                                        */
#define USB_DMAINTEN_DMAERR_Msk           (0x2UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define USB_DMAINTEN_DMACMP_Pos           (0UL)                     /*!< DMACMP (Bit 0)                                        */
#define USB_DMAINTEN_DMACMP_Msk           (0x1UL)                   /*!< DMACMP (Bitfield-Mask: 0x01)                          */
/* ======================================================  DMAINTSTAT  ======================================================= */
#define USB_DMAINTSTAT_DMAERR_Pos         (1UL)                     /*!< DMAERR (Bit 1)                                        */
#define USB_DMAINTSTAT_DMAERR_Msk         (0x2UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define USB_DMAINTSTAT_DMACMP_Pos         (0UL)                     /*!< DMACMP (Bit 0)                                        */
#define USB_DMAINTSTAT_DMACMP_Msk         (0x1UL)                   /*!< DMACMP (Bitfield-Mask: 0x01)                          */
/* =======================================================  DMAINTCLR  ======================================================= */
#define USB_DMAINTCLR_DMAERR_Pos          (1UL)                     /*!< DMAERR (Bit 1)                                        */
#define USB_DMAINTCLR_DMAERR_Msk          (0x2UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define USB_DMAINTCLR_DMACMP_Pos          (0UL)                     /*!< DMACMP (Bit 0)                                        */
#define USB_DMAINTCLR_DMACMP_Msk          (0x1UL)                   /*!< DMACMP (Bitfield-Mask: 0x01)                          */
/* =======================================================  DMAINTSET  ======================================================= */
#define USB_DMAINTSET_DMAERR_Pos          (1UL)                     /*!< DMAERR (Bit 1)                                        */
#define USB_DMAINTSET_DMAERR_Msk          (0x2UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define USB_DMAINTSET_DMACMP_Pos          (0UL)                     /*!< DMACMP (Bit 0)                                        */
#define USB_DMAINTSET_DMACMP_Msk          (0x1UL)                   /*!< DMACMP (Bitfield-Mask: 0x01)                          */
/* =======================================================  ADMACTRL  ======================================================== */
#define USB_ADMACTRL_DMAMODE_Pos          (0UL)                     /*!< DMAMODE (Bit 0)                                       */
#define USB_ADMACTRL_DMAMODE_Msk          (0x1UL)                   /*!< DMAMODE (Bitfield-Mask: 0x01)                         */
/* ========================================================  ADMAEN  ========================================================= */
#define USB_ADMAEN_ADMAEN_Pos             (0UL)                     /*!< ADMAEN (Bit 0)                                        */
#define USB_ADMAEN_ADMAEN_Msk             (0x3ffUL)                 /*!< ADMAEN (Bitfield-Mask: 0x3ff)                         */
/* ========================================================  ADMADIR  ======================================================== */
#define USB_ADMADIR_ADMADIR_Pos           (0UL)                     /*!< ADMADIR (Bit 0)                                       */
#define USB_ADMADIR_ADMADIR_Msk           (0x3ffUL)                 /*!< ADMADIR (Bitfield-Mask: 0x3ff)                        */
/* ========================================================  ADMAPRI  ======================================================== */
#define USB_ADMAPRI_ADMAPRI_Pos           (0UL)                     /*!< ADMAPRI (Bit 0)                                       */
#define USB_ADMAPRI_ADMAPRI_Msk           (0x3ffUL)                 /*!< ADMAPRI (Bitfield-Mask: 0x3ff)                        */
/* =====================================================  ADMACMPINTEN  ====================================================== */
#define USB_ADMACMPINTEN_ADMACMP9_Pos     (9UL)                     /*!< ADMACMP9 (Bit 9)                                      */
