zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ==============================================  CLKGEN CLKOUT CKSEL [0..5]  =============================================== */
typedef enum {                                  /*!< CLKGEN_CLKOUT_CKSEL                                                       */
  CLKGEN_CLKOUT_CKSEL_LFRC_NOMINAL     = 0,     /*!< LFRC_NOMINAL : LFRC clock source selection.                               */
  CLKGEN_CLKOUT_CKSEL_XT_DIV2          = 1,     /*!< XT_DIV2 : XT 32KHz clock                                                  */
  CLKGEN_CLKOUT_CKSEL_XT_DIV4          = 2,     /*!< XT_DIV4 : XT 16KHz clock                                                  */
  CLKGEN_CLKOUT_CKSEL_XT_DIV8          = 3,     /*!< XT_DIV8 : XT 8KHz clock                                                   */
  CLKGEN_CLKOUT_CKSEL_XT_DIV16         = 4,     /*!< XT_DIV16 : XT 4KHz clock                                                  */
  CLKGEN_CLKOUT_CKSEL_XT_DIV32         = 5,     /*!< XT_DIV32 : XT 2KHz clock                                                  */
  CLKGEN_CLKOUT_CKSEL_XT_DIV256        = 6,     /*!< XT_DIV256 : XT 1KHz clock                                                 */
  CLKGEN_CLKOUT_CKSEL_XT_DIV8K         = 7,     /*!< XT_DIV8K : XT 128Hz clock                                                 */
  CLKGEN_CLKOUT_CKSEL_XT_DIV64K        = 8,     /*!< XT_DIV64K : XT 4Hz clock                                                  */
  CLKGEN_CLKOUT_CKSEL_XT_DIV2M         = 9,     /*!< XT_DIV2M : XT 1/2Hz clock                                                 */
  CLKGEN_CLKOUT_CKSEL_XT               = 10,    /*!< XT : XT 1/64Hz clock                                                      */
  CLKGEN_CLKOUT_CKSEL_RTC_1Hz          = 11,    /*!< RTC_1Hz : RTC 1Hz clock                                                   */
  CLKGEN_CLKOUT_CKSEL_RTC_CG_100Hz     = 12,    /*!< RTC_CG_100Hz : ClkGen 100Hz clock for RTC                                 */
  CLKGEN_CLKOUT_CKSEL_LFRC_DIV2        = 35,    /*!< LFRC_DIV2 : MCU clock                                                     */
  CLKGEN_CLKOUT_CKSEL_PLLVCO_250       = 36,    /*!< PLLVCO_250 : PLLVCO 250MHz clock                                          */
  CLKGEN_CLKOUT_CKSEL_PLLVCO_125       = 37,    /*!< PLLVCO_125 : PLLVCO 125MHz clock                                          */
  CLKGEN_CLKOUT_CKSEL_PLLPOSTDIV       = 38,    /*!< PLLPOSTDIV : PLL POSTDIV                                                  */
  CLKGEN_CLKOUT_CKSEL_PLLFOUT2         = 39,    /*!< PLLFOUT2 : PLLFOUT2 clock                                                 */
  CLKGEN_CLKOUT_CKSEL_PLLFOUT3         = 40,    /*!< PLLFOUT3 : PLLFOUT3 clock                                                 */
  CLKGEN_CLKOUT_CKSEL_PLLFOUT4         = 41,    /*!< PLLFOUT4 : PLLFOUT4 clock                                                 */
  CLKGEN_CLKOUT_CKSEL_RFXTAL48         = 42,    /*!< RFXTAL48 : RF XTAL 48MHz clock                                            */
  CLKGEN_CLKOUT_CKSEL_RFXTAL24         = 43,    /*!< RFXTAL24 : RF XTAL 24MHz clock                                            */
  CLKGEN_CLKOUT_CKSEL_RFXTAL12         = 44,    /*!< RFXTAL12 : RF XTAL 12MHz clock                                            */
  CLKGEN_CLKOUT_CKSEL_SECURE_RTC_1Hz   = 45,    /*!< SECURE_RTC_1Hz : SECURE_RTC 1Hz clock                                     */
  CLKGEN_CLKOUT_CKSEL_SECURE_RTC_CG_100Hz = 46, /*!< SECURE_RTC_CG_100Hz : ClkGen 100Hz clock for SECURE_RTC                   */
  CLKGEN_CLKOUT_CKSEL_AO_DIV_CLK       = 47,    /*!< AO_DIV_CLK : AO_CLK div16                                                 */
} CLKGEN_CLKOUT_CKSEL_Enum;

/* =========================================================  HFADJ  ========================================================= */
/* ==========================================  CLKGEN HFADJ HFADJMAXDELTA [24..28]  ========================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJMAXDELTA                                                */
  CLKGEN_HFADJ_HFADJMAXDELTA_DISABLED  = 0,     /*!< DISABLED : Maximum Delta function is disabled                             */
  CLKGEN_HFADJ_HFADJMAXDELTA_ENABLED   = 1,     /*!< ENABLED : Maximum Delta function is enabled                               */
} CLKGEN_HFADJ_HFADJMAXDELTA_Enum;

/* ============================================  CLKGEN HFADJ HFADJGAIN [21..23]  ============================================ */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJGAIN                                                    */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1     = 0,     /*!< Gain_of_1 : HF Adjust with Gain of 1                                      */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_2 = 1,    /*!< Gain_of_1_in_2 : HF Adjust with Gain of 0.5                               */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_4 = 2,    /*!< Gain_of_1_in_4 : HF Adjust with Gain of 0.25                              */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_8 = 3,    /*!< Gain_of_1_in_8 : HF Adjust with Gain of 0.125                             */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_16 = 4,   /*!< Gain_of_1_in_16 : HF Adjust with Gain of 0.0625                           */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_32 = 5,   /*!< Gain_of_1_in_32 : HF Adjust with Gain of 0.03125                          */
} CLKGEN_HFADJ_HFADJGAIN_Enum;

/* ============================================  CLKGEN HFADJ HFWARMUP [20..20]  ============================================= */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFWARMUP                                                     */
  CLKGEN_HFADJ_HFWARMUP_1SEC           = 0,     /*!< 1SEC : Autoadjust XT warmup period = 1-2 seconds                          */
  CLKGEN_HFADJ_HFWARMUP_2SEC           = 1,     /*!< 2SEC : Autoadjust XT warmup period = 2-4 seconds                          */
} CLKGEN_HFADJ_HFWARMUP_Enum;

/* ==============================================  CLKGEN HFADJ HFADJCK [1..3]  ============================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJCK                                                      */
  CLKGEN_HFADJ_HFADJCK_4SEC            = 0,     /*!< 4SEC : Autoadjust repeat period = 4 seconds                               */
  CLKGEN_HFADJ_HFADJCK_16SEC           = 1,     /*!< 16SEC : Autoadjust repeat period = 16 seconds                             */
  CLKGEN_HFADJ_HFADJCK_32SEC           = 2,     /*!< 32SEC : Autoadjust repeat period = 32 seconds                             */
  CLKGEN_HFADJ_HFADJCK_64SEC           = 3,     /*!< 64SEC : Autoadjust repeat period = 64 seconds                             */
  CLKGEN_HFADJ_HFADJCK_128SEC          = 4,     /*!< 128SEC : Autoadjust repeat period = 128 seconds                           */
  CLKGEN_HFADJ_HFADJCK_256SEC          = 5,     /*!< 256SEC : Autoadjust repeat period = 256 seconds                           */
  CLKGEN_HFADJ_HFADJCK_512SEC          = 6,     /*!< 512SEC : Autoadjust repeat period = 512 seconds                           */
  CLKGEN_HFADJ_HFADJCK_1024SEC         = 7,     /*!< 1024SEC : Autoadjust repeat period = 1024 seconds                         */
} CLKGEN_HFADJ_HFADJCK_Enum;

/* ==============================================  CLKGEN HFADJ HFADJEN [0..0]  ============================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJEN                                                      */
  CLKGEN_HFADJ_HFADJEN_DIS             = 0,     /*!< DIS : Disable the HFRC adjustment                                         */
  CLKGEN_HFADJ_HFADJEN_EN              = 1,     /*!< EN : Enable the HFRC adjustment                                           */
} CLKGEN_HFADJ_HFADJEN_Enum;

/* ======================================================  CLOCKENSTAT  ====================================================== */
/* ==========================================  CLKGEN CLOCKENSTAT RTCOSEL [29..29]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLOCKENSTAT_RTCOSEL                                                */
  CLKGEN_CLOCKENSTAT_RTCOSEL_XT_512Hz  = 0,     /*!< XT_512Hz : RTC Using XT 512Hz source                                      */
  CLKGEN_CLOCKENSTAT_RTCOSEL_LFRX_512Hz = 1,    /*!< LFRX_512Hz : RTC Using LFRC 512Hz source                                  */
} CLKGEN_CLOCKENSTAT_RTCOSEL_Enum;

