zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  CLKGEN MISC PWRONCLKENCRYPTO [13..13]  ========================================= */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENCRYPTO                                              */
  CLKGEN_MISC_PWRONCLKENCRYPTO_CRYPTOCLKENRST = 0,/*!< CRYPTOCLKENRST : Enable Cryto engine Clock to run during reset          */
  CLKGEN_MISC_PWRONCLKENCRYPTO_DEFEATURE = 1,   /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENCRYPTO_Enum;

/* ==========================================  CLKGEN MISC PWRONCLKENSDIO [12..12]  ========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENSDIO                                                */
  CLKGEN_MISC_PWRONCLKENSDIO_SDIOCLKENRST = 0,  /*!< SDIOCLKENRST : Enable SDIO Clock to run during reset                      */
  CLKGEN_MISC_PWRONCLKENSDIO_DEFEATURE = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENSDIO_Enum;

/* ==========================================  CLKGEN MISC PWRONCLKENUSB [11..11]  =========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENUSB                                                 */
  CLKGEN_MISC_PWRONCLKENUSB_USBCLKENRST = 0,    /*!< USBCLKENRST : Enable USB Clock to run during reset                        */
  CLKGEN_MISC_PWRONCLKENUSB_DEFEATURE  = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENUSB_Enum;

/* ==========================================  CLKGEN MISC PWRONCLKENGFX [10..10]  =========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENGFX                                                 */
  CLKGEN_MISC_PWRONCLKENGFX_GFXCLKENRST = 0,    /*!< GFXCLKENRST : Enable GFX Clock to run during reset                        */
  CLKGEN_MISC_PWRONCLKENGFX_DEFEATURE  = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENGFX_Enum;

/* ===========================================  CLKGEN MISC PWRONCLKENDISP [9..9]  =========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENDISP                                                */
  CLKGEN_MISC_PWRONCLKENDISP_DISPCLKENRST = 0,  /*!< DISPCLKENRST : Enable Display Clock to run during reset                   */
  CLKGEN_MISC_PWRONCLKENDISP_DEFEATURE = 1,     /*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENDISP_Enum;

/* ============================================  CLKGEN MISC FRCBURSTOFF [1..1]  ============================================= */
typedef enum {                                  /*!< CLKGEN_MISC_FRCBURSTOFF                                                   */
  CLKGEN_MISC_FRCBURSTOFF_BURSTCLKON   = 0,     /*!< BURSTCLKON : fclk, hclk and fclk_wic are turned on during the
                                                     burst transition                                                          */
  CLKGEN_MISC_FRCBURSTOFF_BURSTCLKOFF  = 1,     /*!< BURSTCLKOFF : fclk, hclk and fclk are turned off during burst
                                                     transition                                                                */
} CLKGEN_MISC_FRCBURSTOFF_Enum;

/* ==============================================  CLKGEN MISC FRCHFRC [0..0]  =============================================== */
typedef enum {                                  /*!< CLKGEN_MISC_FRCHFRC                                                       */
  CLKGEN_MISC_FRCHFRC_NOFRC            = 0,     /*!< NOFRC : HFRC stops in deep sleep mode                                     */
  CLKGEN_MISC_FRCHFRC_FRC              = 1,     /*!< FRC : HFRC runs in deep sleep mode                                        */
} CLKGEN_MISC_FRCHFRC_Enum;

/* =======================================================  LFRCCTRL  ======================================================== */
/* =====================================================  CLKGENSPARES  ====================================================== */
/* ===================================================  HFRCIDLECOUNTERS  ==================================================== */
/* =====================================================  MSPIIOCLKCTRL  ===================================================== */
/* ======================================  CLKGEN MSPIIOCLKCTRL MSPI2IOCLKSEL [11..14]  ====================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_750KHz = 0,/*!< HFRC_750KHz : 750KHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_1p5MHz = 1,/*!< HFRC_1p5MHz : 1.5MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_3MHz = 2,/*!< HFRC_3MHz : 3MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_6MHz = 3,/*!< HFRC_6MHz : 6MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_12MHz = 4,/*!< HFRC_12MHz : 12MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_24MHz = 5,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_48MHz = 6,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_PLLVCO_125MHz = 9,/*!< PLLVCO_125MHz : 125MHz sourced from the PLL                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_PLLVCO_250MHz = 10,/*!< PLLVCO_250MHz : 250MHz sourced from the PLL                       */
} CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_Enum;

/* ======================================  CLKGEN MSPIIOCLKCTRL MSPI2IOCLKEN [10..10]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_Enum;

