zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI1IOCLKSEL [6..9]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_750KHz = 0,/*!< HFRC_750KHz : 750KHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_1p5MHz = 1,/*!< HFRC_1p5MHz : 1.5MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_3MHz = 2,/*!< HFRC_3MHz : 3MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_6MHz = 3,/*!< HFRC_6MHz : 6MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_12MHz = 4,/*!< HFRC_12MHz : 12MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_24MHz = 5,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_48MHz = 6,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_PLLVCO_125MHz = 9,/*!< PLLVCO_125MHz : 125MHz sourced from the PLL                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_PLLVCO_250MHz = 10,/*!< PLLVCO_250MHz : 250MHz sourced from the PLL                       */
} CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI1IOCLKEN [5..5]  ======================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI0IOCLKSEL [1..4]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_750KHz = 0,/*!< HFRC_750KHz : 750KHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_1p5MHz = 1,/*!< HFRC_1p5MHz : 1.5MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_3MHz = 2,/*!< HFRC_3MHz : 3MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_6MHz = 3,/*!< HFRC_6MHz : 6MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_12MHz = 4,/*!< HFRC_12MHz : 12MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_24MHz = 5,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_48MHz = 6,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_PLLVCO_125MHz = 9,/*!< PLLVCO_125MHz : 125MHz sourced from the PLL                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_PLLVCO_250MHz = 10,/*!< PLLVCO_250MHz : 250MHz sourced from the PLL                       */
} CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI0IOCLKEN [0..0]  ======================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_Enum;

/* ========================================================  CLKCTRL  ======================================================== */
/* ===========================================  CLKGEN CLKCTRL I3CCLKEN [11..11]  ============================================ */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_I3CCLKEN                                                   */
  CLKGEN_CLKCTRL_I3CCLKEN_DISABLE      = 0,     /*!< DISABLE : I3C clock disabled                                              */
  CLKGEN_CLKCTRL_I3CCLKEN_ENABLE       = 1,     /*!< ENABLE : I3C clock enabled                                                */
} CLKGEN_CLKCTRL_I3CCLKEN_Enum;

/* ===========================================  CLKGEN CLKCTRL PLLVCOEN [10..10]  ============================================ */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_PLLVCOEN                                                   */
  CLKGEN_CLKCTRL_PLLVCOEN_NORMALOP     = 0,     /*!< NORMALOP : HW control of the PLL VCO enable                               */
  CLKGEN_CLKCTRL_PLLVCOEN_ENABLE       = 1,     /*!< ENABLE : PLL VCO is turned on                                             */
} CLKGEN_CLKCTRL_PLLVCOEN_Enum;

/* ============================================  CLKGEN CLKCTRL PLLDIVEN [9..9]  ============================================= */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_PLLDIVEN                                                   */
  CLKGEN_CLKCTRL_PLLDIVEN_NORMALOP     = 0,     /*!< NORMALOP : HW control of the PLL post divider enable                      */
  CLKGEN_CLKCTRL_PLLDIVEN_ENABLE       = 1,     /*!< ENABLE : PLL post dividers are turned on                                  */
} CLKGEN_CLKCTRL_PLLDIVEN_Enum;

