zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ===========================================  CLKGEN CLKCTRL XTHSMUXSEL [8..8]  ============================================ */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_XTHSMUXSEL                                                 */
  CLKGEN_CLKCTRL_XTHSMUXSEL_XTHS       = 0,     /*!< XTHS : Select high speed crystal oscillator (48MHz)                       */
  CLKGEN_CLKCTRL_XTHSMUXSEL_EXTREF     = 1,     /*!< EXTREF : Select external reference clock                                  */
} CLKGEN_CLKCTRL_XTHSMUXSEL_Enum;

/* ==========================================  CLKGEN CLKCTRL DISPCTRLCLKEN [7..7]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_DISPCTRLCLKEN                                              */
  CLKGEN_CLKCTRL_DISPCTRLCLKEN_DISABLE = 0,     /*!< DISABLE : Display controller clock disabled                               */
  CLKGEN_CLKCTRL_DISPCTRLCLKEN_ENABLE  = 1,     /*!< ENABLE : Display controller clock enabled                                 */
} CLKGEN_CLKCTRL_DISPCTRLCLKEN_Enum;

/* ==========================================  CLKGEN CLKCTRL MCUCLKFORCEON [6..6]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_MCUCLKFORCEON                                              */
  CLKGEN_CLKCTRL_MCUCLKFORCEON_OFF     = 0,     /*!< OFF : Normal operation                                                    */
  CLKGEN_CLKCTRL_MCUCLKFORCEON_ON      = 1,     /*!< ON : Force MCU clock on                                                   */
} CLKGEN_CLKCTRL_MCUCLKFORCEON_Enum;

/* =========================================  CLKGEN CLKCTRL IWICCLKFORCEON [5..5]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_IWICCLKFORCEON                                             */
  CLKGEN_CLKCTRL_IWICCLKFORCEON_OFF    = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_IWICCLKFORCEON_ON     = 1,     /*!< ON : Force IWIC clock on                                                  */
} CLKGEN_CLKCTRL_IWICCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL DBGCLKFORCEON [4..4]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_DBGCLKFORCEON                                              */
  CLKGEN_CLKCTRL_DBGCLKFORCEON_OFF     = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_DBGCLKFORCEON_ON      = 1,     /*!< ON : Force DBG clock on                                                   */
} CLKGEN_CLKCTRL_DBGCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL PMUCLKFORCEON [3..3]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_PMUCLKFORCEON                                              */
  CLKGEN_CLKCTRL_PMUCLKFORCEON_OFF     = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_PMUCLKFORCEON_ON      = 1,     /*!< ON : Force PMU clock on                                                   */
} CLKGEN_CLKCTRL_PMUCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL STCLKFORCEON [2..2]  =========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_STCLKFORCEON                                               */
  CLKGEN_CLKCTRL_STCLKFORCEON_OFF      = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_STCLKFORCEON_ON       = 1,     /*!< ON : Force ST clock on                                                    */
} CLKGEN_CLKCTRL_STCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL GFXCORECLKEN [0..0]  =========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_GFXCORECLKEN                                               */
  CLKGEN_CLKCTRL_GFXCORECLKEN_DIS      = 0,     /*!< DIS : Disable GFX clock                                                   */
  CLKGEN_CLKCTRL_GFXCORECLKEN_EN       = 1,     /*!< EN : Enable GFX clock                                                     */
} CLKGEN_CLKCTRL_GFXCORECLKEN_Enum;



/* =========================================================================================================================== */
/* ================                                          CM55IPC                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  M2DDATA  ======================================================== */
/* ========================================================  D2MDATA  ======================================================== */
/* ========================================================  STATUS  ========================================================= */
/* =========================================================  M2DIT  ========================================================= */
/* =========================================================  M2DIS  ========================================================= */
/* =========================================================  M2DIE  ========================================================= */
/* =======================================================  D2MERROR  ======================================================== */
/* =========================================================  D2MIT  ========================================================= */
/* =========================================================  D2MIS  ========================================================= */
/* =========================================================  D2MIE  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            CRM                                            ================ */
/* =========================================================================================================================== */

