zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =============================================  DC CLKCTRL DIVIDEVALUE [0..5]  ============================================= */
typedef enum {                                  /*!< DC_CLKCTRL_DIVIDEVALUE                                                    */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_0        = 0,     /*!< FDIV_0 : No Division                                                      */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_1        = 1,     /*!< FDIV_1 : No Division                                                      */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_2        = 2,     /*!< FDIV_2 : Divided by 2                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_3        = 3,     /*!< FDIV_3 : Divided by 3                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_4        = 4,     /*!< FDIV_4 : Divided by 4                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_5        = 5,     /*!< FDIV_5 : Divided by 5                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_6        = 6,     /*!< FDIV_6 : Divided by 6                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_7        = 7,     /*!< FDIV_7 : Divided by 7                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_8        = 8,     /*!< FDIV_8 : Divided by 8                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_9        = 9,     /*!< FDIV_9 : Divided by 9                                                     */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_10       = 10,    /*!< FDIV_10 : Divided by 10                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_11       = 11,    /*!< FDIV_11 : Divided by 11                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_12       = 12,    /*!< FDIV_12 : Divided by 12                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_13       = 13,    /*!< FDIV_13 : Divided by 13                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_14       = 14,    /*!< FDIV_14 : Divided by 14                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_15       = 15,    /*!< FDIV_15 : Divided by 15                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_16       = 16,    /*!< FDIV_16 : Divided by 16                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_17       = 17,    /*!< FDIV_17 : Divided by 17                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_18       = 18,    /*!< FDIV_18 : Divided by 18                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_19       = 19,    /*!< FDIV_19 : Divided by 19                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_20       = 20,    /*!< FDIV_20 : Divided by 20                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_21       = 21,    /*!< FDIV_21 : Divided by 21                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_22       = 22,    /*!< FDIV_22 : Divided by 22                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_23       = 23,    /*!< FDIV_23 : Divided by 23                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_24       = 24,    /*!< FDIV_24 : Divided by 24                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_25       = 25,    /*!< FDIV_25 : Divided by 25                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_26       = 26,    /*!< FDIV_26 : Divided by 26                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_27       = 27,    /*!< FDIV_27 : Divided by 27                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_28       = 28,    /*!< FDIV_28 : Divided by 28                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_29       = 29,    /*!< FDIV_29 : Divided by 29                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_30       = 30,    /*!< FDIV_30 : Divided by 30                                                   */
  DC_CLKCTRL_DIVIDEVALUE_FDIV_31       = 31,    /*!< FDIV_31 : Divided by 31                                                   */
} DC_CLKCTRL_DIVIDEVALUE_Enum;

/* ========================================================  BGCOLOR  ======================================================== */
/* =========================================================  RESXY  ========================================================= */
/* ========================================================  REGPLAY  ======================================================== */
/* =====================================================  FRONTPORCHXY  ====================================================== */
/* ======================================================  BLANKINGXY  ======================================================= */
/* ======================================================  BACKPORCHXY  ====================================================== */
/* =======================================================  CURSORXY  ======================================================== */
/* ========================================================  STARTXY  ======================================================== */
/* ========================================================  DBICFG  ========================================================= */
/* ===============================================  DC DBICFG CSXSET [29..29]  =============================================== */
typedef enum {                                  /*!< DC_DBICFG_CSXSET                                                          */
  DC_DBICFG_CSXSET_CSX1                = 1,     /*!< CSX1 : is set to one if DBI_CFG[29] has the value of one                  */
  DC_DBICFG_CSXSET_CSX0                = 0,     /*!< CSX0 : is set to zero if DBI_CFG[29] has the value of zero                */
} DC_DBICFG_CSXSET_Enum;

/* ===============================================  DC DBICFG SPIMODE [9..10]  =============================================== */
typedef enum {                                  /*!< DC_DBICFG_SPIMODE                                                         */
  DC_DBICFG_SPIMODE_MODE_SPI           = 0,     /*!< MODE_SPI : SPI Mode                                                       */
  DC_DBICFG_SPIMODE_MODE_DUALSPI       = 1,     /*!< MODE_DUALSPI : Dual SPI Mode                                              */
  DC_DBICFG_SPIMODE_MODE_QUADSPI       = 2,     /*!< MODE_QUADSPI : Quad SPI Mode                                              */
  DC_DBICFG_SPIMODE_MODE_QUADSPI_DDR   = 3,     /*!< MODE_QUADSPI_DDR : Quad SPI DDR Mode                                      */
} DC_DBICFG_SPIMODE_Enum;

/* ==============================================  DC DBICFG TYPEBWIDTH [6..8]  ============================================== */
typedef enum {                                  /*!< DC_DBICFG_TYPEBWIDTH                                                      */
  DC_DBICFG_TYPEBWIDTH_INT_16          = 0,     /*!< INT_16 : 16-bit interface                                                 */
  DC_DBICFG_TYPEBWIDTH_INT_9           = 1,     /*!< INT_9 : 9-bit interface                                                   */
  DC_DBICFG_TYPEBWIDTH_INT_8           = 2,     /*!< INT_8 : 8-bit interface                                                   */
  DC_DBICFG_TYPEBWIDTH_INT_SERIAL      = 3,     /*!< INT_SERIAL : Serial interface                                             */
} DC_DBICFG_TYPEBWIDTH_Enum;

/* =============================================  DC DBICFG DATAWDORDER [3..5]  ============================================== */
typedef enum {                                  /*!< DC_DBICFG_DATAWDORDER                                                     */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT0  = 0,     /*!< WD_ORDER_OPT0 : option 0                                                  */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT1  = 1,     /*!< WD_ORDER_OPT1 : option 1                                                  */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT2  = 2,     /*!< WD_ORDER_OPT2 : option 2                                                  */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT3  = 3,     /*!< WD_ORDER_OPT3 : option 3                                                  */
} DC_DBICFG_DATAWDORDER_Enum;

/* =============================================  DC DBICFG DBICOLORFMT [0..2]  ============================================== */
typedef enum {                                  /*!< DC_DBICFG_DBICOLORFMT                                                     */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB111 = 1,     /*!< DBI_FMT_RGB111 : RGB111 (3 bits/pixel)                                    */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB332 = 2,     /*!< DBI_FMT_RGB332 : RGB332 (8 bits/pixel)                                    */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB444 = 3,     /*!< DBI_FMT_RGB444 : RGB444 (12 bits/pixel)                                   */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB565 = 5,     /*!< DBI_FMT_RGB565 : RGB565 (16 bits/pixel)                                   */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB666 = 6,     /*!< DBI_FMT_RGB666 : RGB666 (18 bits/pixel)                                   */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB888 = 7,     /*!< DBI_FMT_RGB888 : RGB888 (24 bits/pixel)                                   */
} DC_DBICFG_DBICOLORFMT_Enum;

/* ========================================================  DCGPIO  ========================================================= */
/* ======================================================  LAYER0MODE  ======================================================= */
/* ==========================================  DC LAYER0MODE LAYER0DBLEND [12..15]  ========================================== */
typedef enum {                                  /*!< DC_LAYER0MODE_LAYER0DBLEND                                                */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DBLACK_BLEND = 0,/*!< LAYER0_DBLACK_BLEND : blend black                                    */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DWHITE_BLEND = 1,/*!< LAYER0_DWHITE_BLEND : blend white                                    */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALBHAS_BLEND = 2,/*!< LAYER0_DALBHAS_BLEND : blend alpha source                           */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALPHAG_BLEND = 3,/*!< LAYER0_DALPHAG_BLEND : blend alpha global                           */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALPHASG_BLEND = 4,/*!< LAYER0_DALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERT_BLEND_SRC = 5,/*!< LAYER0_DINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERT_GLOBAL_BLEND = 6,/*!< LAYER0_DINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERTSG_BLEND = 7,/*!< LAYER0_DINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALPHA_BLEND = 10,/*!< LAYER0_DALPHA_BLEND : blend alpha destination                       */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERT_BLEND_DST = 13,/*!< LAYER0_DINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER0MODE_LAYER0DBLEND_Enum;

/* ==========================================  DC LAYER0MODE LAYER0SBLEND [8..11]  =========================================== */
typedef enum {                                  /*!< DC_LAYER0MODE_LAYER0SBLEND                                                */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SBLACK_BLEND = 0,/*!< LAYER0_SBLACK_BLEND : blend black                                    */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SWHITE_BLEND = 1,/*!< LAYER0_SWHITE_BLEND : blend white                                    */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALBHAS_BLEND = 2,/*!< LAYER0_SALBHAS_BLEND : blend alpha source                           */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALPHAG_BLEND = 3,/*!< LAYER0_SALPHAG_BLEND : blend alpha global                           */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALPHASG_BLEND = 4,/*!< LAYER0_SALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERT_BLEND_SRC = 5,/*!< LAYER0_SINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERT_GLOBAL_BLEND = 6,/*!< LAYER0_SINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERTSG_BLEND = 7,/*!< LAYER0_SINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALPHA_BLEND = 10,/*!< LAYER0_SALPHA_BLEND : blend alpha destination                       */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERT_BLEND_DST = 13,/*!< LAYER0_SINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER0MODE_LAYER0SBLEND_Enum;

/* ==========================================  DC LAYER0MODE LAYER0COLMODE [0..4]  =========================================== */
typedef enum {                                  /*!< DC_LAYER0MODE_LAYER0COLMODE                                               */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_LUTBLE = 0,/*!< LAYER0CM_LUTBLE : 8-bit color palette look-up table (LUT8)              */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGBX5551 = 1,/*!< LAYER0CM_RGBX5551 : 16-bit RGBX5551 color format                      */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGBX8888 = 2,/*!< LAYER0CM_RGBX8888 : 32-bit RGBX8888 color format                      */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGB332 = 4,/*!< LAYER0CM_RGB332 : 8-bit RGB332 color format                             */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGB565 = 5,/*!< LAYER0CM_RGB565 : 16-bit RGB565 color format                            */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_XRGB8888 = 6,/*!< LAYER0CM_XRGB8888 : 32-bit XRGB8888 color format                      */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_L8 = 7,  /*!< LAYER0CM_L8 : L8 Grayscale/Palette format                                 */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RBG = 11,/*!< LAYER0CM_RBG : 24-bit RGB color format                                    */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGBA8888 = 13,/*!< LAYER0CM_RGBA8888 : 32-bit RGBA8888 color format                     */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_ARGB8888 = 14,/*!< LAYER0CM_ARGB8888 : 32-bit ARGB8888 color format                     */
  DC_LAYER0MODE_LAYER0COLMODE_TSc4     = 18,    /*!< TSc4 : TSc4 format                                                        */
  DC_LAYER0MODE_LAYER0COLMODE_TSc6     = 19,    /*!< TSc6 : TSc6 format                                                        */
  DC_LAYER0MODE_LAYER0COLMODE_TSc6A    = 20,    /*!< TSc6A : TSc6A format                                                      */
  DC_LAYER0MODE_LAYER0COLMODE_RGBA4444 = 21,    /*!< RGBA4444 : 16-bit RGBA4444 color format                                   */
  DC_LAYER0MODE_LAYER0COLMODE_ARGB4444 = 24,    /*!< ARGB4444 : 16-bit ARGB4444 color format                                   */
} DC_LAYER0MODE_LAYER0COLMODE_Enum;

/* =====================================================  LAYER0STARTXY  ===================================================== */
/* =====================================================  LAYER0SIZEXY  ====================================================== */
/* ======================================================  LAYER0ADDR  ======================================================= */
/* =====================================================  LAYER0STRIDE  ====================================================== */
/* ======================================  DC LAYER0STRIDE LAYER0AXIFIFOTHLD [19..20]  ======================================= */
typedef enum {                                  /*!< DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD                                         */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_HALF_SZ = 0,/*!< LAYER0_BURST_HALF_SZ : half fifo (default)                   */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_2 = 1,/*!< LAYER0_BURST_2 : 2 burst-size                                      */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_4 = 2,/*!< LAYER0_BURST_4 : 4 burst-size                                      */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_8 = 3,/*!< LAYER0_BURST_8 : 8 burst-size                                      */
} DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_Enum;

/* ======================================  DC LAYER0STRIDE LAYER0AXIBURSTBITS [16..18]  ====================================== */
typedef enum {                                  /*!< DC_LAYER0STRIDE_LAYER0AXIBURSTBITS                                        */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_DEF = 0,/*!< LAYER0_BEATS_DEF : 16-beats (default)                           */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_2 = 1,/*!< LAYER0_BEATS_2 : 2-beats                                          */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_4 = 2,/*!< LAYER0_BEATS_4 : 4-beats                                          */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_16 = 4,/*!< LAYER0_BEATS_16 : 16-beats                                       */
} DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_Enum;

/* ======================================================  LAYER0RESXY  ====================================================== */
/* ========================================================  DBICMD  ========================================================= */
/* ========================================================  DBIRDAT  ======================================================== */
/* =========================================================  CONFG  ========================================================= */
/* =======================================================  INTERRUPT  ======================================================= */
/* ===========================================  DC INTERRUPT INTTRIGGER [31..31]  ============================================ */
typedef enum {                                  /*!< DC_INTERRUPT_INTTRIGGER                                                   */
  DC_INTERRUPT_INTTRIGGER_LEVEL        = 1,     /*!< LEVEL : Level triggering is enabled                                       */
  DC_INTERRUPT_INTTRIGGER_EDGE         = 0,     /*!< EDGE : Edge triggering is enabled                                         */
} DC_INTERRUPT_INTTRIGGER_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ========================================================  COLMOD  ========================================================= */
/* =================================================  LAYER0COLORDECSTARTXY  ================================================= */
/* ===================================================  LAYER0COLORFORMAT  =================================================== */
/* =====================================================  LAYERPARTIAL  ====================================================== */
/* ========================================================  MIPCFG1  ======================================================== */
/* ========================================================  MIPCFG2  ======================================================== */
/* ========================================================  MIPCFG3  ======================================================== */
/* ======================================================  MIPPARTIAL  ======================================================= */
/* =======================================================  IPVERSION  ======================================================= */
/* ==========================================================  CRC  ========================================================== */
/* =======================================================  FORMATTRL  ======================================================= */
/* ======================================================  FORMATTRL2  ======================================================= */
/* =======================================================  CLKCTRLCG  ======================================================= */
/* ======================================================  FORMATTRL3  ======================================================= */
/* =========================================================  L0LUT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            DSI                                            ================ */
/* =========================================================================================================================== */

