zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ======================================================  DEVICEREADY  ====================================================== */
/* ==============================================  DSI DEVICEREADY ULPS [1..2]  ============================================== */
typedef enum {                                  /*!< DSI_DEVICEREADY_ULPS                                                      */
  DSI_DEVICEREADY_ULPS_LOW_POWER       = 2,     /*!< LOW_POWER : This pattern is set by the processor to inform that
                                                     entire DSI host is to be put on ultra low power [POWER
                                                     SAVING] mode 01 - This pattern is set by the processor
                                                     to inform                                                                 */
  DSI_DEVICEREADY_ULPS_EXIT            = 1,     /*!< EXIT : This pattern is set by the processor to inform that entire
                                                     DSI host is to be pu on ultr low power EXIT mode                          */
  DSI_DEVICEREADY_ULPS_This            = 0,     /*!< This : pattern is set by the processor to make the DSI host
                                                     come out of the wakeup time and resume the normal operation
                                                     if the DSI Host already remains in the ULPS exit state.
                                                     S/W needs to ensure that there is a minimum of 1ms time
                                                     available before clearing the UPLS exit State. 1(a). In
                                                     DPI Only Mode: No DPI traffic should be sent after the
                                                     above patterns like 10 or 01 is set in this register. Device_ready
                                                     bit in Device Ready register should not be disturbed or
                                                     should remain set while the device is subjected to ULPS
                                                     states. 1(b). In Dual Display Mode: DPI Interface has to
                                                     be disabled and also no DBI traffic should be sent after
                                                     the above patterns like 10 or 01 is set in this register.
                                                     Device_ready bit in Device Ready register should not be
                                                     disturbed or should remain set while the device is subjected
                                                     to ULPS states.                                                           */
} DSI_DEVICEREADY_ULPS_Enum;

/* =============================================  DSI DEVICEREADY READY [0..0]  ============================================== */
typedef enum {                                  /*!< DSI_DEVICEREADY_READY                                                     */
  DSI_DEVICEREADY_READY_PROGRAMMED     = 1,     /*!< PROGRAMMED : Set to 1 after dphy_parameter register, all the
                                                     count registers, and timeout and interrupt enable registers
                                                     are being programmed.                                                     */
  DSI_DEVICEREADY_READY_READY          = 0,     /*!< READY : Set by the processor to inform that device is ready
                                                     for transmission. This register should be set to 1 after
                                                     dphy_parameter register, all the count registers, and timeout
                                                     and interrupt enable registers are being programmed. Note:
                                                     Reprogramming the registers by resetting the device_ready
                                                     bit results in re-enumeration of the DSI controller from
                                                     the power up sequence.                                                    */
} DSI_DEVICEREADY_READY_Enum;

/* =======================================================  INTRSTAT  ======================================================== */
/* ========================================================  INTREN  ========================================================= */
/* ======================================================  DSIFUNCPRG  ======================================================= */
/* ============================================  DSI DSIFUNCPRG REGNAME [13..15]  ============================================ */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_REGNAME                                                    */
  DSI_DSIFUNCPRG_REGNAME_command       = 0,     /*!< command : mode is not supported]                                          */
  DSI_DSIFUNCPRG_REGNAME_16BIT0        = 1,     /*!< 16BIT0 : 16 bit data                                                      */
  DSI_DSIFUNCPRG_REGNAME_9BIT          = 2,     /*!< 9BIT : 9 bit data                                                         */
  DSI_DSIFUNCPRG_REGNAME_8BIT          = 3,     /*!< 8BIT : 8 bit data                                                         */
  DSI_DSIFUNCPRG_REGNAME_16BIT1        = 4,     /*!< 16BIT1 : 16 bit mode (option 1)                                           */
} DSI_DSIFUNCPRG_REGNAME_Enum;

/* ==========================================  DSI DSIFUNCPRG SUPCOLVIDMODE [7..9]  ========================================== */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_SUPCOLVIDMODE                                              */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE0 = 0,   /*!< FMTVMODE0 : Video mode is not supported                                   */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE1 = 1,   /*!< FMTVMODE1 : RGB565 or 16-bit format                                       */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE2 = 2,   /*!< FMTVMODE2 : RGB666 or 18-bit format                                       */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE3 = 3,   /*!< FMTVMODE3 : RGB 666 loosely packed format                                 */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE4 = 4,   /*!< FMTVMODE4 : RGB888 or 24-bit format                                       */
} DSI_DSIFUNCPRG_SUPCOLVIDMODE_Enum;

/* ===========================================  DSI DSIFUNCPRG CHNUMCMODE [5..6]  ============================================ */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_CHNUMCMODE                                                 */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH0      = 0,     /*!< VCCH0 : Virtual command mode channel 0                                    */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH1      = 1,     /*!< VCCH1 : Virtual command mode channel 1                                    */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH2      = 2,     /*!< VCCH2 : Virtual command mode channel 2                                    */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH3      = 3,     /*!< VCCH3 : Virtual command mode channel 3                                    */
} DSI_DSIFUNCPRG_CHNUMCMODE_Enum;

/* =============================================  DSI DSIFUNCPRG CHNUMVM [3..4]  ============================================= */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_CHNUMVM                                                    */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH0         = 0,     /*!< VVCH0 : Virtual video mode channel 0                                      */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH1         = 1,     /*!< VVCH1 : Virtual video mode channel 1                                      */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH2         = 2,     /*!< VVCH2 : Virtual video mode channel 2                                      */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH3         = 3,     /*!< VVCH3 : Virtual video mode channel 3                                      */
} DSI_DSIFUNCPRG_CHNUMVM_Enum;

/* ============================================  DSI DSIFUNCPRG DATALANES [0..2]  ============================================ */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_DATALANES                                                  */
  DSI_DSIFUNCPRG_DATALANES_DATAL0      = 0,     /*!< DATAL0 : FIXME - enum description needed here.                            */
  DSI_DSIFUNCPRG_DATALANES_DATAL1      = 1,     /*!< DATAL1 : One data lane                                                    */
  DSI_DSIFUNCPRG_DATALANES_DATAL2      = 2,     /*!< DATAL2 : Two data lane                                                    */
  DSI_DSIFUNCPRG_DATALANES_DATAL3      = 3,     /*!< DATAL3 : Three data lane                                                  */
  DSI_DSIFUNCPRG_DATALANES_DATAL4      = 4,     /*!< DATAL4 : Four data lane                                                   */
} DSI_DSIFUNCPRG_DATALANES_Enum;

