zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ======================================================  HSTXTIMEOUT  ====================================================== */
/* ========================================================  LPRXTO  ========================================================= */
/* ======================================================  TURNARNDTO  ======================================================= */
/* ===================================================  DEVICERESETTIMER  ==================================================== */
/* =====================================================  DPIRESOLUTION  ===================================================== */
/* =======================================================  HSYNCCNT  ======================================================== */
/* ====================================================  HORIZBKPORCHCNT  ==================================================== */
/* ====================================================  HORIZFPORCHCNT  ===================================================== */
/* ===================================================  HORZACTIVEAREACNT  =================================================== */
/* =======================================================  VSYNCCNT  ======================================================== */
/* ====================================================  VERTBKPORCHCNT  ===================================================== */
/* =====================================================  VERTFPORCHCNT  ===================================================== */
/* ===================================================  DATALANEHILOSWCNT  =================================================== */
/* ==========================================================  DPI  ========================================================== */
/* ======================================================  PLLLOCKCNT  ======================================================= */
/* ========================================================  INITCNT  ======================================================== */
/* =====================================================  MAXRETPACSZE  ====================================================== */
/* =====================================================  VIDEOMODEFMT  ====================================================== */
/* ===========================================  DSI VIDEOMODEFMT VIDEMDFMT [0..1]  =========================================== */
typedef enum {                                  /*!< DSI_VIDEOMODEFMT_VIDEMDFMT                                                */
  DSI_VIDEOMODEFMT_VIDEMDFMT_FIXME_ENUM = 0,    /*!< FIXME_ENUM : FIXME - enum description needed here.                        */
  DSI_VIDEOMODEFMT_VIDEMDFMT_NONBURSTPULSE = 1, /*!< NONBURSTPULSE : Non Burst Mode with Sync Pulse                            */
  DSI_VIDEOMODEFMT_VIDEMDFMT_NONBURSTEVENTS = 2,/*!< NONBURSTEVENTS : Non Burst Mode with Sync events                          */
  DSI_VIDEOMODEFMT_VIDEMDFMT_BURST     = 3,     /*!< BURST : MODE Burst Mode                                                   */
} DSI_VIDEOMODEFMT_VIDEMDFMT_Enum;

/* ========================================================  CLKEOT  ========================================================= */
/* =======================================================  POLARITY  ======================================================== */
/* ===============================================  DSI POLARITY PBITS [0..3]  =============================================== */
typedef enum {                                  /*!< DSI_POLARITY_PBITS                                                        */
  DSI_POLARITY_PBITS_POLV              = 0,     /*!< POLV : polarity for Vsync                                                 */
  DSI_POLARITY_PBITS_POLH              = 1,     /*!< POLH : Polarity for Hsync                                                 */
  DSI_POLARITY_PBITS_POLSD             = 2,     /*!< POLSD : Polarity for shut down                                            */
  DSI_POLARITY_PBITS_POLCM             = 3,     /*!< POLCM : Polarity for Color mode                                           */
} DSI_POLARITY_PBITS_Enum;

/* ======================================================  CLKLANESWT  ======================================================= */
/* =======================================================  LPBYTECLK  ======================================================= */
/* =======================================================  DPHYPARAM  ======================================================= */
/* ====================================================  CLKLANETIMPARM  ===================================================== */
/* =======================================================  RSTENBDFE  ======================================================= */
/* =======================================================  AFETRIM0  ======================================================== */
/* =======================================================  AFETRIM1  ======================================================== */
/* =======================================================  AFETRIM2  ======================================================== */
/* =======================================================  AFETRIM3  ======================================================== */
/* =====================================================  ERRORAUTORCOV  ===================================================== */
/* ====================================================  MIPIDIRDPIDIFF  ===================================================== */
/* ==========================================  DSI MIPIDIRDPIDIFF DPIHIGH [15..15]  ========================================== */
typedef enum {                                  /*!< DSI_MIPIDIRDPIDIFF_DPIHIGH                                                */
  DSI_MIPIDIRDPIDIFF_DPIHIGH_LESSTHAN  = 0,     /*!< LESSTHAN : one line time in DPI is less than to DSI line time             */
  DSI_MIPIDIRDPIDIFF_DPIHIGH_GREATER   = 1,     /*!< GREATER : one line time in DPI is greater than or equal to DSI
                                                     line time                                                                 */
} DSI_MIPIDIRDPIDIFF_DPIHIGH_Enum;

/* ===========================================  DSI MIPIDIRDPIDIFF MIPIDIR [0..0]  =========================================== */
typedef enum {                                  /*!< DSI_MIPIDIRDPIDIFF_MIPIDIR                                                */
  DSI_MIPIDIRDPIDIFF_MIPIDIR_CONTROL   = 0,     /*!< CONTROL : DSI Host has the control over MIPI bus                          */
  DSI_MIPIDIRDPIDIFF_MIPIDIR_RECEIVE   = 1,     /*!< RECEIVE : DSI Host is in Receive mode                                     */
} DSI_MIPIDIRDPIDIFF_MIPIDIR_Enum;

