zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ===========================================  GPIO PINCFG107 NCESRC107 [16..20]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG107_NCESRC107                                                  */
  GPIO_PINCFG107_NCESRC107_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG107_NCESRC107_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG107_NCESRC107_DC_DPI_DE   = 24,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG107_NCESRC107_DISP_CONT_CSX = 25,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG107_NCESRC107_DC_SPI_CS_N = 26,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG107_NCESRC107_DC_QSPI_CS_N = 27,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG107_NCESRC107_DC_RESX     = 28,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG107_NCESRC107_Enum;

/* ==========================================  GPIO PINCFG107 PULLCFG107 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG107_PULLCFG107                                                 */
  GPIO_PINCFG107_PULLCFG107_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG107_PULLCFG107_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG107_PULLCFG107_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG107_PULLCFG107_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG107_PULLCFG107_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG107_PULLCFG107_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG107_PULLCFG107_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG107_PULLCFG107_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG107_PULLCFG107_Enum;

/* =============================================  GPIO PINCFG107 DS107 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG107_DS107                                                      */
  GPIO_PINCFG107_DS107_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG107_DS107_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
  GPIO_PINCFG107_DS107_0P75X           = 2,     /*!< 0P75X : 0.75x output driver selected                                      */
  GPIO_PINCFG107_DS107_1P0X            = 3,     /*!< 1P0X : 1.0x output driver selected                                        */
} GPIO_PINCFG107_DS107_Enum;

