zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =============================================  I2S0 I2SDATACFG WDLEN1 [5..7]  ============================================= */
typedef enum {                                  /*!< I2S0_I2SDATACFG_WDLEN1                                                    */
  I2S0_I2SDATACFG_WDLEN1_8b            = 0,     /*!< 8b : Receive channel length is 8 bits for phase 1.                        */
  I2S0_I2SDATACFG_WDLEN1_12b           = 1,     /*!< 12b : Receive channel length is 12 bits for phase 1.                      */
  I2S0_I2SDATACFG_WDLEN1_16b           = 2,     /*!< 16b : Receive channel length is 16 bits for phase 1.                      */
  I2S0_I2SDATACFG_WDLEN1_20b           = 3,     /*!< 20b : Receive channel length is 20 bits for phase 1.                      */
  I2S0_I2SDATACFG_WDLEN1_24b           = 4,     /*!< 24b : Receive channel length is 24 bits for phase 1.                      */
  I2S0_I2SDATACFG_WDLEN1_32b           = 5,     /*!< 32b : Receive channel length is 32 bits for phase 1.                      */
} I2S0_I2SDATACFG_WDLEN1_Enum;

/* ==============================================  I2S0 I2SDATACFG SSZ1 [0..2]  ============================================== */
typedef enum {                                  /*!< I2S0_I2SDATACFG_SSZ1                                                      */
  I2S0_I2SDATACFG_SSZ1_8b              = 0,     /*!< 8b : Receive audio sample length is 8 bits for phase 1.                   */
  I2S0_I2SDATACFG_SSZ1_12b             = 1,     /*!< 12b : Receive audio sample length is 12 bits for phase 1.                 */
  I2S0_I2SDATACFG_SSZ1_16b             = 2,     /*!< 16b : Receive audio sample length is 16 bits for phase 1.                 */
  I2S0_I2SDATACFG_SSZ1_20b             = 3,     /*!< 20b : Receive audio sample length is 20 bits for phase 1.                 */
  I2S0_I2SDATACFG_SSZ1_24b             = 4,     /*!< 24b : Receive audio sample length is 24 bits for phase 1.                 */
  I2S0_I2SDATACFG_SSZ1_32b             = 5,     /*!< 32b : Receive audio sample length is 32 bits for phase 1.                 */
} I2S0_I2SDATACFG_SSZ1_Enum;

/* =======================================================  I2SIOCFG  ======================================================== */
/* ========================================================  I2SCTL  ========================================================= */
/* ========================================================  IPBIRPT  ======================================================== */
/* =======================================================  IPCOREID  ======================================================== */
/* ========================================================  AMQCFG  ========================================================= */
/* ========================================================  INTDIV  ========================================================= */
/* ========================================================  FRACDIV  ======================================================== */
/* ========================================================  CLKCFG  ========================================================= */
/* ========================================================  DMACFG  ========================================================= */
/* ==============================================  I2S0 DMACFG TXDMAPRI [5..5]  ============================================== */
typedef enum {                                  /*!< I2S0_DMACFG_TXDMAPRI                                                      */
  I2S0_DMACFG_TXDMAPRI_LOW             = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  I2S0_DMACFG_TXDMAPRI_HIGH            = 1,     /*!< HIGH : High Priority (service immediately)                                */
} I2S0_DMACFG_TXDMAPRI_Enum;

/* ==============================================  I2S0 DMACFG TXDMAEN [4..4]  =============================================== */
typedef enum {                                  /*!< I2S0_DMACFG_TXDMAEN                                                       */
  I2S0_DMACFG_TXDMAEN_DIS              = 0,     /*!< DIS : Disable TXDMA Function                                              */
  I2S0_DMACFG_TXDMAEN_EN               = 1,     /*!< EN : Enable TXDMA Function                                                */
} I2S0_DMACFG_TXDMAEN_Enum;

/* ==============================================  I2S0 DMACFG RXDMAPRI [1..1]  ============================================== */
typedef enum {                                  /*!< I2S0_DMACFG_RXDMAPRI                                                      */
  I2S0_DMACFG_RXDMAPRI_LOW             = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  I2S0_DMACFG_RXDMAPRI_HIGH            = 1,     /*!< HIGH : High Priority (service immediately)                                */
} I2S0_DMACFG_RXDMAPRI_Enum;

/* ==============================================  I2S0 DMACFG RXDMAEN [0..0]  =============================================== */
typedef enum {                                  /*!< I2S0_DMACFG_RXDMAEN                                                       */
  I2S0_DMACFG_RXDMAEN_DIS              = 0,     /*!< DIS : Disable RXDMA Function                                              */
  I2S0_DMACFG_RXDMAEN_EN               = 1,     /*!< EN : Enable RXDMA Function                                                */
} I2S0_DMACFG_RXDMAEN_Enum;

/* ======================================================  RXDMATOTCNT  ====================================================== */
/* =======================================================  RXDMAADDR  ======================================================= */
/* =======================================================  RXDMASTAT  ======================================================= */
/* ======================================================  TXDMATOTCNT  ====================================================== */
/* =======================================================  TXDMAADDR  ======================================================= */
/* =======================================================  TXDMASTAT  ======================================================= */
/* =====================================================  DMAENNEXTCTRL  ===================================================== */
/* ====================================================  RXDMATOTCNTNEXT  ==================================================== */
/* =====================================================  RXDMAADDRNEXT  ===================================================== */
/* ====================================================  TXDMATOTCNTNEXT  ==================================================== */
/* =====================================================  TXDMAADDRNEXT  ===================================================== */
/* ========================================================  STATUS  ========================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            I3C                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  HCIVERSION  ======================================================= */
/* =======================================================  HCCONTROL  ======================================================= */
/* ======================================================  DEVICEADDR  ======================================================= */
/* ====================================================  HCCAPABILITIES  ===================================================== */
/* =======================================================  RESETCTRL  ======================================================= */
/* =====================================================  PRESENTSTATE  ====================================================== */
/* ======================================================  INTRSTATUS  ======================================================= */
/* ===================================================  INTRSTATUSENABLE  ==================================================== */
/* ===================================================  INTRSIGNALENABLE  ==================================================== */
/* =======================================================  INTRFORCE  ======================================================= */
/* ===================================================  DATSECTIONOFFSET  ==================================================== */
/* ===================================================  DCTSECTIONOFFSET  ==================================================== */
/* ===============================================  RINGHEADERSSECTIONOFFSET  ================================================ */
/* ===================================================  PIOSECTIONOFFSET  ==================================================== */
/* =================================================  EXTCAPSSECTIONOFFSET  ================================================== */
/* =====================================================  INTCTRLCMDSEN  ===================================================== */
/* =====================================================  IBINOTIFYCTRL  ===================================================== */
/* =========================================================  DAT0  ========================================================== */
/* =========================================================  DAT1  ========================================================== */
/* =========================================================  DCT0  ========================================================== */
/* =========================================================  DCT1  ========================================================== */
/* =========================================================  DCT2  ========================================================== */
/* =========================================================  DCT3  ========================================================== */
/* ===================================================  COMMANDQUEUEPORT  ==================================================== */
/* ===================================================  RESPONSEQUEUEPORT  =================================================== */
/* =====================================================  XFERDATAPORT  ====================================================== */
/* ========================================================  IBIPORT  ======================================================== */
/* =====================================================  QUEUETHLDCTRL  ===================================================== */
/* ==================================================  DATABUFFERTHLDCTRL  =================================================== */
/* =====================================================  QUEUESIZECTRL  ===================================================== */
/* =====================================================  PIOINTRSTATUS  ===================================================== */
/* ==================================================  PIOINTRSTATUSENABLE  ================================================== */
/* ==================================================  PIOINTRSIGNALENABLE  ================================================== */
/* =====================================================  PIOINTRFORCE  ====================================================== */
/* ======================================================  RHSCONTROL  ======================================================= */
/* =======================================================  RH0OFFSET  ======================================================= */
/* =======================================================  RH1OFFSET  ======================================================= */
/* =======================================================  RH2OFFSET  ======================================================= */
/* =======================================================  RH3OFFSET  ======================================================= */
/* ========================================================  CRSETUP  ======================================================== */
/* =======================================================  IBISETUP  ======================================================== */
/* =====================================================  CHUNKCONTROL  ====================================================== */
/* =====================================================  RHINTRSTATUS  ====================================================== */
/* ==================================================  RHINTRSTATUSENABLE  =================================================== */
/* ==================================================  RHINTRSIGNALENABLE  =================================================== */
/* ======================================================  RHINTRFORCE  ====================================================== */
/* =======================================================  RHSTATUS  ======================================================== */
/* =======================================================  RHCONTROL  ======================================================= */
/* =====================================================  RHOPERATION1  ====================================================== */
/* =====================================================  RHOPERATION2  ====================================================== */
/* ====================================================  RHCMDRINGBASELO  ==================================================== */
/* ====================================================  RHCMDRINGBASEHI  ==================================================== */
/* ===================================================  RHRESPRINGBASELO  ==================================================== */
/* ===================================================  RHRESPRINGBASEHI  ==================================================== */
/* =================================================  RHIBISTATUSRINGBASELO  ================================================= */
/* =================================================  RHIBISTATUSRINGBASEHI  ================================================= */
/* ==================================================  RHIBIDATARINGBASELO  ================================================== */
/* ==================================================  RHIBIDATARINGBASEHI  ================================================== */
/* =====================================================  EXTCAPHEADER  ====================================================== */
/* ===================================================  COMPMANUFACTURER  ==================================================== */
/* ======================================================  COMPVERSION  ====================================================== */
/* =======================================================  COMPTYPE  ======================================================== */
/* =====================================================  MASTERCONFIG  ====================================================== */
/* ===================================================  I2CURD1SCLLOWCNT  ==================================================== */
/* ===================================================  I2CURD1SCLHIGHCNT  =================================================== */
/* ===================================================  I2CURD2SCLLOWCNT  ==================================================== */
/* ===================================================  I2CURD2SCLHIGHCNT  =================================================== */
/* ===================================================  I2CURD3SCLLOWCNT  ==================================================== */
/* ===================================================  I2CURD3SCLHIGHCNT  =================================================== */


/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  FIFO  ========================================================== */
/* ========================================================  FIFOPTR  ======================================================== */
/* ========================================================  FIFOTHR  ======================================================== */
/* ========================================================  FIFOPOP  ======================================================== */
/* =======================================================  FIFOPUSH  ======================================================== */
/* =======================================================  FIFOCTRL  ======================================================== */
/* ========================================================  FIFOLOC  ======================================================== */
/* ========================================================  CLKCFG  ========================================================= */
/* ==============================================  IOM0 CLKCFG DIVEN [13..13]  =============================================== */
typedef enum {                                  /*!< IOM0_CLKCFG_DIVEN                                                         */
  IOM0_CLKCFG_DIVEN_DIS                = 0,     /*!< DIS : Disable TOTPER division.                                            */
  IOM0_CLKCFG_DIVEN_EN                 = 1,     /*!< EN : Enable TOTPER division.                                              */
} IOM0_CLKCFG_DIVEN_Enum;

/* ===============================================  IOM0 CLKCFG DIV3 [12..12]  =============================================== */
typedef enum {                                  /*!< IOM0_CLKCFG_DIV3                                                          */
  IOM0_CLKCFG_DIV3_DIS                 = 0,     /*!< DIS : Select divide by 1.                                                 */
  IOM0_CLKCFG_DIV3_EN                  = 1,     /*!< EN : Select divide by 3.                                                  */
} IOM0_CLKCFG_DIV3_Enum;

