zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  IOSLAVEFD0 DMACFG PADBYTEEN [24..24]  ========================================== */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_PADBYTEEN                                               */
  IOSLAVEFD0_DMACFG_PADBYTEEN_DIS      = 0,     /*!< DIS : Disable PAD Byte Function                                           */
  IOSLAVEFD0_DMACFG_PADBYTEEN_EN       = 1,     /*!< EN : Enable PAD Byte Function                                             */
} IOSLAVEFD0_DMACFG_PADBYTEEN_Enum;

/* ==========================================  IOSLAVEFD0 DMACFG DMAQUAD [10..10]  =========================================== */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMAQUAD                                                 */
  IOSLAVEFD0_DMACFG_DMAQUAD_SINGLE     = 0,     /*!< SINGLE : Transfer one word per DMA request                                */
  IOSLAVEFD0_DMACFG_DMAQUAD_QUAD       = 1,     /*!< QUAD : Transfer up to four words per DMA request                          */
} IOSLAVEFD0_DMACFG_DMAQUAD_Enum;

/* ===========================================  IOSLAVEFD0 DMACFG DPWROFF [9..9]  ============================================ */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DPWROFF                                                 */
  IOSLAVEFD0_DMACFG_DPWROFF_DIS        = 0,     /*!< DIS : Power off disabled                                                  */
  IOSLAVEFD0_DMACFG_DPWROFF_EN         = 1,     /*!< EN : Power off enabled                                                    */
} IOSLAVEFD0_DMACFG_DPWROFF_Enum;

/* ============================================  IOSLAVEFD0 DMACFG DMAPRI [8..8]  ============================================ */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMAPRI                                                  */
  IOSLAVEFD0_DMACFG_DMAPRI_LOW         = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  IOSLAVEFD0_DMACFG_DMAPRI_HIGH        = 1,     /*!< HIGH : High Priority (service immediately)                                */
} IOSLAVEFD0_DMACFG_DMAPRI_Enum;

/* ============================================  IOSLAVEFD0 DMACFG DMADIR [1..1]  ============================================ */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMADIR                                                  */
  IOSLAVEFD0_DMACFG_DMADIR_P2M         = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction. To be set when
                                                     doing DMA read operations, ie reading data from external
                                                     devices.                                                                  */
  IOSLAVEFD0_DMACFG_DMADIR_M2P         = 1,     /*!< M2P : Memory to Peripheral transaction. To be set when doing
                                                     DMA write operations, ie writing data to external devices.                */
} IOSLAVEFD0_DMACFG_DMADIR_Enum;

/* ============================================  IOSLAVEFD0 DMACFG DMAEN [0..0]  ============================================= */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMAEN                                                   */
  IOSLAVEFD0_DMACFG_DMAEN_DIS          = 0,     /*!< DIS : Disable DMA Function                                                */
  IOSLAVEFD0_DMACFG_DMAEN_EN           = 1,     /*!< EN : Enable DMA Function                                                  */
} IOSLAVEFD0_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ======================================================  REGACCINTEN  ====================================================== */
/* =====================================================  REGACCINTSTAT  ===================================================== */
/* =====================================================  REGACCINTCLR  ====================================================== */
/* =====================================================  REGACCINTSET  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CHIPPN  ========================================================= */
/* ==============================================  MCUCTRL CHIPPN PN [24..31]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PN                                                         */
  MCUCTRL_CHIPPN_PN_APOLLO330P_510L    = 17,    /*!< APOLLO330P_510L : Apollo330P_510L part number is 0x11xxxxxx.              */
  MCUCTRL_CHIPPN_PN_APOLLO5            = 16,    /*!< APOLLO5 : Apollo510 part number is 0x10xxxxxx.                            */
} MCUCTRL_CHIPPN_PN_Enum;

/* ============================================  MCUCTRL CHIPPN DEVTYPE [23..23]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_DEVTYPE                                                    */
  MCUCTRL_CHIPPN_DEVTYPE_510L          = 0,     /*!< 510L : This device identifies as 510L.                                    */
  MCUCTRL_CHIPPN_DEVTYPE_330P          = 1,     /*!< 330P : This device identifies as 330P.                                    */
} MCUCTRL_CHIPPN_DEVTYPE_Enum;

/* ===========================================  MCUCTRL CHIPPN MRAMSIZE [20..22]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_MRAMSIZE                                                   */
  MCUCTRL_CHIPPN_MRAMSIZE_1MB          = 0,     /*!< 1MB : MRAM size is 1.0MB                                                  */
  MCUCTRL_CHIPPN_MRAMSIZE_2MB          = 1,     /*!< 2MB : MRAM size is 2.0MB                                                  */
  MCUCTRL_CHIPPN_MRAMSIZE_3MB          = 2,     /*!< 3MB : MRAM size is 3.0MB                                                  */
  MCUCTRL_CHIPPN_MRAMSIZE_4MB          = 3,     /*!< 4MB : MRAM size is 4.0MB                                                  */
} MCUCTRL_CHIPPN_MRAMSIZE_Enum;

