zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ===========================================  MCUCTRL CHIPPN SRAMSIZE [16..19]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_SRAMSIZE                                                   */
  MCUCTRL_CHIPPN_SRAMSIZE_256K_1M      = 0,     /*!< 256K_1M : Memory size is 256KB DTCM + 1MB SSRAM                           */
  MCUCTRL_CHIPPN_SRAMSIZE_256K_1P75M   = 1,     /*!< 256K_1P75M : Memory size is 256KB DTCM + 1.75MB SSRAM                     */
  MCUCTRL_CHIPPN_SRAMSIZE_256K_512K_2M = 2,     /*!< 256K_512K_2M : Memory size is 256KB ITCM + 512KB DTCM + 2MB
                                                     SSRAM                                                                     */
  MCUCTRL_CHIPPN_SRAMSIZE_256K_512K_3M = 3,     /*!< 256K_512K_3M : Memory size is 256KB ITCM + 512KB DTCM + 3MB
                                                     SSRAM                                                                     */
} MCUCTRL_CHIPPN_SRAMSIZE_Enum;

/* ============================================  MCUCTRL CHIPPN REVMAJ [12..15]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_REVMAJ                                                     */
  MCUCTRL_CHIPPN_REVMAJ_A              = 0,     /*!< A : Major Rev A                                                           */
  MCUCTRL_CHIPPN_REVMAJ_B              = 1,     /*!< B : Major Rev B                                                           */
} MCUCTRL_CHIPPN_REVMAJ_Enum;

/* =============================================  MCUCTRL CHIPPN REVMIN [8..11]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_REVMIN                                                     */
  MCUCTRL_CHIPPN_REVMIN_REV0           = 0,     /*!< REV0 : Minor Rev 0                                                        */
  MCUCTRL_CHIPPN_REVMIN_REV1           = 1,     /*!< REV1 : Minor Rev 1                                                        */
} MCUCTRL_CHIPPN_REVMIN_Enum;

/* ===============================================  MCUCTRL CHIPPN PKG [6..7]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PKG                                                        */
  MCUCTRL_CHIPPN_PKG_SIP               = 0,     /*!< SIP : SIP package.                                                        */
  MCUCTRL_CHIPPN_PKG_QFN               = 1,     /*!< QFN : QFN package.                                                        */
  MCUCTRL_CHIPPN_PKG_BGA               = 2,     /*!< BGA : BGA package.                                                        */
  MCUCTRL_CHIPPN_PKG_CSP               = 3,     /*!< CSP : CSP package.                                                        */
} MCUCTRL_CHIPPN_PKG_Enum;

/* ==============================================  MCUCTRL CHIPPN PINS [3..5]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PINS                                                       */
  MCUCTRL_CHIPPN_PINS_231              = 0,     /*!< 231 : 231 pins                                                            */
  MCUCTRL_CHIPPN_PINS_274              = 1,     /*!< 274 : 274 pins                                                            */
} MCUCTRL_CHIPPN_PINS_Enum;

/* ==============================================  MCUCTRL CHIPPN TEMP [1..2]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_TEMP                                                       */
  MCUCTRL_CHIPPN_TEMP_COM              = 0,     /*!< COM : Commercial temperature                                              */
  MCUCTRL_CHIPPN_TEMP_MIL              = 1,     /*!< MIL : Military temperature                                                */
  MCUCTRL_CHIPPN_TEMP_AUTO             = 2,     /*!< AUTO : Automotive temperature                                             */
  MCUCTRL_CHIPPN_TEMP_IND              = 3,     /*!< IND : Industrial temperature                                              */
} MCUCTRL_CHIPPN_TEMP_Enum;

/* ========================================================  CHIPID0  ======================================================== */
/* ========================================================  CHIPID1  ======================================================== */
/* ========================================================  CHIPREV  ======================================================== */
/* =============================================  MCUCTRL CHIPREV REVMAJ [4..7]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPREV_REVMAJ                                                    */
  MCUCTRL_CHIPREV_REVMAJ_C             = 3,     /*!< C : Apollo510 revision C                                                  */
  MCUCTRL_CHIPREV_REVMAJ_B             = 2,     /*!< B : Apollo510 revision B                                                  */
  MCUCTRL_CHIPREV_REVMAJ_A             = 1,     /*!< A : Apollo510 revision A                                                  */
} MCUCTRL_CHIPREV_REVMAJ_Enum;

/* =============================================  MCUCTRL CHIPREV REVMIN [0..3]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPREV_REVMIN                                                    */
  MCUCTRL_CHIPREV_REVMIN_REV2          = 3,     /*!< REV2 : Apollo510 minor rev 2.                                             */
  MCUCTRL_CHIPREV_REVMIN_REV1          = 2,     /*!< REV1 : Apollo510 minor rev 1.                                             */
  MCUCTRL_CHIPREV_REVMIN_REV0          = 1,     /*!< REV0 : Apollo510 minor rev 0. Minor revision value, succeeding
                                                     minor revisions will increment from this value.                           */
} MCUCTRL_CHIPREV_REVMIN_Enum;

/* =======================================================  VENDORID  ======================================================== */
/* ===========================================  MCUCTRL VENDORID VENDORID [0..31]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_VENDORID_VENDORID                                                 */
  MCUCTRL_VENDORID_VENDORID_AMBIQ      = 1095582289,/*!< AMBIQ : Ambiq Vendor ID 'AMBQ'                                        */
  MCUCTRL_VENDORID_VENDORID_DEFAULT    = 0,     /*!< DEFAULT : Default Vendor ID                                               */
} MCUCTRL_VENDORID_VENDORID_Enum;

/* ==========================================================  SKU  ========================================================== */
/* ===========================================  MCUCTRL SKU SKUCM4DEBUG [22..22]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUCM4DEBUG                                                   */
  MCUCTRL_SKU_SKUCM4DEBUG_AMBIQ        = 0,     /*!< AMBIQ : Closed/Ambiq only access                                          */
  MCUCTRL_SKU_SKUCM4DEBUG_RESERVEDVALUE = 1,    /*!< RESERVEDVALUE : This is a reserved value.                                 */
} MCUCTRL_SKU_SKUCM4DEBUG_Enum;

/* ==============================================  MCUCTRL SKU SKUMVE [20..21]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUMVE                                                        */
  MCUCTRL_SKU_SKUMVE_NO_MVE            = 0,     /*!< NO_MVE : No MVE.                                                          */
  MCUCTRL_SKU_SKUMVE_INT_MVE           = 1,     /*!< INT_MVE : Integer MVE only.                                               */
  MCUCTRL_SKU_SKUMVE_INTFP_MVE         = 2,     /*!< INTFP_MVE : Integer and floating point MVE support. Note that
                                                     with this setting, FPU must be enabled.                                   */
} MCUCTRL_SKU_SKUMVE_Enum;

/* ==============================================  MCUCTRL SKU SKUFPU [19..19]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUFPU                                                        */
  MCUCTRL_SKU_SKUFPU_NO_FPU            = 0,     /*!< NO_FPU : FPU not available.                                               */
  MCUCTRL_SKU_SKUFPU_FPU               = 1,     /*!< FPU : FPU is available.                                                   */
} MCUCTRL_SKU_SKUFPU_Enum;

/* =============================================  MCUCTRL SKU SKUDTCM [15..18]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUDTCM                                                       */
  MCUCTRL_SKU_SKUDTCM_128K             = 8,     /*!< 128K : 128KB DTCM is available.                                           */
  MCUCTRL_SKU_SKUDTCM_256K             = 9,     /*!< 256K : 256KB DTCM is available.                                           */
} MCUCTRL_SKU_SKUDTCM_Enum;

