zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  MCUCTRL SKU SKURADIODISABLE [11..11]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SKU_SKURADIODISABLE                                               */
  MCUCTRL_SKU_SKURADIODISABLE_ENABLED  = 0,     /*!< ENABLED : Radio is enabled for this SKU.                                  */
  MCUCTRL_SKU_SKURADIODISABLE_DISABLED = 1,     /*!< DISABLED : Radio is disabled for this SKU.                                */
} MCUCTRL_SKU_SKURADIODISABLE_Enum;

/* =============================================  MCUCTRL SKU SKUMIPIDSI [7..7]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUMIPIDSI                                                    */
  MCUCTRL_SKU_SKUMIPIDSI_DIS           = 0,     /*!< DIS : DISPPHY and DSI Controller Not available                            */
  MCUCTRL_SKU_SKUMIPIDSI_EN            = 1,     /*!< EN : DISPPHY and DSI Controller available                                 */
} MCUCTRL_SKU_SKUMIPIDSI_Enum;

/* ============================================  MCUCTRL SKU SKUTURBOSPOT [5..6]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUTURBOSPOT                                                  */
  MCUCTRL_SKU_SKUTURBOSPOT_LP          = 0,     /*!< LP : MCU max performance is LP mode (freq=96MHz)                          */
  MCUCTRL_SKU_SKUTURBOSPOT_HP1         = 1,     /*!< HP1 : MCU max performance is HP1 mode (freq=192MHz)                       */
  MCUCTRL_SKU_SKUTURBOSPOT_HP2         = 2,     /*!< HP2 : MCU max performance is HP2 mode (freq=250MHz)                       */
} MCUCTRL_SKU_SKUTURBOSPOT_Enum;

/* ==============================================  MCUCTRL SKU SKUDISP [4..4]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUDISP                                                       */
  MCUCTRL_SKU_SKUDISP_DIS              = 0,     /*!< DIS : DISPLAY Controller Not available                                    */
  MCUCTRL_SKU_SKUDISP_EN               = 1,     /*!< EN : DISPLAY Controller available                                         */
} MCUCTRL_SKU_SKUDISP_Enum;

/* ============================================  MCUCTRL SKU SKUMRAMSIZE [2..3]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUMRAMSIZE                                                   */
  MCUCTRL_SKU_SKUMRAMSIZE_1MB          = 0,     /*!< 1MB : MRAM 1MB                                                            */
  MCUCTRL_SKU_SKUMRAMSIZE_2MB          = 1,     /*!< 2MB : MRAM 2MB                                                            */
} MCUCTRL_SKU_SKUMRAMSIZE_Enum;

/* ============================================  MCUCTRL SKU SKUSRAMSIZE [0..0]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUSRAMSIZE                                                   */
  MCUCTRL_SKU_SKUSRAMSIZE_1MB          = 0,     /*!< 1MB : SRAM 1MB (SSRAM0 only)                                              */
  MCUCTRL_SKU_SKUSRAMSIZE_1P75MB       = 1,     /*!< 1P75MB : SSRAM 1.75MB (SSRAM0 and SSRAM1)                                 */
} MCUCTRL_SKU_SKUSRAMSIZE_Enum;

/* =======================================================  DEBUGGER  ======================================================== */
/* =========================================================  ACRG  ========================================================== */
/* ===========================================  MCUCTRL ACRG ACRGIBIASSEL [2..2]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_ACRG_ACRGIBIASSEL                                                 */
  MCUCTRL_ACRG_ACRGIBIASSEL_BGSEL      = 0,     /*!< BGSEL : Selects the bandgap                                               */
  MCUCTRL_ACRG_ACRGIBIASSEL_CCRGSEL    = 1,     /*!< CCRGSEL : Selects the CCRG                                                */
} MCUCTRL_ACRG_ACRGIBIASSEL_Enum;

/* ==============================================  MCUCTRL ACRG ACRGPWD [1..1]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_ACRG_ACRGPWD                                                      */
  MCUCTRL_ACRG_ACRGPWD_ACRG_PWR_DN     = 1,     /*!< ACRG_PWR_DN : Powers down the ACRG trim.                                  */
  MCUCTRL_ACRG_ACRGPWD_ACRG_PWR_UP     = 0,     /*!< ACRG_PWR_UP : Power up the ACRG trim.                                     */
} MCUCTRL_ACRG_ACRGPWD_Enum;

/* =======================================================  VREFGEN2  ======================================================== */
/* =======================================================  VREFGEN3  ======================================================== */
/* =======================================================  VREFGEN4  ======================================================== */
/* =======================================================  VREFGEN5  ======================================================== */
/* ========================================================  VREFBUF  ======================================================== */
/* ========================================================  VRCTRL  ========================================================= */
/* ========================================================  LDOREG1  ======================================================== */
/* ========================================================  LDOREG2  ======================================================== */
/* =========================================================  HFRC  ========================================================== */
/* ==============================================  MCUCTRL HFRC HFRCPWD [5..5]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_HFRC_HFRCPWD                                                      */
  MCUCTRL_HFRC_HFRCPWD_PWRUP           = 0,     /*!< PWRUP : Power up the HFRC Oscillator                                      */
  MCUCTRL_HFRC_HFRCPWD_PWRDN           = 1,     /*!< PWRDN : Power down the HFRC Oscillator                                    */
} MCUCTRL_HFRC_HFRCPWD_Enum;

/* ==============================================  MCUCTRL HFRC HFRCDIS [3..3]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_HFRC_HFRCDIS                                                      */
  MCUCTRL_HFRC_HFRCDIS_EN              = 0,     /*!< EN : Enable the HFRC Oscillator coreclock                                 */
  MCUCTRL_HFRC_HFRCDIS_OUTLOW          = 1,     /*!< OUTLOW : Force the HFRC Oscillator output low                             */
} MCUCTRL_HFRC_HFRCDIS_Enum;

