zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ========================================  MCUCTRL SHADOWVALID INFO1SELOTP [3..3]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFO1SELOTP                                           */
  MCUCTRL_SHADOWVALID_INFO1SELOTP_VALID = 1,    /*!< VALID : Indicate selector OTP Info1                                       */
  MCUCTRL_SHADOWVALID_INFO1SELOTP_DEFAULT = 0,  /*!< DEFAULT : Default value, Indicate select MRAM Info1.                      */
} MCUCTRL_SHADOWVALID_INFO1SELOTP_Enum;

/* =========================================  MCUCTRL SHADOWVALID INFO0VALID [2..2]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFO0VALID                                            */
  MCUCTRL_SHADOWVALID_INFO0VALID_VALID = 1,     /*!< VALID : Flash info0 (customer) space contains valid data.                 */
  MCUCTRL_SHADOWVALID_INFO0VALID_DEFAULT = 0,   /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_SHADOWVALID_INFO0VALID_Enum;

/* ========================================  MCUCTRL SHADOWVALID SPINORSLEEPn [1..1]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_SPINORSLEEPn                                          */
  MCUCTRL_SHADOWVALID_SPINORSLEEPn_SPIN = 1,    /*!< SPIN : Bootloader will spin when there is no image loaded.                */
  MCUCTRL_SHADOWVALID_SPINORSLEEPn_SLEEP = 0,   /*!< SLEEP : Bootloader will go to normal sleep when there is no
                                                     image loaded.                                                             */
} MCUCTRL_SHADOWVALID_SPINORSLEEPn_Enum;

/* ===========================================  MCUCTRL SHADOWVALID VALID [0..0]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_VALID                                                 */
  MCUCTRL_SHADOWVALID_VALID_VALID      = 1,     /*!< VALID : Flash information space contains valid data.                      */
  MCUCTRL_SHADOWVALID_VALID_DEFAULT    = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_SHADOWVALID_VALID_Enum;

/* =======================================================  SCRATCH0  ======================================================== */
/* =======================================================  SCRATCH1  ======================================================== */
/* =========================================================  DBGR1  ========================================================= */
/* =========================================================  DBGR2  ========================================================= */
/* ======================================================  WICCONTROL  ======================================================= */
/* ==========================================  MCUCTRL WICCONTROL DEEPISWIC [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_WICCONTROL_DEEPISWIC                                              */
  MCUCTRL_WICCONTROL_DEEPISWIC_SLEEPDEEP_IS_REGULAR_SLEEP = 0,/*!< SLEEPDEEP_IS_REGULAR_SLEEP : When de-asserted, SCR.SLEEPDEEP
                                                     is set and the processor core is in sleep, the processor
                                                     does not enter WIC sleep, and the processor must stay powered-up.         */
  MCUCTRL_WICCONTROL_DEEPISWIC_SLEEPDEEP_IS_WIC_SLEEP = 1,/*!< SLEEPDEEP_IS_WIC_SLEEP : When asserted, SCR.SLEEPDEEP is set
                                                     and the processor core is in sleep, the processor enters
                                                     WIC sleep and the clock and power can both be removed from
                                                     the processor.                                                            */
} MCUCTRL_WICCONTROL_DEEPISWIC_Enum;

/* ========================================================  DBGCTRL  ======================================================== */
/* =========================================  MCUCTRL DBGCTRL DBGTSCLKSEL [12..14]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTSCLKSEL                                               */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_LOWPWR   = 0,     /*!< LOWPWR : Low power state.                                                 */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV2 = 1,     /*!< HFRCDIV2 : Selects HFRC divided by 2 as the source dbg ts clk             */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV8 = 2,     /*!< HFRCDIV8 : Selects HFRC divided by 8 as the source dbg ts clk             */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV16 = 3,    /*!< HFRCDIV16 : Selects HFRC divided by 16 as the source dbg ts
                                                     clk                                                                       */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV32 = 4,    /*!< HFRCDIV32 : Selects HFRC divided by 32 as the source dbg ts
                                                     clk                                                                       */
} MCUCTRL_DBGCTRL_DBGTSCLKSEL_Enum;

/* =========================================  MCUCTRL DBGCTRL DBGTPIUCLKSEL [1..3]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTPIUCLKSEL                                             */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_OFF    = 0,     /*!< OFF : Low power state.                                                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_48MHz = 1, /*!< HFRC_48MHz : Selects HFRC 48Mhz as the source TPIU clk                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_96MHz = 2, /*!< HFRC_96MHz : Selects HFRC 96Mhz as the source TPIU clk                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_192MHz = 3,/*!< HFRC_192MHz : Selects HFRC 192Mhz as the source TPIU clk                  */
} MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Enum;

/* =======================================  MCUCTRL DBGCTRL DBGTPIUTRACEENABLE [0..0]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE                                        */
  MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_DIS = 0,   /*!< DIS : Disable the TPIU TRACE.                                             */
  MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_EN = 1,    /*!< EN : Enable the TPIU TRACE.                                               */
} MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Enum;

