zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ======================================================  OTAPOINTER  ======================================================= */
/* ===========================================  MCUCTRL OTAPOINTER OTASBR [2..2]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_OTAPOINTER_OTASBR                                                 */
  MCUCTRL_OTAPOINTER_OTASBR_SBL        = 0,     /*!< SBL : If OTAVALID=1, OTASBRUPDATE=0, and OTASBR=0, OTA is processed
                                                     by the secure bootloader (SBL).                                           */
  MCUCTRL_OTAPOINTER_OTASBR_SBR        = 1,     /*!< SBR : If OTAVALID=1, OTASBRUPDATE=1, and OTASBR=1, OTA is processed
                                                     by the secure bootrom (SBR).                                              */
} MCUCTRL_OTAPOINTER_OTASBR_Enum;

/* ========================================  MCUCTRL OTAPOINTER OTASBRUPDATE [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_OTAPOINTER_OTASBRUPDATE                                           */
  MCUCTRL_OTAPOINTER_OTASBRUPDATE_SBL  = 0,     /*!< SBL : Must be 0 for SBL update.                                           */
  MCUCTRL_OTAPOINTER_OTASBRUPDATE_SBR  = 1,     /*!< SBR : Must be 1 for SBR update.                                           */
} MCUCTRL_OTAPOINTER_OTASBRUPDATE_Enum;

/* ==========================================  MCUCTRL OTAPOINTER OTAVALID [0..0]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_OTAPOINTER_OTAVALID                                               */
  MCUCTRL_OTAPOINTER_OTAVALID_INVALID  = 0,     /*!< INVALID : OTA update is not valid.                                        */
  MCUCTRL_OTAPOINTER_OTAVALID_VALID    = 1,     /*!< VALID : OTA update is valid.                                              */
} MCUCTRL_OTAPOINTER_OTAVALID_Enum;

/* ======================================================  APBDMACTRL  ======================================================= */
/* =========================================  MCUCTRL APBDMACTRL DECODEABORT [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DECODEABORT                                            */
  MCUCTRL_APBDMACTRL_DECODEABORT_DISABLE = 0,   /*!< DISABLE : Bus operations to powered down peripherals are quietly
                                                     discarded                                                                 */
  MCUCTRL_APBDMACTRL_DECODEABORT_ENABLE = 1,    /*!< ENABLE : Bus operations to powered down peripherals result in
                                                     a bus fault.                                                              */
} MCUCTRL_APBDMACTRL_DECODEABORT_Enum;

/* ==========================================  MCUCTRL APBDMACTRL DMAENABLE [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DMAENABLE                                              */
  MCUCTRL_APBDMACTRL_DMAENABLE_DISABLE = 0,     /*!< DISABLE : DMA operations disabled                                         */
  MCUCTRL_APBDMACTRL_DMAENABLE_ENABLE  = 1,     /*!< ENABLE : DMA operations enabled                                           */
} MCUCTRL_APBDMACTRL_DMAENABLE_Enum;

/* =====================================================  FORCEAXICLKEN  ===================================================== */
/* ======================================================  KEXTCLKSEL  ======================================================= */
/* =========================================  MCUCTRL KEXTCLKSEL KEXTCLKSEL [0..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_KEXTCLKSEL_KEXTCLKSEL                                             */
  MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Key    = 83,    /*!< Key : Key value to unlock the register.                                   */
} MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Enum;

/* =======================================================  SIMOBUCK0  ======================================================= */
/* ======================================  MCUCTRL SIMOBUCK0 SIMOBUCKHPTRIMEN [23..23]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK0_SIMOBUCKHPTRIMEN                                        */
  MCUCTRL_SIMOBUCK0_SIMOBUCKHPTRIMEN_SIMOBUCK_HP_OFF = 0,/*!< SIMOBUCK_HP_OFF : Disable simobuck hp trim.                      */
  MCUCTRL_SIMOBUCK0_SIMOBUCKHPTRIMEN_SIMOBUCK_HP_ON = 1,/*!< SIMOBUCK_HP_ON : Enable simobuck hp trim.                         */
} MCUCTRL_SIMOBUCK0_SIMOBUCKHPTRIMEN_Enum;

/* =======================================================  SIMOBUCK1  ======================================================= */
/* ==================================  MCUCTRL SIMOBUCK1 SIMOBUCKHFRCPWRDNOVRVAL [21..21]  =================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVRVAL                                 */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVRVAL_NOFRC = 1,/*!< NOFRC : IGNORE the state of SIMOBUCK. HFRC can be powered down
                                                     irrespective of the state of SIMOBUCK.                                    */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVRVAL_FRCHFRC = 0,/*!< FRCHFRC : Force HFRC to RUN.                                      */
} MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVRVAL_Enum;

/* ===================================  MCUCTRL SIMOBUCK1 SIMOBUCKHFRCPWRDNOVREN [20..20]  =================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVREN                                  */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVREN_EN = 1,/*!< EN : OVERRIDE ENABLE                                                    */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVREN_DIS = 0,/*!< DIS : OVERRIDE DISABLE                                                 */
} MCUCTRL_SIMOBUCK1_SIMOBUCKHFRCPWRDNOVREN_Enum;

/* =======================================================  SIMOBUCK2  ======================================================= */
/* =======================================================  SIMOBUCK3  ======================================================= */
/* =======================================================  SIMOBUCK4  ======================================================= */
/* =======================================================  SIMOBUCK6  ======================================================= */
/* =======================================================  SIMOBUCK7  ======================================================= */
/* =======================================================  SIMOBUCK8  ======================================================= */
/* =======================================================  SIMOBUCK9  ======================================================= */
/* ======================================================  SIMOBUCK10  ======================================================= */
/* ======================================================  SIMOBUCK11  ======================================================= */
/* =======================================================  D2ASPARE2  ======================================================= */
/* ======================================================  USBLDOCTRL  ======================================================= */
/* ========================================  MCUCTRL USBLDOCTRL USBLDOVREFSEL [4..4]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_USBLDOCTRL_USBLDOVREFSEL                                          */
  MCUCTRL_USBLDOCTRL_USBLDOVREFSEL_CVRG = 0,    /*!< CVRG : VREF SEL is CVRG                                                   */
  MCUCTRL_USBLDOCTRL_USBLDOVREFSEL_BANDGAP = 1, /*!< BANDGAP : VREF SEL is BANDGAP                                             */
} MCUCTRL_USBLDOCTRL_USBLDOVREFSEL_Enum;

/* ========================================  MCUCTRL USBLDOCTRL USBLDOTESTEN [3..3]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_USBLDOCTRL_USBLDOTESTEN                                           */
  MCUCTRL_USBLDOCTRL_USBLDOTESTEN_DIS  = 0,     /*!< DIS : Disable Test                                                        */
  MCUCTRL_USBLDOCTRL_USBLDOTESTEN_EN   = 1,     /*!< EN : Enable Test                                                          */
} MCUCTRL_USBLDOCTRL_USBLDOTESTEN_Enum;

/* =======================================  MCUCTRL USBLDOCTRL USBLDOPULLDNDIS [2..2]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_USBLDOCTRL_USBLDOPULLDNDIS                                        */
  MCUCTRL_USBLDOCTRL_USBLDOPULLDNDIS_DIS = 1,   /*!< DIS : Disable Pulldown                                                    */
  MCUCTRL_USBLDOCTRL_USBLDOPULLDNDIS_EN = 0,    /*!< EN : Enable Pulldown                                                      */
} MCUCTRL_USBLDOCTRL_USBLDOPULLDNDIS_Enum;

/* =========================================  MCUCTRL USBLDOCTRL USBLDOPDNB [1..1]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_USBLDOCTRL_USBLDOPDNB                                             */
  MCUCTRL_USBLDOCTRL_USBLDOPDNB_PWRDN  = 0,     /*!< PWRDN : Powerdown EN                                                      */
  MCUCTRL_USBLDOCTRL_USBLDOPDNB_PWRUP  = 1,     /*!< PWRUP : Powerdown DIS                                                     */
} MCUCTRL_USBLDOCTRL_USBLDOPDNB_Enum;

/* ======================================================  I3CPHYCTRL  ======================================================= */
/* ========================================  MCUCTRL I3CPHYCTRL I3CPHYPULLDN [0..0]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_I3CPHYCTRL_I3CPHYPULLDN                                           */
  MCUCTRL_I3CPHYCTRL_I3CPHYPULLDN_PULLDNEN = 1, /*!< PULLDNEN : Enable the NMOS Pull Down Switch for I3CPHY                    */
  MCUCTRL_I3CPHYCTRL_I3CPHYPULLDN_PULLDNDIS = 0,/*!< PULLDNDIS : Disable the NMOS Pull Down Switch for I3CPHY                  */
} MCUCTRL_I3CPHYCTRL_I3CPHYPULLDN_Enum;

/* ========================================================  PWRSW0  ========================================================= */
/* ======================================  MCUCTRL PWRSW0 PWRSWVDDRCPUSTATSEL [30..30]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL                                        */
  MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_VDDFLP = 1,/*!< VDDFLP : Select VDDFLP rail                                               */
  MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_VDDS = 0,  /*!< VDDS : Select VDDS rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Enum;

