zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =======================================  MCUCTRL PWRSW0 PWRSWVDDMLSTATSEL [25..25]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL                                          */
  MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_VDDC = 0,    /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_VDDF = 1,    /*!< VDDF : Select VDDF rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Enum;

/* ======================================  MCUCTRL PWRSW0 PWRSWVDDMCPUSTATSEL [16..16]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL                                        */
  MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_VDDC = 0,  /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_VDDF = 1,  /*!< VDDF : Select VDDF rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Enum;

/* ========================================================  PWRSW1  ========================================================= */
/* =======================================  MCUCTRL PWRSW1 PWRSWVDDRMSTATSEL [16..16]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL                                          */
  MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_VDDFLP = 1,  /*!< VDDFLP : Select VDDFLP rail                                               */
  MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_VDDS = 0,    /*!< VDDS : Select VDDS rail                                                   */
} MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Enum;

/* =======================================  MCUCTRL PWRSW1 PWRSWVDDRLSTATSEL [11..11]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL                                          */
  MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_VDDFLP = 1,  /*!< VDDFLP : Select VDDFLP rail                                               */
  MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_VDDS = 0,    /*!< VDDS : Select VDDS rail                                                   */
} MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Enum;

/* ======================================================  USBRSTCTRL  ======================================================= */
/* ======================================================  FLASHWPROT0  ====================================================== */
/* ======================================================  FLASHWPROT1  ====================================================== */
/* ======================================================  FLASHWPROT2  ====================================================== */
/* ======================================================  FLASHWPROT3  ====================================================== */
/* ======================================================  FLASHRPROT0  ====================================================== */
/* ======================================================  FLASHRPROT1  ====================================================== */
/* ======================================================  FLASHRPROT2  ====================================================== */
/* ======================================================  FLASHRPROT3  ====================================================== */
/* ======================================================  SRAMWPROT0  ======================================================= */
/* ======================================================  SRAMWPROT1  ======================================================= */
/* ======================================================  SRAMWPROT2  ======================================================= */
/* ======================================================  SRAMWPROT3  ======================================================= */
/* ======================================================  SRAMRPROT0  ======================================================= */
/* ======================================================  SRAMRPROT1  ======================================================= */
/* ======================================================  SRAMRPROT2  ======================================================= */
/* ======================================================  SRAMRPROT3  ======================================================= */
/* =======================================================  SDIO0CTRL  ======================================================= */
/* =======================================  MCUCTRL SDIO0CTRL SDIO0XINCLKSEL [15..16]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL                                          */
  MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_HFRC_96MHz = 0,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                                */
  MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_HFRC_48MHz = 1,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                                */
  MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_HFRC_24MHz = 2,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                                */
} MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_Enum;

/* =======================================================  SDIO1CTRL  ======================================================= */
/* =======================================  MCUCTRL SDIO1CTRL SDIO1XINCLKSEL [15..16]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL                                          */
  MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_HFRC_96MHz = 0,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                                */
  MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_HFRC_48MHz = 1,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                                */
  MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_HFRC_24MHz = 2,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                                */
} MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_Enum;

/* ========================================================  PDMCTRL  ======================================================== */
/* ========================================================  DSIBIST  ======================================================== */
/* ==========================================  MCUCTRL DSIBIST DSIBISTMODE [2..3]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_DSIBIST_DSIBISTMODE                                               */
  MCUCTRL_DSIBIST_DSIBISTMODE_HSMODE   = 1,     /*!< HSMODE : HS mode                                                          */
  MCUCTRL_DSIBIST_DSIBISTMODE_LPMODE   = 2,     /*!< LPMODE : LP mode                                                          */
  MCUCTRL_DSIBIST_DSIBISTMODE_RXCLKESCMODE = 3, /*!< RXCLKESCMODE : RxClkEsc mode                                              */
} MCUCTRL_DSIBIST_DSIBISTMODE_Enum;

/* =====================================================  SSRAMMISCCTRL  ===================================================== */
/* ========================================  MCUCTRL SSRAMMISCCTRL CM4SRAMCHK [2..2]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SSRAMMISCCTRL_CM4SRAMCHK                                          */
  MCUCTRL_SSRAMMISCCTRL_CM4SRAMCHK_DIS = 0,     /*!< DIS : Disable sram power domain checking.                                 */
  MCUCTRL_SSRAMMISCCTRL_CM4SRAMCHK_EN  = 1,     /*!< EN : Enable sram power domain checking                                    */
} MCUCTRL_SSRAMMISCCTRL_CM4SRAMCHK_Enum;

/* =======================================  MCUCTRL SSRAMMISCCTRL DISPSRAMCHK [1..1]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SSRAMMISCCTRL_DISPSRAMCHK                                         */
  MCUCTRL_SSRAMMISCCTRL_DISPSRAMCHK_DIS = 0,    /*!< DIS : Disable sram power domain checking.                                 */
  MCUCTRL_SSRAMMISCCTRL_DISPSRAMCHK_EN = 1,     /*!< EN : Enable sram power domain checking                                    */
} MCUCTRL_SSRAMMISCCTRL_DISPSRAMCHK_Enum;

