zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ===========================================  MCUCTRL PLLCTL0 FOUTVCOPD [0..0]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_FOUTVCOPD                                                 */
  MCUCTRL_PLLCTL0_FOUTVCOPD_ACTIVE     = 0,     /*!< ACTIVE : Rate output enabled                                              */
  MCUCTRL_PLLCTL0_FOUTVCOPD_POWERDOWN  = 1,     /*!< POWERDOWN : Rate output disabled                                          */
} MCUCTRL_PLLCTL0_FOUTVCOPD_Enum;

/* ========================================================  PLLDIV0  ======================================================== */
/* ========================================================  PLLDIV1  ======================================================== */
/* ========================================================  PLLSTAT  ======================================================== */
/* =======================================================  PLLMUXCTL  ======================================================= */
/* ========================================  MCUCTRL PLLMUXCTL I2S0PLLCLKSEL [3..4]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL                                           */
  MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_PLLFOUT4 = 0, /*!< PLLFOUT4 : FOUTPOSTDIV divide by 8 from PLL                               */
  MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_PLLFOUT3 = 1, /*!< PLLFOUT3 : FOUTPOSTDIV divide by 6 from PLL                               */
  MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_CLKGEN = 2,   /*!< CLKGEN : I2S0 clock from CLKGEN                                           */
} MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_Enum;

/* =========================================  MCUCTRL PLLMUXCTL USBPLLCLKSEL [2..2]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_PLLMUXCTL_USBPLLCLKSEL                                            */
  MCUCTRL_PLLMUXCTL_USBPLLCLKSEL_PLL   = 0,     /*!< PLL : FOUTPOSTDIV from PLL                                                */
  MCUCTRL_PLLMUXCTL_USBPLLCLKSEL_CLKGEN = 1,    /*!< CLKGEN : USB PHY clock from CLKGEN                                        */
} MCUCTRL_PLLMUXCTL_USBPLLCLKSEL_Enum;

/* =========================================  MCUCTRL PLLMUXCTL PDMPLLCLKSEL [0..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL                                            */
  MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_PLL   = 0,     /*!< PLL : FOUTPOSTDIV from PLL                                                */
  MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_HFRC  = 1,     /*!< HFRC : 48MHz HFRC clock                                                   */
  MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_CLKGEN = 2,    /*!< CLKGEN : PDM clock from CLKGEN                                            */
} MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_Enum;

/* ======================================================  CM4CODEBASE  ====================================================== */
/* =====================================================  RADIOFINECNT  ====================================================== */
/* =====================================================  RADIOCLKNCNT  ====================================================== */


/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ===============================================  MSPI0 CTRL PIODEV [4..4]  ================================================ */
typedef enum {                                  /*!< MSPI0_CTRL_PIODEV                                                         */
  MSPI0_CTRL_PIODEV_DEVICE0            = 0,     /*!< DEVICE0 : Use DEVICE0 Configuration                                       */
  MSPI0_CTRL_PIODEV_DEVICE1            = 1,     /*!< DEVICE1 : Use DEVICE1 CONFIGURATION                                       */
} MSPI0_CTRL_PIODEV_Enum;

/* =========================================================  CTRL1  ========================================================= */
/* ==============================================  MSPI0 CTRL1 PIOMIXED [0..3]  ============================================== */
typedef enum {                                  /*!< MSPI0_CTRL1_PIOMIXED                                                      */
  MSPI0_CTRL1_PIOMIXED_NORMAL          = 0,     /*!< NORMAL : Transfers all proceed using the settings in DEVCFG
                                                     register (everything in the same data rate)                               */
  MSPI0_CTRL1_PIOMIXED_D2              = 1,     /*!< D2 : Data operations proceed in dual data rate                            */
  MSPI0_CTRL1_PIOMIXED_AD2             = 3,     /*!< AD2 : Address and Data operations proceed in dual data rate               */
  MSPI0_CTRL1_PIOMIXED_D4              = 5,     /*!< D4 : Data operations proceed in quad data rate                            */
  MSPI0_CTRL1_PIOMIXED_AD4             = 7,     /*!< AD4 : Address and Data operations proceed in quad data rate               */
  MSPI0_CTRL1_PIOMIXED_D8              = 9,     /*!< D8 : Data operations proceed in octal data rate                           */
  MSPI0_CTRL1_PIOMIXED_AD8             = 11,    /*!< AD8 : Address and Data operations proceed in octal data rate              */
} MSPI0_CTRL1_PIOMIXED_Enum;

/* =========================================================  ADDR  ========================================================== */
/* =========================================================  INSTR  ========================================================= */
/* ========================================================  TXFIFO  ========================================================= */
/* ========================================================  RXFIFO  ========================================================= */
/* =======================================================  TXENTRIES  ======================================================= */
/* =======================================================  RXENTRIES  ======================================================= */
/* =======================================================  THRESHOLD  ======================================================= */
/* ========================================================  MSPICFG  ======================================================== */
/* ==============================================  MSPI0 MSPICFG IOMSEL [4..7]  ============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_IOMSEL                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM0            = 0,     /*!< IOM0 : Selects IOM0.                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM1            = 1,     /*!< IOM1 : Selects IOM1.                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM2            = 2,     /*!< IOM2 : Selects IOM2.                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM3            = 3,     /*!< IOM3 : Selects IOM3.                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM4            = 4,     /*!< IOM4 : Selects IOM4.                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM5            = 5,     /*!< IOM5 : Selects IOM5.                                                      */
  MSPI0_MSPICFG_IOMSEL_MSPI0           = 8,     /*!< MSPI0 : Selects MSPI0.                                                    */
  MSPI0_MSPICFG_IOMSEL_MSPI1           = 9,     /*!< MSPI1 : Selects MSPI1.                                                    */
  MSPI0_MSPICFG_IOMSEL_MSPI2           = 10,    /*!< MSPI2 : Selects MSPI2.                                                    */
  MSPI0_MSPICFG_IOMSEL_CM4             = 12,    /*!< CM4 : Selects CM4.                                                        */
  MSPI0_MSPICFG_IOMSEL_DISABLED        = 15,    /*!< DISABLED : No IOM selected. Signals always zero.                          */
} MSPI0_MSPICFG_IOMSEL_Enum;

/* ==============================================  MSPI0 MSPICFG APBCLK [0..0]  ============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_APBCLK                                                      */
  MSPI0_MSPICFG_APBCLK_DIS             = 0,     /*!< DIS : Disable continuous clock.                                           */
  MSPI0_MSPICFG_APBCLK_EN              = 1,     /*!< EN : Enable continuous clock.                                             */
} MSPI0_MSPICFG_APBCLK_Enum;

/* =======================================================  PADOUTEN  ======================================================== */
/* =============================================  MSPI0 PADOUTEN OUTEN [0..18]  ============================================== */
typedef enum {                                  /*!< MSPI0_PADOUTEN_OUTEN                                                      */
  MSPI0_PADOUTEN_OUTEN_QUAD0           = 271,   /*!< QUAD0 : Quad0 (4 data + 1 clock)                                          */
  MSPI0_PADOUTEN_OUTEN_QUAD1           = 496,   /*!< QUAD1 : Quad1 (4 data + 1 clock)                                          */
  MSPI0_PADOUTEN_OUTEN_QUADDDR         = 783,   /*!< QUADDDR : Quadddr (4 data + 1 clock + 1 DM_DQS)                           */
  MSPI0_PADOUTEN_OUTEN_OCTAL           = 1023,  /*!< OCTAL : Octal (8 data + 1 clock + 1 DM_DQS)                               */
  MSPI0_PADOUTEN_OUTEN_SERIAL0         = 259,   /*!< SERIAL0 : Serial (2 data + 1 clock)                                       */
  MSPI0_PADOUTEN_OUTEN_SERIAL1         = 304,   /*!< SERIAL1 : Serial (2 data + 1 clock)                                       */
  MSPI0_PADOUTEN_OUTEN_HEX             = 524287,/*!< HEX : Octal (16 data + 1 clock + 2 DM_DQS)                                */
} MSPI0_PADOUTEN_OUTEN_Enum;

