zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ==========================================  OTP INTERRUPT PARITYCRITREG [6..6]  =========================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_PARITYCRITREG                                               */
  OTP_INTERRUPT_PARITYCRITREG_NOINTERR = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_PARITYCRITREG_INTERR   = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_PARITYCRITREG_Enum;

/* ============================================  OTP INTERRUPT PARITYPSM [5..5]  ============================================= */
typedef enum {                                  /*!< OTP_INTERRUPT_PARITYPSM                                                   */
  OTP_INTERRUPT_PARITYPSM_NOINTERR     = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_PARITYPSM_INTERR       = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_PARITYPSM_Enum;

/* =========================================  OTP INTERRUPT ACCESSPERMISSION [4..4]  ========================================= */
typedef enum {                                  /*!< OTP_INTERRUPT_ACCESSPERMISSION                                            */
  OTP_INTERRUPT_ACCESSPERMISSION_NOINTERR = 0,  /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_ACCESSPERMISSION_INTERR = 1,    /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_ACCESSPERMISSION_Enum;

/* ===========================================  OTP INTERRUPT SHIELDFAULT [3..3]  ============================================ */
typedef enum {                                  /*!< OTP_INTERRUPT_SHIELDFAULT                                                 */
  OTP_INTERRUPT_SHIELDFAULT_NOINTERR   = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_SHIELDFAULT_INTERR     = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_SHIELDFAULT_Enum;

/* ===========================================  OTP INTERRUPT PARITYINPUT [2..2]  ============================================ */
typedef enum {                                  /*!< OTP_INTERRUPT_PARITYINPUT                                                 */
  OTP_INTERRUPT_PARITYINPUT_NOINTERR   = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_PARITYINPUT_INTERR     = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_PARITYINPUT_Enum;

/* =============================================  OTP INTERRUPT OUTDATA [1..1]  ============================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_OUTDATA                                                     */
  OTP_INTERRUPT_OUTDATA_NOINTERR       = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_OUTDATA_INTERR         = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_OUTDATA_Enum;

/* ============================================  OTP INTERRUPT PWRSUPPLY [0..0]  ============================================= */
typedef enum {                                  /*!< OTP_INTERRUPT_PWRSUPPLY                                                   */
  OTP_INTERRUPT_PWRSUPPLY_NOINTERR     = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_PWRSUPPLY_INTERR       = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_PWRSUPPLY_Enum;

/* ========================================================  PTMSTAT  ======================================================== */
/* ===============================================  OTP PTMSTAT FORBID [4..4]  =============================================== */
typedef enum {                                  /*!< OTP_PTMSTAT_FORBID                                                        */
  OTP_PTMSTAT_FORBID_LOCKED            = 1,     /*!< LOCKED : PTM is locked                                                    */
  OTP_PTMSTAT_FORBID_UNLOCKED          = 0,     /*!< UNLOCKED : PTM is not locked                                              */
} OTP_PTMSTAT_FORBID_Enum;

/* =============================================  OTP PTMSTAT INCORRECT [3..3]  ============================================== */
typedef enum {                                  /*!< OTP_PTMSTAT_INCORRECT                                                     */
  OTP_PTMSTAT_INCORRECT_BAD            = 1,     /*!< BAD : PTM data is incorrect                                               */
  OTP_PTMSTAT_INCORRECT_GOOD           = 0,     /*!< GOOD : PTM data good                                                      */
} OTP_PTMSTAT_INCORRECT_Enum;

/* ==============================================  OTP PTMSTAT WARNING [2..2]  =============================================== */
typedef enum {                                  /*!< OTP_PTMSTAT_WARNING                                                       */
  OTP_PTMSTAT_WARNING_OCCURRED         = 1,     /*!< OCCURRED : PTM is re-run or not initialized.                              */
  OTP_PTMSTAT_WARNING_NONE             = 0,     /*!< NONE : No PTM warning                                                     */
} OTP_PTMSTAT_WARNING_Enum;

/* =============================================  OTP PTMSTAT PTM_ERROR [1..1]  ============================================== */
typedef enum {                                  /*!< OTP_PTMSTAT_PTM_ERROR                                                     */
  OTP_PTMSTAT_PTM_ERROR_VALID          = 0,     /*!< VALID : No PTM error.                                                     */
  OTP_PTMSTAT_PTM_ERROR_INVALID        = 1,     /*!< INVALID : PTM error occurred.                                             */
} OTP_PTMSTAT_PTM_ERROR_Enum;

