zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =====================================================  MEMPWRSTATUS  ====================================================== */
/* =========================================  PWRCTRL MEMPWRSTATUS PWRSTTCM [0..1]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWRSTATUS_PWRSTTCM                                             */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_NONE   = 0,     /*!< NONE : Do not enable power to any DTCMs                                   */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_DTCM128K = 1,   /*!< DTCM128K : Only 128k of DTCM is powered up                                */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_DTCM256K = 3,   /*!< DTCM256K : Only 256k of DTCM is powered up                                */
} PWRCTRL_MEMPWRSTATUS_PWRSTTCM_Enum;

/* =======================================================  MEMRETCFG  ======================================================= */
/* ==========================================  PWRCTRL MEMRETCFG NVMPWDCFG [2..3]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMRETCFG_NVMPWDCFG                                               */
  PWRCTRL_MEMRETCFG_NVMPWDCFG_FULLPWDEN = 2,    /*!< FULLPWDEN : NVM is Full power down When power down NVM                    */
  PWRCTRL_MEMRETCFG_NVMPWDCFG_DEEPPWDEN = 1,    /*!< DEEPPWDEN : NVM is Deep power down during When power down NVM             */
  PWRCTRL_MEMRETCFG_NVMPWDCFG_RETPWDEN = 0,     /*!< RETPWDEN : NVM is in Retention Power Down When Power down NVM             */
} PWRCTRL_MEMRETCFG_NVMPWDCFG_Enum;

/* ==========================================  PWRCTRL MEMRETCFG NVMPWDSLP [1..1]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMRETCFG_NVMPWDSLP                                               */
  PWRCTRL_MEMRETCFG_NVMPWDSLP_DIS      = 0,     /*!< DIS : NVM is kept powered on during deepsleep                             */
  PWRCTRL_MEMRETCFG_NVMPWDSLP_EN       = 1,     /*!< EN : NVM is powered down during deepsleep                                 */
} PWRCTRL_MEMRETCFG_NVMPWDSLP_Enum;

/* ==========================================  PWRCTRL MEMRETCFG TCMPWDSLP [0..0]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMRETCFG_TCMPWDSLP                                               */
  PWRCTRL_MEMRETCFG_TCMPWDSLP_DIS      = 0,     /*!< DIS : All enabled TCM is kept powered on and retained during
                                                     deep sleep                                                                */
  PWRCTRL_MEMRETCFG_TCMPWDSLP_EN       = 1,     /*!< EN : All enabled TCM is powered down (not retained) during deep
                                                     sleep                                                                     */
} PWRCTRL_MEMRETCFG_TCMPWDSLP_Enum;

/* =====================================================  SYSPWRSTATUS  ====================================================== */
/* ======================================================  SSRAMPWREN  ======================================================= */
/* =========================================  PWRCTRL SSRAMPWREN PWRENSSRAM [0..1]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_SSRAMPWREN_PWRENSSRAM                                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_NONE   = 0,     /*!< NONE : Do not power ON any of the SRAM banks                              */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP0 = 1,     /*!< GROUP0 : Power ON only SRAM0 group (Lower 1M)                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP1 = 2,     /*!< GROUP1 : Power ON only SRAM1 group (Upper 0.75M)                          */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_ALL    = 3,     /*!< ALL : All shared SRAM banks (SSRAM0 1M + SSRAM1 0.75M) powered
                                                     ON                                                                        */
} PWRCTRL_SSRAMPWREN_PWRENSSRAM_Enum;

/* ======================================================  SSRAMPWRST  ======================================================= */
/* ======================================================  SSRAMRETCFG  ====================================================== */
/* ========================================  PWRCTRL SSRAMRETCFG SSRAMPWDSLP [0..1]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP                                           */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_NONE = 0,     /*!< NONE : All banks retained                                                 */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP0 = 1,   /*!< GROUP0 : Power down only SRAM group0                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP1 = 2,   /*!< GROUP1 : Power down only SRAM group1                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_ALL  = 3,     /*!< ALL : All shared SRAM banks powered down                                  */
} PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_Enum;

/* =====================================================  DEVPWREVENTEN  ===================================================== */
/* ========================================  PWRCTRL DEVPWREVENTEN PDMEVEN [12..12]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_PDMEVEN                                             */
  PWRCTRL_DEVPWREVENTEN_PDMEVEN_EN     = 1,     /*!< EN : Enable PDM power-on status event                                     */
  PWRCTRL_DEVPWREVENTEN_PDMEVEN_DIS    = 0,     /*!< DIS : Disable PDM power-on status event                                   */
} PWRCTRL_DEVPWREVENTEN_PDMEVEN_Enum;

/* =======================================  PWRCTRL DEVPWREVENTEN MSPI2EVEN [10..10]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_MSPI2EVEN                                           */
  PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_EN   = 1,     /*!< EN : Enable MSPI2 power-on status event                                   */
  PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_DIS  = 0,     /*!< DIS : Disable MSPI2 power-on status event                                 */
} PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_Enum;

/* ========================================  PWRCTRL DEVPWREVENTEN MSPI1EVEN [9..9]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_MSPI1EVEN                                           */
  PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_EN   = 1,     /*!< EN : Enable MSPI1 power-on status event                                   */
  PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_DIS  = 0,     /*!< DIS : Disable MSPI1 power-on status event                                 */
} PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN MSPIEVEN [8..8]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_MSPIEVEN                                            */
  PWRCTRL_DEVPWREVENTEN_MSPIEVEN_EN    = 1,     /*!< EN : Enable MSPI power-on status event                                    */
  PWRCTRL_DEVPWREVENTEN_MSPIEVEN_DIS   = 0,     /*!< DIS : Disable MSPI power-on status event                                  */
} PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN AUDEVEN [7..7]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_AUDEVEN                                             */
  PWRCTRL_DEVPWREVENTEN_AUDEVEN_EN     = 1,     /*!< EN : Enable AUD power-on status event                                     */
  PWRCTRL_DEVPWREVENTEN_AUDEVEN_DIS    = 0,     /*!< DIS : Disable AUD power-on status event                                   */
} PWRCTRL_DEVPWREVENTEN_AUDEVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN ADCEVEN [5..5]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_ADCEVEN                                             */
  PWRCTRL_DEVPWREVENTEN_ADCEVEN_EN     = 1,     /*!< EN : Enable ADC power-on status event                                     */
  PWRCTRL_DEVPWREVENTEN_ADCEVEN_DIS    = 0,     /*!< DIS : Disable ADC power-on status event                                   */
} PWRCTRL_DEVPWREVENTEN_ADCEVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN HCPCEVEN [4..4]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_HCPCEVEN                                            */
  PWRCTRL_DEVPWREVENTEN_HCPCEVEN_EN    = 1,     /*!< EN : Enable HCPC power-on status event                                    */
  PWRCTRL_DEVPWREVENTEN_HCPCEVEN_DIS   = 0,     /*!< DIS : Disable HCPC power-on status event                                  */
} PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Enum;

