zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =======================================  PWRCTRL MMSOVERRIDE MMSOVRSSRAMGFX [1..1]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX                                        */
  PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX_NOGFX = 1, /*!< NOGFX : SSRAM power state is not affected by PD_GFX setting.              */
  PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX_PD_GFX = 0,/*!< PD_GFX : SSRAM power state set by SSRAMPWREN_PWRENSSRAM is overridden
                                                     by PD_GFX setting.                                                        */
} PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX_Enum;

/* =======================================  PWRCTRL MMSOVERRIDE MMSOVRMCULGFX [0..0]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX                                         */
  PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX_MCULON = 0, /*!< MCULON : When PD_GFX is on, MCUL is forced on.                            */
  PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX_MCULOFF = 1,/*!< MCULOFF : PD_GFX Does not affect the state of PD_MCUL                     */
} PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX_Enum;

/* ======================================================  CPUPWRCTRL  ======================================================= */
/* =======================================  PWRCTRL CPUPWRCTRL DEEPERSLEEPEN [13..13]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_DEEPERSLEEPEN                                          */
  PWRCTRL_CPUPWRCTRL_DEEPERSLEEPEN_DEEP_SLEEP = 0,/*!< DEEP_SLEEP : Deep Sleep                                                 */
  PWRCTRL_CPUPWRCTRL_DEEPERSLEEPEN_DEEPER_SLEEP = 1,/*!< DEEPER_SLEEP : Deeper Sleep.                                          */
} PWRCTRL_CPUPWRCTRL_DEEPERSLEEPEN_Enum;

/* ======================================  PWRCTRL CPUPWRCTRL DISFUNCRETMODE [12..12]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE                                         */
  PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE_NORMAL_OPERATION = 0,/*!< NORMAL_OPERATION : FUNC_RET mode is enabled                      */
  PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE_DIS_FUNC_RET = 1,/*!< DIS_FUNC_RET : FUNC_RET mode is disabled                             */
} PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE_Enum;

/* ========================================  PWRCTRL CPUPWRCTRL DBGCLKSTATE [11..11]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_DBGCLKSTATE                                            */
  PWRCTRL_CPUPWRCTRL_DBGCLKSTATE_NORMAL_OPERATION = 0,/*!< NORMAL_OPERATION : Clock follows normal HW sequencing               */
  PWRCTRL_CPUPWRCTRL_DBGCLKSTATE_CLOCK_ON = 1,  /*!< CLOCK_ON : Clock stays enabled                                            */
} PWRCTRL_CPUPWRCTRL_DBGCLKSTATE_Enum;

/* =========================================  PWRCTRL CPUPWRCTRL FCLKSTATE [10..10]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_FCLKSTATE                                              */
  PWRCTRL_CPUPWRCTRL_FCLKSTATE_NORMAL_OPERATION = 0,/*!< NORMAL_OPERATION : Clock follows normal HW sequencing                 */
  PWRCTRL_CPUPWRCTRL_FCLKSTATE_CLOCK_ON = 1,    /*!< CLOCK_ON : Clock stays enabled                                            */
} PWRCTRL_CPUPWRCTRL_FCLKSTATE_Enum;

/* =========================================  PWRCTRL CPUPWRCTRL PMUCLKSTATE [9..9]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_PMUCLKSTATE                                            */
  PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_NORMAL_OPERATION = 0,/*!< NORMAL_OPERATION : Clock follows normal HW sequencing               */
  PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_CLOCK_ON = 1,  /*!< CLOCK_ON : Clock stays enabled                                            */
} PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_Enum;

/* ========================================  PWRCTRL CPUPWRCTRL IWICCLKSTATE [7..7]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_IWICCLKSTATE                                           */
  PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_NORMAL_OPERATION = 0,/*!< NORMAL_OPERATION : Clock follows normal HW sequencing              */
  PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_CLOCK_ON = 1, /*!< CLOCK_ON : Clock stays enabled                                            */
} PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_Enum;

/* =========================================  PWRCTRL CPUPWRCTRL CPUCLKOVREN [6..6]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_CPUCLKOVREN                                            */
  PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_OVERRIDE_OFF = 0,/*!< OVERRIDE_OFF : CPU Clocks follow normal HW sequencing                   */
  PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_OVERRIDE_ON = 1,/*!< OVERRIDE_ON : Clock state will be overriden by above bits                */
} PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_Enum;

/* =========================================  PWRCTRL CPUPWRCTRL EPUPWRSTATE [4..5]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_EPUPWRSTATE                                            */
  PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_UNUSED = 0,    /*!< UNUSED : This value is reserved                                           */
  PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_EPU_RET = 1,   /*!< EPU_RET : EPU in retention                                                */
  PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_EPU_ON = 2,    /*!< EPU_ON : EPU is ON                                                        */
} PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_Enum;

/* ========================================  PWRCTRL CPUPWRCTRL EPUMODEOVREN [3..3]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_EPUMODEOVREN                                           */
  PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_EPU_NORM = 0, /*!< EPU_NORM : EPU follows normal CPU transitions as per legacy
                                                     or P channel mode                                                         */
  PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_EPU_OVERRIDE = 1,/*!< EPU_OVERRIDE : Override EPU state to match EPUPWRSTATE                 */
} PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_Enum;

/* ==========================================  PWRCTRL CPUPWRCTRL SLEEPMODE [2..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_SLEEPMODE                                              */
  PWRCTRL_CPUPWRCTRL_SLEEPMODE_AMBIQ_SLEEP = 0, /*!< AMBIQ_SLEEP : PMU gates off CLKIN.                                        */
  PWRCTRL_CPUPWRCTRL_SLEEPMODE_ARM_SLEEP = 1,   /*!< ARM_SLEEP : PMU does not gate off CLKIN, uses M55 internal clock
                                                     gating                                                                    */
} PWRCTRL_CPUPWRCTRL_SLEEPMODE_Enum;

