zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEAUD [1..1]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_Enum;

/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEADC [0..0]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_Enum;

/* =====================================================  PWRCNTDEFVAL  ====================================================== */
/* =======================================================  EPURETCFG  ======================================================= */
/* ==========================================  PWRCTRL EPURETCFG EPURETSLP [0..0]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_EPURETCFG_EPURETSLP                                               */
  PWRCTRL_EPURETCFG_EPURETSLP_EN       = 1,     /*!< EN : EPU will be in retention when core is in deepsleep                   */
  PWRCTRL_EPURETCFG_EPURETSLP_DIS      = 0,     /*!< DIS : EPU will be powered down when core is in deepsleep                  */
} PWRCTRL_EPURETCFG_EPURETSLP_Enum;

/* ======================================================  CM4PWRCTRL  ======================================================= */
/* ========================================  PWRCTRL CM4PWRCTRL CM4POWERONREQ [0..0]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_CM4PWRCTRL_CM4POWERONREQ                                          */
  PWRCTRL_CM4PWRCTRL_CM4POWERONREQ_ON  = 1,     /*!< ON : POWER ON CM4                                                         */
  PWRCTRL_CM4PWRCTRL_CM4POWERONREQ_UNUSED = 0,  /*!< UNUSED : This value is reserved.                                          */
} PWRCTRL_CM4PWRCTRL_CM4POWERONREQ_Enum;

/* ======================================================  CM4PWRSTATE  ====================================================== */
/* ========================================  PWRCTRL CM4PWRSTATE CM4PWRSTATUS [0..1]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_CM4PWRSTATE_CM4PWRSTATUS                                          */
  PWRCTRL_CM4PWRSTATE_CM4PWRSTATUS_OFF = 0,     /*!< OFF : CM4 is OFF                                                          */
  PWRCTRL_CM4PWRSTATE_CM4PWRSTATUS_ON  = 1,     /*!< ON : CM4 is ON                                                            */
  PWRCTRL_CM4PWRSTATE_CM4PWRSTATUS_RET = 3,     /*!< RET : CM4 is in RETENTION                                                 */
} PWRCTRL_CM4PWRSTATE_CM4PWRSTATUS_Enum;

/* ========================================================  VRCTRL  ========================================================= */
/* ===========================================  PWRCTRL VRCTRL SIMOBUCKEN [0..0]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_VRCTRL_SIMOBUCKEN                                                 */
  PWRCTRL_VRCTRL_SIMOBUCKEN_EN         = 1,     /*!< EN : Enable the SIMO Buck                                                 */
  PWRCTRL_VRCTRL_SIMOBUCKEN_DIS        = 0,     /*!< DIS : Disable the SIMO Buck                                               */
} PWRCTRL_VRCTRL_SIMOBUCKEN_Enum;

/* =====================================================  LEGACYVRLPOVR  ===================================================== */
/* =======================================================  VRSTATUS  ======================================================== */
/* ==========================================  PWRCTRL VRSTATUS SIMOBUCKST [4..5]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_VRSTATUS_SIMOBUCKST                                               */
  PWRCTRL_VRSTATUS_SIMOBUCKST_OFF      = 0,     /*!< OFF : Indicates the the SIMO BUCK is OFF.                                 */
  PWRCTRL_VRSTATUS_SIMOBUCKST_LP       = 2,     /*!< LP : Indicates the the SIMO BUCK is ON and in LP mode.                    */
  PWRCTRL_VRSTATUS_SIMOBUCKST_ACT      = 3,     /*!< ACT : Indicates the the SIMO BUCK is ON and in ACT mode.                  */
} PWRCTRL_VRSTATUS_SIMOBUCKST_Enum;

/* ===========================================  PWRCTRL VRSTATUS MEMLDOST [2..3]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_VRSTATUS_MEMLDOST                                                 */
  PWRCTRL_VRSTATUS_MEMLDOST_OFF        = 0,     /*!< OFF : Indicates the the MEMLDO is OFF.                                    */
  PWRCTRL_VRSTATUS_MEMLDOST_LP         = 2,     /*!< LP : Indicates the the MEMLDO is ON and in LP mode.                       */
  PWRCTRL_VRSTATUS_MEMLDOST_ACT        = 3,     /*!< ACT : Indicates the the MEMLDO is ON and in ACT mode.                     */
} PWRCTRL_VRSTATUS_MEMLDOST_Enum;

/* ===========================================  PWRCTRL VRSTATUS CORELDOST [0..1]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_VRSTATUS_CORELDOST                                                */
  PWRCTRL_VRSTATUS_CORELDOST_OFF       = 0,     /*!< OFF : Indicates the the CORELDO is OFF.                                   */
  PWRCTRL_VRSTATUS_CORELDOST_LP        = 2,     /*!< LP : Indicates the the CORELDO is ON and in LP mode.                      */
  PWRCTRL_VRSTATUS_CORELDOST_ACT       = 3,     /*!< ACT : Indicates the the CORELDO is ON and in ACT mode.                    */
} PWRCTRL_VRSTATUS_CORELDOST_Enum;

