zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ================================================  RTC RTCCTL WRTC [0..0]  ================================================= */
typedef enum {                                  /*!< RTC_RTCCTL_WRTC                                                           */
  RTC_RTCCTL_WRTC_DIS                  = 0,     /*!< DIS : Counter writes are disabled                                         */
  RTC_RTCCTL_WRTC_EN                   = 1,     /*!< EN : Counter writes are enabled                                           */
} RTC_RTCCTL_WRTC_Enum;

/* ========================================================  RTCSTAT  ======================================================== */
/* ========================================================  CTRLOW  ========================================================= */
/* =========================================================  CTRUP  ========================================================= */
/* ===============================================  RTC CTRUP CTERR [31..31]  ================================================ */
typedef enum {                                  /*!< RTC_CTRUP_CTERR                                                           */
  RTC_CTRUP_CTERR_NOERR                = 0,     /*!< NOERR : No read error occurred                                            */
  RTC_CTRUP_CTERR_RDERR                = 1,     /*!< RDERR : Read error occurred                                               */
} RTC_CTRUP_CTERR_Enum;

/* =================================================  RTC CTRUP CB [28..28]  ================================================= */
typedef enum {                                  /*!< RTC_CTRUP_CB                                                              */
  RTC_CTRUP_CB_2100                    = 0,     /*!< 2100 : Century is 2100s                                                   */
  RTC_CTRUP_CB_2000                    = 1,     /*!< 2000 : Century is 2000s                                                   */
} RTC_CTRUP_CB_Enum;

/* ========================================================  ALMLOW  ========================================================= */
/* =========================================================  ALMUP  ========================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            SCM                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  SCMCNTRCTRL1  ====================================================== */
/* ==========================================  SCM SCMCNTRCTRL1 SCMMODESEL [1..2]  =========================================== */
typedef enum {                                  /*!< SCM_SCMCNTRCTRL1_SCMMODESEL                                               */
  SCM_SCMCNTRCTRL1_SCMMODESEL_ONSYNC   = 0,     /*!< ONSYNC : Return to LP mode on frame sync 1                                */
  SCM_SCMCNTRCTRL1_SCMMODESEL_ONSWCTRL = 1,     /*!< ONSWCTRL : Return to LP mode on SW control (bit FORCELP)                  */
  SCM_SCMCNTRCTRL1_SCMMODESEL_ONCOUNT  = 2,     /*!< ONCOUNT : Return to LP mode using active counters                         */
} SCM_SCMCNTRCTRL1_SCMMODESEL_Enum;

/* =====================================================  SCMCNTRCTRL2  ====================================================== */
/* =====================================================  LPTHRESHVDDS  ====================================================== */
/* =====================================================  LPTHRESHVDDF  ====================================================== */
/* =====================================================  LPTHRESHVDDC  ====================================================== */
/* ====================================================  LPTHRESHVDDCLV  ===================================================== */
/* =====================================================  LPTHRESHVDDRF  ===================================================== */
/* =======================================================  LPHYSTCNT  ======================================================= */
/* ======================================================  ACTTHRESH1  ======================================================= */
/* ======================================================  ACTTHRESH2  ======================================================= */
/* ======================================================  ACTTHRESH3  ======================================================= */
/* ========================================================  LPSTAT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           SDIO0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  SDMA  ========================================================== */
/* =========================================================  BLOCK  ========================================================= */
/* ==============================================  SDIO0 BLOCK BLKCNT [16..31]  ============================================== */
typedef enum {                                  /*!< SDIO0_BLOCK_BLKCNT                                                        */
  SDIO0_BLOCK_BLKCNT_STOPCNT           = 0,     /*!< STOPCNT : Stop Count                                                      */
  SDIO0_BLOCK_BLKCNT_1BLOCK            = 1,     /*!< 1BLOCK : 1 block                                                          */
  SDIO0_BLOCK_BLKCNT_2BLOCKS           = 2,     /*!< 2BLOCKS : 2 blocks (and so on from 1-65535)                               */
  SDIO0_BLOCK_BLKCNT_65535BLOCKS       = 65535, /*!< 65535BLOCKS : 65535 blocks                                                */
} SDIO0_BLOCK_BLKCNT_Enum;

/* ==========================================  SDIO0 BLOCK HOSTSDMABUFSZ [12..14]  =========================================== */
typedef enum {                                  /*!< SDIO0_BLOCK_HOSTSDMABUFSZ                                                 */
  SDIO0_BLOCK_HOSTSDMABUFSZ_4KB        = 0,     /*!< 4KB : 4KB(Detects A11 Carry out)                                          */
  SDIO0_BLOCK_HOSTSDMABUFSZ_8KB        = 1,     /*!< 8KB : 8KB(Detects A12 Carry out)                                          */
  SDIO0_BLOCK_HOSTSDMABUFSZ_16KB       = 2,     /*!< 16KB : 16KB(Detects A13 Carry out)                                        */
  SDIO0_BLOCK_HOSTSDMABUFSZ_32KB       = 3,     /*!< 32KB : 32KB(Detects A14 Carry out)                                        */
  SDIO0_BLOCK_HOSTSDMABUFSZ_64KB       = 4,     /*!< 64KB : 64KB(Detects A15 Carry out)                                        */
  SDIO0_BLOCK_HOSTSDMABUFSZ_128KB      = 5,     /*!< 128KB : 128KB(Detects A16 Carry out)                                      */
  SDIO0_BLOCK_HOSTSDMABUFSZ_256KB      = 6,     /*!< 256KB : 256KB(Detects A17 Carry out)                                      */
  SDIO0_BLOCK_HOSTSDMABUFSZ_512KB      = 7,     /*!< 512KB : 512KB(Detects A18 Carry out)                                      */
} SDIO0_BLOCK_HOSTSDMABUFSZ_Enum;

/* =========================================  SDIO0 BLOCK TRANSFERBLOCKSIZE [0..11]  ========================================= */
typedef enum {                                  /*!< SDIO0_BLOCK_TRANSFERBLOCKSIZE                                             */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_NODATAXFER = 0, /*!< NODATAXFER : No Data Transfer                                             */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_1BYTE  = 1,     /*!< 1BYTE : 1 Byte                                                            */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_2BYTES = 2,     /*!< 2BYTES : 2 Bytes                                                          */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_3BYTES = 3,     /*!< 3BYTES : 3 Bytes                                                          */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_4BYTES = 4,     /*!< 4BYTES : 4 Bytes (and so on from 1-2048)                                  */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_511BYTES = 511, /*!< 511BYTES : 511 Bytes                                                      */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_512BYTES = 512, /*!< 512BYTES : 512 Bytes                                                      */
  SDIO0_BLOCK_TRANSFERBLOCKSIZE_2048BYTES = 2048,/*!< 2048BYTES : 2048 Bytes                                                   */
} SDIO0_BLOCK_TRANSFERBLOCKSIZE_Enum;

/* =======================================================  ARGUMENT1  ======================================================= */
/* =======================================================  TRANSFER  ======================================================== */
/* ============================================  SDIO0 TRANSFER CMDTYPE [22..23]  ============================================ */
typedef enum {                                  /*!< SDIO0_TRANSFER_CMDTYPE                                                    */
  SDIO0_TRANSFER_CMDTYPE_NORMAL        = 0,     /*!< NORMAL : Normal                                                           */
  SDIO0_TRANSFER_CMDTYPE_SUSPEND       = 1,     /*!< SUSPEND : Suspend                                                         */
  SDIO0_TRANSFER_CMDTYPE_RESUME        = 2,     /*!< RESUME : Resume                                                           */
  SDIO0_TRANSFER_CMDTYPE_ABORT         = 3,     /*!< ABORT : Abort                                                             */
} SDIO0_TRANSFER_CMDTYPE_Enum;

/* =========================================  SDIO0 TRANSFER DATAPRSNTSEL [21..21]  ========================================== */
typedef enum {                                  /*!< SDIO0_TRANSFER_DATAPRSNTSEL                                               */
  SDIO0_TRANSFER_DATAPRSNTSEL_NODATAPRESENT = 0,/*!< NODATAPRESENT : No Data Present                                           */
  SDIO0_TRANSFER_DATAPRSNTSEL_DATAPRESENT = 1,  /*!< DATAPRESENT : Data Present                                                */
} SDIO0_TRANSFER_DATAPRSNTSEL_Enum;

/* ==========================================  SDIO0 TRANSFER CMDIDXCHKEN [20..20]  ========================================== */
typedef enum {                                  /*!< SDIO0_TRANSFER_CMDIDXCHKEN                                                */
  SDIO0_TRANSFER_CMDIDXCHKEN_DISABLE   = 0,     /*!< DISABLE : Disable                                                         */
  SDIO0_TRANSFER_CMDIDXCHKEN_ENABLE    = 1,     /*!< ENABLE : Enable                                                           */
} SDIO0_TRANSFER_CMDIDXCHKEN_Enum;

/* ==========================================  SDIO0 TRANSFER CMDCRCCHKEN [19..19]  ========================================== */
typedef enum {                                  /*!< SDIO0_TRANSFER_CMDCRCCHKEN                                                */
  SDIO0_TRANSFER_CMDCRCCHKEN_DISABLE   = 0,     /*!< DISABLE : Disable                                                         */
  SDIO0_TRANSFER_CMDCRCCHKEN_ENABLE    = 1,     /*!< ENABLE : Enable                                                           */
} SDIO0_TRANSFER_CMDCRCCHKEN_Enum;

/* ==========================================  SDIO0 TRANSFER RESPTYPESEL [16..17]  ========================================== */
typedef enum {                                  /*!< SDIO0_TRANSFER_RESPTYPESEL                                                */
  SDIO0_TRANSFER_RESPTYPESEL_NORESPONSE = 0,    /*!< NORESPONSE : No Response                                                  */
  SDIO0_TRANSFER_RESPTYPESEL_LEN136    = 1,     /*!< LEN136 : Response length 136                                              */
  SDIO0_TRANSFER_RESPTYPESEL_LEN48     = 2,     /*!< LEN48 : Response length 48                                                */
  SDIO0_TRANSFER_RESPTYPESEL_LEN48CHKBUSY = 3,  /*!< LEN48CHKBUSY : Response length 48 check Busy after response               */
} SDIO0_TRANSFER_RESPTYPESEL_Enum;

/* =============================================  SDIO0 TRANSFER BLKSEL [5..5]  ============================================== */
typedef enum {                                  /*!< SDIO0_TRANSFER_BLKSEL                                                     */
  SDIO0_TRANSFER_BLKSEL_SINGLEBLOCK    = 0,     /*!< SINGLEBLOCK : Single Block                                                */
  SDIO0_TRANSFER_BLKSEL_MULTIPLEBLOCK  = 1,     /*!< MULTIPLEBLOCK : Multiple Block                                            */
} SDIO0_TRANSFER_BLKSEL_Enum;

