zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ============================================  SDIO0 PRESENT BUFWREN [10..10]  ============================================= */
typedef enum {                                  /*!< SDIO0_PRESENT_BUFWREN                                                     */
  SDIO0_PRESENT_BUFWREN_DISABLE        = 0,     /*!< DISABLE : Write Disable                                                   */
  SDIO0_PRESENT_BUFWREN_ENABLE         = 1,     /*!< ENABLE : Write Enable.                                                    */
} SDIO0_PRESENT_BUFWREN_Enum;

/* ============================================  SDIO0 PRESENT RDXFERACT [9..9]  ============================================= */
typedef enum {                                  /*!< SDIO0_PRESENT_RDXFERACT                                                   */
  SDIO0_PRESENT_RDXFERACT_TRANSFERRING = 1,     /*!< TRANSFERRING : Transferring data                                          */
  SDIO0_PRESENT_RDXFERACT_NOVALIDATA   = 0,     /*!< NOVALIDATA : No valid data                                                */
} SDIO0_PRESENT_RDXFERACT_Enum;

/* ============================================  SDIO0 PRESENT WRXFERACT [8..8]  ============================================= */
typedef enum {                                  /*!< SDIO0_PRESENT_WRXFERACT                                                   */
  SDIO0_PRESENT_WRXFERACT_TRANSFERRING = 1,     /*!< TRANSFERRING : transferring data                                          */
  SDIO0_PRESENT_WRXFERACT_NOVALIDDATA  = 0,     /*!< NOVALIDDATA : No valid data                                               */
} SDIO0_PRESENT_WRXFERACT_Enum;

/* =========================================  SDIO0 PRESENT RETUNINGREQUEST [3..3]  ========================================== */
typedef enum {                                  /*!< SDIO0_PRESENT_RETUNINGREQUEST                                             */
  SDIO0_PRESENT_RETUNINGREQUEST_RETUNENEEDED = 1,/*!< RETUNENEEDED : Sampling clock needs re-tuning                            */
  SDIO0_PRESENT_RETUNINGREQUEST_WELLTUNED = 0,  /*!< WELLTUNED : Fixed or well tuned sampling clock                            */
} SDIO0_PRESENT_RETUNINGREQUEST_Enum;

/* =============================================  SDIO0 PRESENT DLINEACT [2..2]  ============================================= */
typedef enum {                                  /*!< SDIO0_PRESENT_DLINEACT                                                    */
  SDIO0_PRESENT_DLINEACT_ACTIVE        = 1,     /*!< ACTIVE : DAT line active                                                  */
  SDIO0_PRESENT_DLINEACT_INACTIVE      = 0,     /*!< INACTIVE : DAT line inactive                                              */
} SDIO0_PRESENT_DLINEACT_Enum;

/* ============================================  SDIO0 PRESENT CMDINHDAT [1..1]  ============================================= */
typedef enum {                                  /*!< SDIO0_PRESENT_CMDINHDAT                                                   */
  SDIO0_PRESENT_CMDINHDAT_DONTISSUE    = 1,     /*!< DONTISSUE : cannot issue command which uses the DAT line                  */
  SDIO0_PRESENT_CMDINHDAT_ISSUE        = 0,     /*!< ISSUE : Can issue command which uses the DAT line                         */
} SDIO0_PRESENT_CMDINHDAT_Enum;

/* ============================================  SDIO0 PRESENT CMDINHCMD [0..0]  ============================================= */
typedef enum {                                  /*!< SDIO0_PRESENT_CMDINHCMD                                                   */
  SDIO0_PRESENT_CMDINHCMD_DONTISSUE    = 1,     /*!< DONTISSUE : CMD line is in use                                            */
  SDIO0_PRESENT_CMDINHCMD_ISSUE        = 0,     /*!< ISSUE : Indicates that the CMD line is not in use and the HC
                                                     can issue a SD command using the CMD line.                                */
} SDIO0_PRESENT_CMDINHCMD_Enum;

/* =======================================================  HOSTCTRL1  ======================================================= */
/* ========================================  SDIO0 HOSTCTRL1 WUENCARDREMOVL [26..26]  ======================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_WUENCARDREMOVL                                            */
  SDIO0_HOSTCTRL1_WUENCARDREMOVL_ENABLE = 1,    /*!< ENABLE : Enable                                                           */
  SDIO0_HOSTCTRL1_WUENCARDREMOVL_DISABLE = 0,   /*!< DISABLE : Disable                                                         */
} SDIO0_HOSTCTRL1_WUENCARDREMOVL_Enum;

/* ========================================  SDIO0 HOSTCTRL1 WUENCARDINSERT [25..25]  ======================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_WUENCARDINSERT                                            */
  SDIO0_HOSTCTRL1_WUENCARDINSERT_ENABLE = 1,    /*!< ENABLE : Enable                                                           */
  SDIO0_HOSTCTRL1_WUENCARDINSERT_DISABLE = 0,   /*!< DISABLE : Disable                                                         */
} SDIO0_HOSTCTRL1_WUENCARDINSERT_Enum;

/* =========================================  SDIO0 HOSTCTRL1 WUENCARDINT [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_WUENCARDINT                                               */
  SDIO0_HOSTCTRL1_WUENCARDINT_ENABLE   = 1,     /*!< ENABLE : Enable                                                           */
  SDIO0_HOSTCTRL1_WUENCARDINT_DISABLE  = 0,     /*!< DISABLE : Disable                                                         */
} SDIO0_HOSTCTRL1_WUENCARDINT_Enum;

/* ==========================================  SDIO0 HOSTCTRL1 BOOTACKCHK [23..23]  ========================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_BOOTACKCHK                                                */
  SDIO0_HOSTCTRL1_BOOTACKCHK_WAIT      = 1,     /*!< WAIT : wait for boot ack from eMMC card                                   */
  SDIO0_HOSTCTRL1_BOOTACKCHK_NOWAIT    = 0,     /*!< NOWAIT : Will not wait for boot ack from eMMC card                        */
} SDIO0_HOSTCTRL1_BOOTACKCHK_Enum;

/* ==========================================  SDIO0 HOSTCTRL1 ALTBOOTEN [22..22]  =========================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_ALTBOOTEN                                                 */
  SDIO0_HOSTCTRL1_ALTBOOTEN_START      = 1,     /*!< START : To start alternate boot mode access                               */
  SDIO0_HOSTCTRL1_ALTBOOTEN_STOP       = 0,     /*!< STOP : To stop alternate boot mode access                                 */
} SDIO0_HOSTCTRL1_ALTBOOTEN_Enum;

/* ============================================  SDIO0 HOSTCTRL1 BOOTEN [21..21]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_BOOTEN                                                    */
  SDIO0_HOSTCTRL1_BOOTEN_START         = 1,     /*!< START : To start boot code access                                         */
  SDIO0_HOSTCTRL1_BOOTEN_STOP          = 0,     /*!< STOP : To stop boot code access                                           */
} SDIO0_HOSTCTRL1_BOOTEN_Enum;

