zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ======================================  SDIO0 INTSTAT COMMANDTIMEOUTERROR [16..16]  ======================================= */
typedef enum {                                  /*!< SDIO0_INTSTAT_COMMANDTIMEOUTERROR                                         */
  SDIO0_INTSTAT_COMMANDTIMEOUTERROR_NOERROR = 0,/*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_COMMANDTIMEOUTERROR_ERROR = 1,  /*!< ERROR : CRC Error Generated                                               */
} SDIO0_INTSTAT_COMMANDTIMEOUTERROR_Enum;

/* =========================================  SDIO0 INTSTAT ERRORINTERRUPT [15..15]  ========================================= */
typedef enum {                                  /*!< SDIO0_INTSTAT_ERRORINTERRUPT                                              */
  SDIO0_INTSTAT_ERRORINTERRUPT_NOERROR = 0,     /*!< NOERROR : No Error.                                                       */
  SDIO0_INTSTAT_ERRORINTERRUPT_ERROR   = 1,     /*!< ERROR : Error.                                                            */
} SDIO0_INTSTAT_ERRORINTERRUPT_Enum;

/* =========================================  SDIO0 INTSTAT BOOTTERMINATE [14..14]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_BOOTTERMINATE                                               */
  SDIO0_INTSTAT_BOOTTERMINATE_OK       = 0,     /*!< OK : Boot operation is not terminated.                                    */
  SDIO0_INTSTAT_BOOTTERMINATE_BOOTTERM = 1,     /*!< BOOTTERM : Boot operation is terminated                                   */
} SDIO0_INTSTAT_BOOTTERMINATE_Enum;

/* ===========================================  SDIO0 INTSTAT BOOTACKRCV [13..13]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_BOOTACKRCV                                                  */
  SDIO0_INTSTAT_BOOTACKRCV_NOACK       = 0,     /*!< NOACK : Boot ack is not received.                                         */
  SDIO0_INTSTAT_BOOTACKRCV_ACK         = 1,     /*!< ACK : Boot ack is received.                                               */
} SDIO0_INTSTAT_BOOTACKRCV_Enum;

/* =========================================  SDIO0 INTSTAT RETUNINGEVENT [12..12]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_RETUNINGEVENT                                               */
  SDIO0_INTSTAT_RETUNINGEVENT_RETUNE   = 1,     /*!< RETUNE : ReTuning should be performed                                     */
  SDIO0_INTSTAT_RETUNINGEVENT_NORETUNE = 0,     /*!< NORETUNE : ReTuning is not required                                       */
} SDIO0_INTSTAT_RETUNINGEVENT_Enum;

/* ==========================================  SDIO0 INTSTAT CARDINTERRUPT [8..8]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_CARDINTERRUPT                                               */
  SDIO0_INTSTAT_CARDINTERRUPT_NOINT    = 0,     /*!< NOINT : No Card Interrupt                                                 */
  SDIO0_INTSTAT_CARDINTERRUPT_INT      = 1,     /*!< INT : Generate Card Interrupt                                             */
} SDIO0_INTSTAT_CARDINTERRUPT_Enum;

/* ===========================================  SDIO0 INTSTAT CARDREMOVAL [7..7]  ============================================ */
typedef enum {                                  /*!< SDIO0_INTSTAT_CARDREMOVAL                                                 */
  SDIO0_INTSTAT_CARDREMOVAL_STABLE     = 0,     /*!< STABLE : Card State Stable or Debouncing                                  */
  SDIO0_INTSTAT_CARDREMOVAL_REMOVED    = 1,     /*!< REMOVED : Card Removed                                                    */
} SDIO0_INTSTAT_CARDREMOVAL_Enum;

/* ==========================================  SDIO0 INTSTAT CARDINSERTION [6..6]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_CARDINSERTION                                               */
  SDIO0_INTSTAT_CARDINSERTION_STABLE   = 0,     /*!< STABLE : Card State Stable or Debouncing                                  */
  SDIO0_INTSTAT_CARDINSERTION_INSERTED = 1,     /*!< INSERTED : Card Inserted                                                  */
} SDIO0_INTSTAT_CARDINSERTION_Enum;

/* =========================================  SDIO0 INTSTAT BUFFERREADREADY [5..5]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_BUFFERREADREADY                                             */
  SDIO0_INTSTAT_BUFFERREADREADY_NOREADY = 0,    /*!< NOREADY : Not Ready to read Buffer.                                       */
  SDIO0_INTSTAT_BUFFERREADREADY_READY  = 1,     /*!< READY : Ready to read Buffer.                                             */
} SDIO0_INTSTAT_BUFFERREADREADY_Enum;

/* =========================================  SDIO0 INTSTAT BUFFERWRITEREADY [4..4]  ========================================= */
typedef enum {                                  /*!< SDIO0_INTSTAT_BUFFERWRITEREADY                                            */
  SDIO0_INTSTAT_BUFFERWRITEREADY_NOTREADY = 0,  /*!< NOTREADY : Not Ready to Write Buffer.                                     */
  SDIO0_INTSTAT_BUFFERWRITEREADY_READY = 1,     /*!< READY : Ready to Write Buffer.                                            */
} SDIO0_INTSTAT_BUFFERWRITEREADY_Enum;

/* ===========================================  SDIO0 INTSTAT DMAINTERRUPT [3..3]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_DMAINTERRUPT                                                */
  SDIO0_INTSTAT_DMAINTERRUPT_NOINT     = 0,     /*!< NOINT : No DMA Interrupt                                                  */
  SDIO0_INTSTAT_DMAINTERRUPT_INT       = 1,     /*!< INT : DMA Interrupt is Generated                                          */
} SDIO0_INTSTAT_DMAINTERRUPT_Enum;

/* ==========================================  SDIO0 INTSTAT BLOCKGAPEVENT [2..2]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_BLOCKGAPEVENT                                               */
  SDIO0_INTSTAT_BLOCKGAPEVENT_NOEVENT  = 0,     /*!< NOEVENT : No Block Gap Event                                              */
  SDIO0_INTSTAT_BLOCKGAPEVENT_STOPPED  = 1,     /*!< STOPPED : Transaction stopped at Block Gap                                */
} SDIO0_INTSTAT_BLOCKGAPEVENT_Enum;

/* =========================================  SDIO0 INTSTAT TRANSFERCOMPLETE [1..1]  ========================================= */
typedef enum {                                  /*!< SDIO0_INTSTAT_TRANSFERCOMPLETE                                            */
  SDIO0_INTSTAT_TRANSFERCOMPLETE_NODATA = 0,    /*!< NODATA : No Data Transfer Complete                                        */
  SDIO0_INTSTAT_TRANSFERCOMPLETE_COMPLETE = 1,  /*!< COMPLETE : Data Transfer Complete                                         */
} SDIO0_INTSTAT_TRANSFERCOMPLETE_Enum;

/* =========================================  SDIO0 INTSTAT COMMANDCOMPLETE [0..0]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_COMMANDCOMPLETE                                             */
  SDIO0_INTSTAT_COMMANDCOMPLETE_NOCMP  = 0,     /*!< NOCMP : No Command Complete                                               */
  SDIO0_INTSTAT_COMMANDCOMPLETE_CMDCMP = 1,     /*!< CMDCMP : Command Complete                                                 */
} SDIO0_INTSTAT_COMMANDCOMPLETE_Enum;

/* =======================================================  INTENABLE  ======================================================= */
/* ========================================================  INTSIG  ========================================================= */
/* ============================================  SDIO0 INTSIG TGTRESPEN [28..28]  ============================================ */
typedef enum {                                  /*!< SDIO0_INTSIG_TGTRESPEN                                                    */
  SDIO0_INTSIG_TGTRESPEN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_TGTRESPEN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_TGTRESPEN_Enum;

/* ===========================================  SDIO0 INTSIG TUNINGERREN [26..26]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_TUNINGERREN                                                  */
  SDIO0_INTSIG_TUNINGERREN_MASKED      = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_TUNINGERREN_ENABLED     = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_TUNINGERREN_Enum;

/* ============================================  SDIO0 INTSIG ADMAERREN [25..25]  ============================================ */
typedef enum {                                  /*!< SDIO0_INTSIG_ADMAERREN                                                    */
  SDIO0_INTSIG_ADMAERREN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_ADMAERREN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_ADMAERREN_Enum;

