zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ============================================  SDIO0 VENDOR GATESDCLKEN [0..0]  ============================================ */
typedef enum {                                  /*!< SDIO0_VENDOR_GATESDCLKEN                                                  */
  SDIO0_VENDOR_GATESDCLKEN_GATE        = 1,     /*!< GATE : SD_CLK to card will be gated automatically when there
                                                     is no transfer.                                                           */
  SDIO0_VENDOR_GATESDCLKEN_NOGATE      = 0,     /*!< NOGATE : SD_CLK to card will NOT be gated automatically when
                                                     there is no transfer.                                                     */
} SDIO0_VENDOR_GATESDCLKEN_Enum;

/* =======================================================  SLOTSTAT  ======================================================== */
/* =======================================================  CLKOUTCFG  ======================================================= */
/* =============================================  SDIO0 CLKOUTCFG WIDEN [4..4]  ============================================== */
typedef enum {                                  /*!< SDIO0_CLKOUTCFG_WIDEN                                                     */
  SDIO0_CLKOUTCFG_WIDEN_W              = 1,     /*!< W : widen                                                                 */
  SDIO0_CLKOUTCFG_WIDEN_N              = 0,     /*!< N : narrow                                                                */
} SDIO0_CLKOUTCFG_WIDEN_Enum;

/* ==============================================  SDIO0 CLKOUTCFG STEP [0..3]  ============================================== */
typedef enum {                                  /*!< SDIO0_CLKOUTCFG_STEP                                                      */
  SDIO0_CLKOUTCFG_STEP_DIS             = 0,     /*!< DIS : disable clock duty cycle tuning                                     */
  SDIO0_CLKOUTCFG_STEP_1STEP           = 1,     /*!< 1STEP : clock duty cycle tuning with amount of 1 step                     */
  SDIO0_CLKOUTCFG_STEP_2STEP           = 2,     /*!< 2STEP : clock duty cycle tuning with amount of 2 steps                    */
  SDIO0_CLKOUTCFG_STEP_3STEP           = 3,     /*!< 3STEP : clock duty cycle tuning with amount of 3 steps                    */
  SDIO0_CLKOUTCFG_STEP_4STEP           = 4,     /*!< 4STEP : clock duty cycle tuning with amount of 4 steps                    */
  SDIO0_CLKOUTCFG_STEP_5STEP           = 5,     /*!< 5STEP : clock duty cycle tuning with amount of 5 steps                    */
  SDIO0_CLKOUTCFG_STEP_6STEP           = 6,     /*!< 6STEP : clock duty cycle tuning with amount of 6 steps                    */
  SDIO0_CLKOUTCFG_STEP_7STEP           = 7,     /*!< 7STEP : clock duty cycle tuning with amount of 7 steps                    */
  SDIO0_CLKOUTCFG_STEP_8STEP           = 8,     /*!< 8STEP : clock duty cycle tuning with amount of 8 steps                    */
  SDIO0_CLKOUTCFG_STEP_9STEP           = 9,     /*!< 9STEP : clock duty cycle tuning with amount of 9 steps                    */
  SDIO0_CLKOUTCFG_STEP_10STEP          = 10,    /*!< 10STEP : clock duty cycle tuning with amount of 10 steps                  */
  SDIO0_CLKOUTCFG_STEP_11STEP          = 11,    /*!< 11STEP : clock duty cycle tuning with amount of 11 steps                  */
  SDIO0_CLKOUTCFG_STEP_12STEP          = 12,    /*!< 12STEP : clock duty cycle tuning with amount of 12 steps                  */
  SDIO0_CLKOUTCFG_STEP_13STEP          = 13,    /*!< 13STEP : clock duty cycle tuning with amount of 13 steps                  */
  SDIO0_CLKOUTCFG_STEP_14STEP          = 14,    /*!< 14STEP : clock duty cycle tuning with amount of 14 steps                  */
  SDIO0_CLKOUTCFG_STEP_15STEP          = 15,    /*!< 15STEP : clock duty cycle tuning with amount of 15 steps                  */
} SDIO0_CLKOUTCFG_STEP_Enum;



/* =========================================================================================================================== */
/* ================                                         SECURERTC                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  RTCCTL  ========================================================= */
/* ============================================  SECURERTC RTCCTL HR1224 [5..5]  ============================================= */
typedef enum {                                  /*!< SECURERTC_RTCCTL_HR1224                                                   */
  SECURERTC_RTCCTL_HR1224_24HR         = 0,     /*!< 24HR : Hours in 24 hour mode                                              */
  SECURERTC_RTCCTL_HR1224_DISABLED     = 1,     /*!< DISABLED : Disable the 24 hour mode                                       */
} SECURERTC_RTCCTL_HR1224_Enum;

/* =============================================  SECURERTC RTCCTL RSTOP [4..4]  ============================================= */
typedef enum {                                  /*!< SECURERTC_RTCCTL_RSTOP                                                    */
  SECURERTC_RTCCTL_RSTOP_RUN           = 0,     /*!< RUN : Allow the RTC input clock to run                                    */
  SECURERTC_RTCCTL_RSTOP_STOP          = 1,     /*!< STOP : Stop the RTC input clock                                           */
} SECURERTC_RTCCTL_RSTOP_Enum;

/* ==============================================  SECURERTC RTCCTL RPT [1..3]  ============================================== */
typedef enum {                                  /*!< SECURERTC_RTCCTL_RPT                                                      */
  SECURERTC_RTCCTL_RPT_DIS             = 0,     /*!< DIS : Alarm interrupt disabled                                            */
  SECURERTC_RTCCTL_RPT_YEAR            = 1,     /*!< YEAR : Interrupt every year                                               */
  SECURERTC_RTCCTL_RPT_MONTH           = 2,     /*!< MONTH : Interrupt every month                                             */
  SECURERTC_RTCCTL_RPT_WEEK            = 3,     /*!< WEEK : Interrupt every week                                               */
  SECURERTC_RTCCTL_RPT_DAY             = 4,     /*!< DAY : Interrupt every day                                                 */
  SECURERTC_RTCCTL_RPT_HR              = 5,     /*!< HR : Interrupt every hour                                                 */
  SECURERTC_RTCCTL_RPT_MIN             = 6,     /*!< MIN : Interrupt every minute                                              */
  SECURERTC_RTCCTL_RPT_SEC             = 7,     /*!< SEC : Interrupt every second/10th/100th                                   */
} SECURERTC_RTCCTL_RPT_Enum;

/* =============================================  SECURERTC RTCCTL WRTC [0..0]  ============================================== */
typedef enum {                                  /*!< SECURERTC_RTCCTL_WRTC                                                     */
  SECURERTC_RTCCTL_WRTC_DIS            = 0,     /*!< DIS : Counter writes are disabled                                         */
  SECURERTC_RTCCTL_WRTC_EN             = 1,     /*!< EN : Counter writes are enabled                                           */
} SECURERTC_RTCCTL_WRTC_Enum;

/* ========================================================  RTCSTAT  ======================================================== */
/* ========================================================  CTRLOW  ========================================================= */
/* =========================================================  CTRUP  ========================================================= */
/* ============================================  SECURERTC CTRUP CTERR [31..31]  ============================================= */
typedef enum {                                  /*!< SECURERTC_CTRUP_CTERR                                                     */
  SECURERTC_CTRUP_CTERR_NOERR          = 0,     /*!< NOERR : No read error occurred                                            */
  SECURERTC_CTRUP_CTERR_RDERR          = 1,     /*!< RDERR : Read error occurred                                               */
} SECURERTC_CTRUP_CTERR_Enum;

