zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =============================================  SECURERTC CTRUP CEB [29..29]  ============================================== */
typedef enum {                                  /*!< SECURERTC_CTRUP_CEB                                                       */
  SECURERTC_CTRUP_CEB_DIS              = 0,     /*!< DIS : Disable the Century bit from changing                               */
  SECURERTC_CTRUP_CEB_EN               = 1,     /*!< EN : Enable the Century bit to change                                     */
} SECURERTC_CTRUP_CEB_Enum;

/* ==============================================  SECURERTC CTRUP CB [28..28]  ============================================== */
typedef enum {                                  /*!< SECURERTC_CTRUP_CB                                                        */
  SECURERTC_CTRUP_CB_2000              = 0,     /*!< 2000 : Century is 2100s                                                   */
  SECURERTC_CTRUP_CB_1900_2100         = 1,     /*!< 1900_2100 : Century is 2000s                                              */
} SECURERTC_CTRUP_CB_Enum;

/* ========================================================  ALMLOW  ========================================================= */
/* =========================================================  ALMUP  ========================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                       SECURESTIMER                                        ================ */
/* =========================================================================================================================== */

/* =========================================================  STCFG  ========================================================= */
/* ==========================================  SECURESTIMER STCFG FREEZE [31..31]  =========================================== */
typedef enum {                                  /*!< SECURESTIMER_STCFG_FREEZE                                                 */
  SECURESTIMER_STCFG_FREEZE_THAW       = 0,     /*!< THAW : Let the COUNTER register run on its input clock.                   */
  SECURESTIMER_STCFG_FREEZE_FREEZE     = 1,     /*!< FREEZE : Stop the COUNTER register for loading.                           */
} SECURESTIMER_STCFG_FREEZE_Enum;

/* ===========================================  SECURESTIMER STCFG CLEAR [30..30]  =========================================== */
typedef enum {                                  /*!< SECURESTIMER_STCFG_CLEAR                                                  */
  SECURESTIMER_STCFG_CLEAR_RUN         = 0,     /*!< RUN : Let the COUNTER register run on its input clock.                    */
  SECURESTIMER_STCFG_CLEAR_CLEAR       = 1,     /*!< CLEAR : Stop the COUNTER register for loading.                            */
} SECURESTIMER_STCFG_CLEAR_Enum;

/* ========================================  SECURESTIMER STCFG COMPAREHEN [15..15]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPAREHEN                                             */
  SECURESTIMER_STCFG_COMPAREHEN_DISABLE = 0,    /*!< DISABLE : Compare H disabled.                                             */
  SECURESTIMER_STCFG_COMPAREHEN_ENABLE = 1,     /*!< ENABLE : Compare H enabled.                                               */
} SECURESTIMER_STCFG_COMPAREHEN_Enum;

/* ========================================  SECURESTIMER STCFG COMPAREGEN [14..14]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPAREGEN                                             */
  SECURESTIMER_STCFG_COMPAREGEN_DISABLE = 0,    /*!< DISABLE : Compare G disabled.                                             */
  SECURESTIMER_STCFG_COMPAREGEN_ENABLE = 1,     /*!< ENABLE : Compare G enabled.                                               */
} SECURESTIMER_STCFG_COMPAREGEN_Enum;

/* ========================================  SECURESTIMER STCFG COMPAREFEN [13..13]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPAREFEN                                             */
  SECURESTIMER_STCFG_COMPAREFEN_DISABLE = 0,    /*!< DISABLE : Compare F disabled.                                             */
  SECURESTIMER_STCFG_COMPAREFEN_ENABLE = 1,     /*!< ENABLE : Compare F enabled.                                               */
} SECURESTIMER_STCFG_COMPAREFEN_Enum;

/* ========================================  SECURESTIMER STCFG COMPAREEEN [12..12]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPAREEEN                                             */
  SECURESTIMER_STCFG_COMPAREEEN_DISABLE = 0,    /*!< DISABLE : Compare E disabled.                                             */
  SECURESTIMER_STCFG_COMPAREEEN_ENABLE = 1,     /*!< ENABLE : Compare E enabled.                                               */
} SECURESTIMER_STCFG_COMPAREEEN_Enum;

/* ========================================  SECURESTIMER STCFG COMPAREDEN [11..11]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPAREDEN                                             */
  SECURESTIMER_STCFG_COMPAREDEN_DISABLE = 0,    /*!< DISABLE : Compare D disabled.                                             */
  SECURESTIMER_STCFG_COMPAREDEN_ENABLE = 1,     /*!< ENABLE : Compare D enabled.                                               */
} SECURESTIMER_STCFG_COMPAREDEN_Enum;

/* ========================================  SECURESTIMER STCFG COMPARECEN [10..10]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPARECEN                                             */
  SECURESTIMER_STCFG_COMPARECEN_DISABLE = 0,    /*!< DISABLE : Compare C disabled.                                             */
  SECURESTIMER_STCFG_COMPARECEN_ENABLE = 1,     /*!< ENABLE : Compare C enabled.                                               */
} SECURESTIMER_STCFG_COMPARECEN_Enum;

/* =========================================  SECURESTIMER STCFG COMPAREBEN [9..9]  ========================================== */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPAREBEN                                             */
  SECURESTIMER_STCFG_COMPAREBEN_DISABLE = 0,    /*!< DISABLE : Compare B disabled.                                             */
  SECURESTIMER_STCFG_COMPAREBEN_ENABLE = 1,     /*!< ENABLE : Compare B enabled.                                               */
} SECURESTIMER_STCFG_COMPAREBEN_Enum;

