zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  SECURESTIMER STCFG COMPAREAEN [8..8]  ========================================== */
typedef enum {                                  /*!< SECURESTIMER_STCFG_COMPAREAEN                                             */
  SECURESTIMER_STCFG_COMPAREAEN_DISABLE = 0,    /*!< DISABLE : Compare A disabled.                                             */
  SECURESTIMER_STCFG_COMPAREAEN_ENABLE = 1,     /*!< ENABLE : Compare A enabled.                                               */
} SECURESTIMER_STCFG_COMPAREAEN_Enum;

/* ===========================================  SECURESTIMER STCFG CLKSEL [0..3]  ============================================ */
typedef enum {                                  /*!< SECURESTIMER_STCFG_CLKSEL                                                 */
  SECURESTIMER_STCFG_CLKSEL_NOCLK      = 0,     /*!< NOCLK : No clock enabled.                                                 */
  SECURESTIMER_STCFG_CLKSEL_HFRC_6MHZ  = 1,     /*!< HFRC_6MHZ : 6MHz from the HFRC clock divider.                             */
  SECURESTIMER_STCFG_CLKSEL_HFRC_375KHZ = 2,    /*!< HFRC_375KHZ : 375KHz from the HFRC clock divider.                         */
  SECURESTIMER_STCFG_CLKSEL_XTAL_32KHZ = 3,     /*!< XTAL_32KHZ : 32768Hz from the crystal oscillator.                         */
  SECURESTIMER_STCFG_CLKSEL_XTAL_8KHZ  = 4,     /*!< XTAL_8KHZ : 8162Hz from the crystal oscillator.                           */
  SECURESTIMER_STCFG_CLKSEL_XTAL_1KHZ  = 5,     /*!< XTAL_1KHZ : 1024Hz from the crystal oscillator.                           */
  SECURESTIMER_STCFG_CLKSEL_LFRC_1KHZ  = 6,     /*!< LFRC_1KHZ : Approximately 1KHz from the LFRC oscillator (uncalibrated).   */
  SECURESTIMER_STCFG_CLKSEL_CTIMER0    = 7,     /*!< CTIMER0 : Use CTIMER 0 for the clock source (allows prescaling
                                                     from other system clocks).                                                */
  SECURESTIMER_STCFG_CLKSEL_CTIMER1    = 8,     /*!< CTIMER1 : Use CTIMER 1 for the clock source (allows prescaling
                                                     from other system clocks).                                                */
} SECURESTIMER_STCFG_CLKSEL_Enum;

/* =========================================================  STTMR  ========================================================= */
/* =======================================================  SCAPCTRL0  ======================================================= */
/* ========================================  SECURESTIMER SCAPCTRL0 CAPTURE0 [9..9]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL0_CAPTURE0                                           */
  SECURESTIMER_SCAPCTRL0_CAPTURE0_DISABLE = 0,  /*!< DISABLE : Capture function disabled.                                      */
  SECURESTIMER_SCAPCTRL0_CAPTURE0_ENABLE = 1,   /*!< ENABLE : Capture function enabled.                                        */
} SECURESTIMER_SCAPCTRL0_CAPTURE0_Enum;

/* =========================================  SECURESTIMER SCAPCTRL0 STPOL0 [8..8]  ========================================== */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL0_STPOL0                                             */
  SECURESTIMER_SCAPCTRL0_STPOL0_CAPLH  = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  SECURESTIMER_SCAPCTRL0_STPOL0_CAPHL  = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} SECURESTIMER_SCAPCTRL0_STPOL0_Enum;

/* =======================================================  SCAPCTRL1  ======================================================= */
/* ========================================  SECURESTIMER SCAPCTRL1 CAPTURE1 [9..9]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL1_CAPTURE1                                           */
  SECURESTIMER_SCAPCTRL1_CAPTURE1_DISABLE = 0,  /*!< DISABLE : Capture function disabled.                                      */
  SECURESTIMER_SCAPCTRL1_CAPTURE1_ENABLE = 1,   /*!< ENABLE : Capture function enabled.                                        */
} SECURESTIMER_SCAPCTRL1_CAPTURE1_Enum;

/* =========================================  SECURESTIMER SCAPCTRL1 STPOL1 [8..8]  ========================================== */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL1_STPOL1                                             */
  SECURESTIMER_SCAPCTRL1_STPOL1_CAPLH  = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  SECURESTIMER_SCAPCTRL1_STPOL1_CAPHL  = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} SECURESTIMER_SCAPCTRL1_STPOL1_Enum;

/* =======================================================  SCAPCTRL2  ======================================================= */
/* ========================================  SECURESTIMER SCAPCTRL2 CAPTURE2 [9..9]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL2_CAPTURE2                                           */
  SECURESTIMER_SCAPCTRL2_CAPTURE2_DISABLE = 0,  /*!< DISABLE : Capture function disabled.                                      */
  SECURESTIMER_SCAPCTRL2_CAPTURE2_ENABLE = 1,   /*!< ENABLE : Capture function enabled.                                        */
} SECURESTIMER_SCAPCTRL2_CAPTURE2_Enum;

/* =========================================  SECURESTIMER SCAPCTRL2 STPOL2 [8..8]  ========================================== */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL2_STPOL2                                             */
  SECURESTIMER_SCAPCTRL2_STPOL2_CAPLH  = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  SECURESTIMER_SCAPCTRL2_STPOL2_CAPHL  = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} SECURESTIMER_SCAPCTRL2_STPOL2_Enum;

/* =======================================================  SCAPCTRL3  ======================================================= */
/* ========================================  SECURESTIMER SCAPCTRL3 CAPTURE3 [9..9]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL3_CAPTURE3                                           */
  SECURESTIMER_SCAPCTRL3_CAPTURE3_DISABLE = 0,  /*!< DISABLE : Capture function disabled.                                      */
  SECURESTIMER_SCAPCTRL3_CAPTURE3_ENABLE = 1,   /*!< ENABLE : Capture function enabled.                                        */
} SECURESTIMER_SCAPCTRL3_CAPTURE3_Enum;

/* =========================================  SECURESTIMER SCAPCTRL3 STPOL3 [8..8]  ========================================== */
typedef enum {                                  /*!< SECURESTIMER_SCAPCTRL3_STPOL3                                             */
  SECURESTIMER_SCAPCTRL3_STPOL3_CAPLH  = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  SECURESTIMER_SCAPCTRL3_STPOL3_CAPHL  = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} SECURESTIMER_SCAPCTRL3_STPOL3_Enum;

/* ========================================================  SCMPR0  ========================================================= */
/* ========================================================  SCMPR1  ========================================================= */
/* ========================================================  SCMPR2  ========================================================= */
/* ========================================================  SCMPR3  ========================================================= */
/* ========================================================  SCMPR4  ========================================================= */
/* ========================================================  SCMPR5  ========================================================= */
/* ========================================================  SCMPR6  ========================================================= */
/* ========================================================  SCMPR7  ========================================================= */
/* ========================================================  SCAPT0  ========================================================= */
/* ========================================================  SCAPT1  ========================================================= */
/* ========================================================  SCAPT2  ========================================================= */
/* ========================================================  SCAPT3  ========================================================= */
/* =========================================================  SNVR0  ========================================================= */
/* =========================================================  SNVR1  ========================================================= */
/* =========================================================  SNVR2  ========================================================= */
/* =========================================================  SNVR3  ========================================================= */
/* =======================================================  STMINTEN  ======================================================== */
/* ========================================  SECURESTIMER STMINTEN CAPTURED [12..12]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_CAPTURED                                            */
  SECURESTIMER_STMINTEN_CAPTURED_CAPD_INT = 1,  /*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  SECURESTIMER_STMINTEN_CAPTURED_CAPD_DEFAULT = 0,/*!< CAPD_DEFAULT : Capture D interrupt status default/not set.              */
} SECURESTIMER_STMINTEN_CAPTURED_Enum;

/* ========================================  SECURESTIMER STMINTEN CAPTUREC [11..11]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_CAPTUREC                                            */
  SECURESTIMER_STMINTEN_CAPTUREC_CAPC_INT = 1,  /*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  SECURESTIMER_STMINTEN_CAPTUREC_CAPC_DEFAULT = 0,/*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.              */
} SECURESTIMER_STMINTEN_CAPTUREC_Enum;

/* ========================================  SECURESTIMER STMINTEN CAPTUREB [10..10]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_CAPTUREB                                            */
  SECURESTIMER_STMINTEN_CAPTUREB_CAPB_INT = 1,  /*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  SECURESTIMER_STMINTEN_CAPTUREB_CAPB_DEFAULT = 0,/*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.              */
} SECURESTIMER_STMINTEN_CAPTUREB_Enum;

/* =========================================  SECURESTIMER STMINTEN CAPTUREA [9..9]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_CAPTUREA                                            */
  SECURESTIMER_STMINTEN_CAPTUREA_CAPA_INT = 1,  /*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  SECURESTIMER_STMINTEN_CAPTUREA_CAPA_DEFAULT = 0,/*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.              */
} SECURESTIMER_STMINTEN_CAPTUREA_Enum;

/* =========================================  SECURESTIMER STMINTEN OVERFLOW [8..8]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_OVERFLOW                                            */
  SECURESTIMER_STMINTEN_OVERFLOW_OFLOW_INT = 1, /*!< OFLOW_INT : Overflow interrupt status bit was set.                        */
  SECURESTIMER_STMINTEN_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.         */
} SECURESTIMER_STMINTEN_OVERFLOW_Enum;

/* =========================================  SECURESTIMER STMINTEN COMPAREH [7..7]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPAREH                                            */
  SECURESTIMER_STMINTEN_COMPAREH_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPAREH_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPAREH_Enum;

/* =========================================  SECURESTIMER STMINTEN COMPAREG [6..6]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPAREG                                            */
  SECURESTIMER_STMINTEN_COMPAREG_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPAREG_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPAREG_Enum;

/* =========================================  SECURESTIMER STMINTEN COMPAREF [5..5]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPAREF                                            */
  SECURESTIMER_STMINTEN_COMPAREF_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPAREF_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPAREF_Enum;

