zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ========================================  SECURESTIMER STMINTSET COMPAREG [6..6]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPAREG                                           */
  SECURESTIMER_STMINTSET_COMPAREG_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPAREG_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPAREG_Enum;

/* ========================================  SECURESTIMER STMINTSET COMPAREF [5..5]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPAREF                                           */
  SECURESTIMER_STMINTSET_COMPAREF_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPAREF_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPAREF_Enum;

/* ========================================  SECURESTIMER STMINTSET COMPAREE [4..4]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPAREE                                           */
  SECURESTIMER_STMINTSET_COMPAREE_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPAREE_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPAREE_Enum;

/* ========================================  SECURESTIMER STMINTSET COMPARED [3..3]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPARED                                           */
  SECURESTIMER_STMINTSET_COMPARED_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPARED_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPARED_Enum;

/* ========================================  SECURESTIMER STMINTSET COMPAREC [2..2]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPAREC                                           */
  SECURESTIMER_STMINTSET_COMPAREC_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPAREC_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPAREC_Enum;

/* ========================================  SECURESTIMER STMINTSET COMPAREB [1..1]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPAREB                                           */
  SECURESTIMER_STMINTSET_COMPAREB_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPAREB_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPAREB_Enum;

/* ========================================  SECURESTIMER STMINTSET COMPAREA [0..0]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPAREA                                           */
  SECURESTIMER_STMINTSET_COMPAREA_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPAREA_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPAREA_Enum;



/* =========================================================================================================================== */
/* ================                                        SECURETIMER                                        ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ========================================================  STATUS  ========================================================= */
/* ========================================================  GLOBEN  ========================================================= */
/* ===========================================  SECURETIMER GLOBEN ADCEN [30..30]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_GLOBEN_ADCEN                                                  */
  SECURETIMER_GLOBEN_ADCEN_EN          = 1,     /*!< EN : Timer Enabled. TMREN enable is used.                                 */
  SECURETIMER_GLOBEN_ADCEN_DIS         = 0,     /*!< DIS : Disable TIMER .                                                     */
} SECURETIMER_GLOBEN_ADCEN_Enum;

/* ======================================  SECURETIMER GLOBEN ENABLEALLINPUTS [29..29]  ====================================== */
typedef enum {                                  /*!< SECURETIMER_GLOBEN_ENABLEALLINPUTS                                        */
  SECURETIMER_GLOBEN_ENABLEALLINPUTS_EN = 1,    /*!< EN : Override to enable all inputs from GPIO                              */
  SECURETIMER_GLOBEN_ENABLEALLINPUTS_DIS = 0,   /*!< DIS : Normal mode where inputs from GPIO are enabled based on
                                                     enabled clock and triggers.                                               */
} SECURETIMER_GLOBEN_ENABLEALLINPUTS_Enum;

/* ============================================  SECURETIMER GLOBEN ENB3 [3..3]  ============================================= */
typedef enum {                                  /*!< SECURETIMER_GLOBEN_ENB3                                                   */
  SECURETIMER_GLOBEN_ENB3_EN           = 1,     /*!< EN : Timer Enabled. TMR3EN enable is used.                                */
  SECURETIMER_GLOBEN_ENB3_DIS          = 0,     /*!< DIS : Disable TIMER 3.                                                    */
} SECURETIMER_GLOBEN_ENB3_Enum;

