zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  SECURETIMER OUTCFG6 OUTCFG25 [8..13]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG6_OUTCFG25                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG6_OUTCFG25_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG6_OUTCFG25_Enum;

/* ==========================================  SECURETIMER OUTCFG6 OUTCFG24 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG6_OUTCFG24                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG6_OUTCFG24_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG6_OUTCFG24_Enum;

/* ========================================================  OUTCFG7  ======================================================== */
/* =========================================  SECURETIMER OUTCFG7 OUTCFG31 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG7_OUTCFG31                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG7_OUTCFG31_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG7_OUTCFG31_Enum;

/* =========================================  SECURETIMER OUTCFG7 OUTCFG30 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG7_OUTCFG30                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG7_OUTCFG30_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG7_OUTCFG30_Enum;

/* =========================================  SECURETIMER OUTCFG7 OUTCFG29 [8..13]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG7_OUTCFG29                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG7_OUTCFG29_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG7_OUTCFG29_Enum;

/* ==========================================  SECURETIMER OUTCFG7 OUTCFG28 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG7_OUTCFG28                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG7_OUTCFG28_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG7_OUTCFG28_Enum;

/* ========================================================  OUTCFG8  ======================================================== */
/* =========================================  SECURETIMER OUTCFG8 OUTCFG35 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG8_OUTCFG35                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG8_OUTCFG35_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG8_OUTCFG35_Enum;

/* =========================================  SECURETIMER OUTCFG8 OUTCFG34 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG8_OUTCFG34                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG8_OUTCFG34_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG8_OUTCFG34_Enum;

/* =========================================  SECURETIMER OUTCFG8 OUTCFG33 [8..13]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG8_OUTCFG33                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG8_OUTCFG33_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG8_OUTCFG33_Enum;

