zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  SECURETIMER OUTCFG9 OUTCFG37 [8..13]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG9_OUTCFG37                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG9_OUTCFG37_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG9_OUTCFG37_Enum;

/* ==========================================  SECURETIMER OUTCFG9 OUTCFG36 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG9_OUTCFG36                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG9_OUTCFG36_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG9_OUTCFG36_Enum;

/* =======================================================  OUTCFG10  ======================================================== */
/* ========================================  SECURETIMER OUTCFG10 OUTCFG43 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG10_OUTCFG43                                             */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG10_OUTCFG43_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG10_OUTCFG43_Enum;

/* ========================================  SECURETIMER OUTCFG10 OUTCFG42 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG10_OUTCFG42                                             */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG10_OUTCFG42_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG10_OUTCFG42_Enum;

