zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  SECURETIMER OUTCFG12 OUTCFG48 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG12_OUTCFG48                                             */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG12_OUTCFG48_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG12_OUTCFG48_Enum;

/* =======================================================  OUTCFG13  ======================================================== */
/* ========================================  SECURETIMER OUTCFG13 OUTCFG55 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG13_OUTCFG55                                             */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG13_OUTCFG55_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG13_OUTCFG55_Enum;

/* ========================================  SECURETIMER OUTCFG13 OUTCFG54 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG13_OUTCFG54                                             */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG13_OUTCFG54_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG13_OUTCFG54_Enum;

/* =========================================  SECURETIMER OUTCFG13 OUTCFG53 [8..13]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG13_OUTCFG53                                             */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG13_OUTCFG53_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG13_OUTCFG53_Enum;

/* =========================================  SECURETIMER OUTCFG13 OUTCFG52 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG13_OUTCFG52                                             */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG13_OUTCFG52_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG13_OUTCFG52_Enum;

