zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  SECURETIMER OUTCFG19 OUTCFG76 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG19_OUTCFG76                                             */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG19_OUTCFG76_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG19_OUTCFG76_Enum;

/* =======================================================  OUTCFG20  ======================================================== */
/* ========================================  SECURETIMER OUTCFG20 OUTCFG83 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG20_OUTCFG83                                             */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG20_OUTCFG83_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG20_OUTCFG83_Enum;

/* ========================================  SECURETIMER OUTCFG20 OUTCFG82 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG20_OUTCFG82                                             */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG20_OUTCFG82_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG20_OUTCFG82_Enum;

/* =========================================  SECURETIMER OUTCFG20 OUTCFG81 [8..13]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG20_OUTCFG81                                             */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG20_OUTCFG81_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG20_OUTCFG81_Enum;

/* =========================================  SECURETIMER OUTCFG20 OUTCFG80 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG20_OUTCFG80                                             */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG20_OUTCFG80_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG20_OUTCFG80_Enum;

/* =======================================================  OUTCFG21  ======================================================== */
/* ========================================  SECURETIMER OUTCFG21 OUTCFG87 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG21_OUTCFG87                                             */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG21_OUTCFG87_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG21_OUTCFG87_Enum;

/* ========================================  SECURETIMER OUTCFG21 OUTCFG86 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG21_OUTCFG86                                             */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG21_OUTCFG86_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG21_OUTCFG86_Enum;

/* =========================================  SECURETIMER OUTCFG21 OUTCFG85 [8..13]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG21_OUTCFG85                                             */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG21_OUTCFG85_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG21_OUTCFG85_Enum;

