zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================  SECURETIMER OUTCFG23 OUTCFG92 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG23_OUTCFG92                                             */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG23_OUTCFG92_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG23_OUTCFG92_Enum;

/* =======================================================  OUTCFG24  ======================================================== */
/* ========================================  SECURETIMER OUTCFG24 OUTCFG99 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG24_OUTCFG99                                             */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG24_OUTCFG99_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG24_OUTCFG99_Enum;

/* ========================================  SECURETIMER OUTCFG24 OUTCFG98 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG24_OUTCFG98                                             */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG24_OUTCFG98_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG24_OUTCFG98_Enum;

/* =========================================  SECURETIMER OUTCFG24 OUTCFG97 [8..13]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG24_OUTCFG97                                             */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG24_OUTCFG97_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG24_OUTCFG97_Enum;

/* =========================================  SECURETIMER OUTCFG24 OUTCFG96 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG24_OUTCFG96                                             */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER00 = 0,    /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER01 = 1,    /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER10 = 2,    /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER11 = 3,    /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER20 = 4,    /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER21 = 5,    /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER30 = 6,    /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_TIMER31 = 7,    /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER0 = 8,    /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER1 = 9,    /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER2 = 10,   /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER3 = 11,   /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER4 = 12,   /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER5 = 13,   /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER6 = 14,   /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_STIMER7 = 15,   /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG24_OUTCFG96_DISABLED = 63,  /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG24_OUTCFG96_Enum;

