zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =======================================================  OUTCFG25  ======================================================== */
/* ========================================  SECURETIMER OUTCFG25 OUTCFG103 [24..29]  ======================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG25_OUTCFG103                                            */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG25_OUTCFG103_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG25_OUTCFG103_Enum;

/* ========================================  SECURETIMER OUTCFG25 OUTCFG102 [16..21]  ======================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG25_OUTCFG102                                            */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG25_OUTCFG102_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG25_OUTCFG102_Enum;

/* ========================================  SECURETIMER OUTCFG25 OUTCFG101 [8..13]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG25_OUTCFG101                                            */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG25_OUTCFG101_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG25_OUTCFG101_Enum;

/* =========================================  SECURETIMER OUTCFG25 OUTCFG100 [0..5]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG25_OUTCFG100                                            */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG25_OUTCFG100_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG25_OUTCFG100_Enum;

/* =======================================================  OUTCFG26  ======================================================== */
/* ========================================  SECURETIMER OUTCFG26 OUTCFG107 [24..29]  ======================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG26_OUTCFG107                                            */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG26_OUTCFG107_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG26_OUTCFG107_Enum;

