zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ===========================================  SECURETIMER CTRL2 TMR2POL0 [2..2]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_CTRL2_TMR2POL0                                                */
  SECURETIMER_CTRL2_TMR2POL0_NORMAL    = 0,     /*!< NORMAL : The polarity of the TMR2OUT0 pin is the same as the
                                                     timer output.                                                             */
  SECURETIMER_CTRL2_TMR2POL0_INVERTED  = 1,     /*!< INVERTED : The polarity of the TMR2OUT0 pin is the inverse of
                                                     the timer output.                                                         */
} SECURETIMER_CTRL2_TMR2POL0_Enum;

/* ===========================================  SECURETIMER CTRL2 TMR2CLR [1..1]  ============================================ */
typedef enum {                                  /*!< SECURETIMER_CTRL2_TMR2CLR                                                 */
  SECURETIMER_CTRL2_TMR2CLR_CLEAR      = 1,     /*!< CLEAR : When written to a 1, the timer will automatically be
                                                     cleared to its reset state # (0 for count up counter, CMP0
                                                     for down counter)                                                         */
  SECURETIMER_CTRL2_TMR2CLR_DEFAULT    = 0,     /*!< DEFAULT : Default value set to 0. Timer works normally.                   */
} SECURETIMER_CTRL2_TMR2CLR_Enum;

/* ============================================  SECURETIMER CTRL2 TMR2EN [0..0]  ============================================ */
typedef enum {                                  /*!< SECURETIMER_CTRL2_TMR2EN                                                  */
  SECURETIMER_CTRL2_TMR2EN_DIS         = 0,     /*!< DIS : Counter/Timer 2 Disable.                                            */
  SECURETIMER_CTRL2_TMR2EN_EN          = 1,     /*!< EN : Counter/Timer 2 Enable.                                              */
} SECURETIMER_CTRL2_TMR2EN_Enum;

/* ========================================================  TIMER2  ========================================================= */
/* =======================================================  TMR2CMP0  ======================================================== */
/* =======================================================  TMR2CMP1  ======================================================== */
/* =========================================================  MODE2  ========================================================= */
/* =========================================  SECURETIMER MODE2 TMR2TRIGSEL [8..15]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_MODE2_TMR2TRIGSEL                                             */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR00  = 0,     /*!< TMR00 : Trigger source is TIMER 0 Output 0                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR01  = 1,     /*!< TMR01 : Trigger source is TIMER 0 Output 1                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR10  = 2,     /*!< TMR10 : Trigger source is TIMER 1 Output 0                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR11  = 3,     /*!< TMR11 : Trigger source is TIMER 1 Output 1                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR20  = 4,     /*!< TMR20 : Trigger source is TIMER 2 Output 0                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR21  = 5,     /*!< TMR21 : Trigger source is TIMER 2 Output 1                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR30  = 6,     /*!< TMR30 : Trigger source is TIMER 3 Output 0                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_TMR31  = 7,     /*!< TMR31 : Trigger source is TIMER 3 Output 1                                */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP00 = 48, /*!< STMRCMP00 : Trigger source is STIMER Compare 0                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP10 = 49, /*!< STMRCMP10 : Trigger source is STIMER Compare 1                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP20 = 50, /*!< STMRCMP20 : Trigger source is STIMER Compare 2                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP30 = 51, /*!< STMRCMP30 : Trigger source is STIMER Compare 3                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP40 = 52, /*!< STMRCMP40 : Trigger source is STIMER Compare 4                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP50 = 53, /*!< STMRCMP50 : Trigger source is STIMER Compare 5                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP60 = 54, /*!< STMRCMP60 : Trigger source is STIMER Compare 6                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCMP70 = 55, /*!< STMRCMP70 : Trigger source is STIMER Compare 7                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCAP00 = 56, /*!< STMRCAP00 : Trigger source is STIMER Capture 0                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCAP10 = 57, /*!< STMRCAP10 : Trigger source is STIMER Capture 1                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCAP20 = 58, /*!< STMRCAP20 : Trigger source is STIMER Capture 2                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_STMRCAP30 = 59, /*!< STMRCAP30 : Trigger source is STIMER Capture 3                            */
  SECURETIMER_MODE2_TMR2TRIGSEL_GPIO0  = 128,   /*!< GPIO0 : Trigger source is GPIO #0                                         */
  SECURETIMER_MODE2_TMR2TRIGSEL_GPIOn  = 129,   /*!< GPIOn : GPIO #n is the trigger source where n ranges from 1
                                                     thru 118. The values for GPIO1 - GPIO118 are in the range
                                                     0x81 - 0xF6. i.e., GPIO0 + n                                              */
  SECURETIMER_MODE2_TMR2TRIGSEL_GPIO119 = 247,  /*!< GPIO119 : Trigger source is GPIO #119.                                    */
} SECURETIMER_MODE2_TMR2TRIGSEL_Enum;

