zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ============================================  SECURETIMER CTRL3 TMR3EN [0..0]  ============================================ */
typedef enum {                                  /*!< SECURETIMER_CTRL3_TMR3EN                                                  */
  SECURETIMER_CTRL3_TMR3EN_DIS         = 0,     /*!< DIS : Counter/Timer 3 Disable.                                            */
  SECURETIMER_CTRL3_TMR3EN_EN          = 1,     /*!< EN : Counter/Timer 3 Enable.                                              */
} SECURETIMER_CTRL3_TMR3EN_Enum;

/* ========================================================  TIMER3  ========================================================= */
/* =======================================================  TMR3CMP0  ======================================================== */
/* =======================================================  TMR3CMP1  ======================================================== */
/* =========================================================  MODE3  ========================================================= */
/* =========================================  SECURETIMER MODE3 TMR3TRIGSEL [8..15]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_MODE3_TMR3TRIGSEL                                             */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR00  = 0,     /*!< TMR00 : Trigger source is TIMER 0 Output 0                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR01  = 1,     /*!< TMR01 : Trigger source is TIMER 0 Output 1                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR10  = 2,     /*!< TMR10 : Trigger source is TIMER 1 Output 0                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR11  = 3,     /*!< TMR11 : Trigger source is TIMER 1 Output 1                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR20  = 4,     /*!< TMR20 : Trigger source is TIMER 2 Output 0                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR21  = 5,     /*!< TMR21 : Trigger source is TIMER 2 Output 1                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR30  = 6,     /*!< TMR30 : Trigger source is TIMER 3 Output 0                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_TMR31  = 7,     /*!< TMR31 : Trigger source is TIMER 3 Output 1                                */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP00 = 48, /*!< STMRCMP00 : Trigger source is STIMER Compare 0                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP10 = 49, /*!< STMRCMP10 : Trigger source is STIMER Compare 1                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP20 = 50, /*!< STMRCMP20 : Trigger source is STIMER Compare 2                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP30 = 51, /*!< STMRCMP30 : Trigger source is STIMER Compare 3                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP40 = 52, /*!< STMRCMP40 : Trigger source is STIMER Compare 4                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP50 = 53, /*!< STMRCMP50 : Trigger source is STIMER Compare 5                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP60 = 54, /*!< STMRCMP60 : Trigger source is STIMER Compare 6                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCMP70 = 55, /*!< STMRCMP70 : Trigger source is STIMER Compare 7                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCAP00 = 56, /*!< STMRCAP00 : Trigger source is STIMER Capture 0                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCAP10 = 57, /*!< STMRCAP10 : Trigger source is STIMER Capture 1                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCAP20 = 58, /*!< STMRCAP20 : Trigger source is STIMER Capture 2                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_STMRCAP30 = 59, /*!< STMRCAP30 : Trigger source is STIMER Capture 3                            */
  SECURETIMER_MODE3_TMR3TRIGSEL_GPIO0  = 128,   /*!< GPIO0 : Trigger source is GPIO #0                                         */
  SECURETIMER_MODE3_TMR3TRIGSEL_GPIOn  = 129,   /*!< GPIOn : GPIO #n is the trigger source where n ranges from 1
                                                     thru 118. The values for GPIO1 - GPIO118 are in the range
                                                     0x81 - 0xF6. i.e., GPIO0 + n                                              */
  SECURETIMER_MODE3_TMR3TRIGSEL_GPIO119 = 247,  /*!< GPIO119 : Trigger source is GPIO #119.                                    */
} SECURETIMER_MODE3_TMR3TRIGSEL_Enum;

/* ======================================================  TMR3LMTVAL  ======================================================= */
/* ======================================================  TIMERSPARES  ====================================================== */


/* =========================================================================================================================== */
/* ================                                         SECUREWDT                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* =============================================  SECUREWDT CFG CLKSEL [24..26]  ============================================= */
typedef enum {                                  /*!< SECUREWDT_CFG_CLKSEL                                                      */
  SECUREWDT_CFG_CLKSEL_OFF             = 0,     /*!< OFF : Low Power Mode. This setting disables the watch dog timer.
                                                     LFRC is 900Hz.                                                            */
  SECUREWDT_CFG_CLKSEL_LFRC_112HZ      = 1,     /*!< LFRC_112HZ : 112 Hz LFRC clock. (LFRC/8)                                  */
  SECUREWDT_CFG_CLKSEL_LFRC_14HZ       = 2,     /*!< LFRC_14HZ : 14 Hz LFRC clock. (LFRC/64)                                   */
  SECUREWDT_CFG_CLKSEL_LFRC_0_88HZ     = 3,     /*!< LFRC_0_88HZ : 0.88 Hz LFRC clock. (LFRC1024)                              */
  SECUREWDT_CFG_CLKSEL_LFRC_0_055HZ    = 4,     /*!< LFRC_0_055HZ : 0.055 HZ LFRC clock (LFRC/16K)                             */
} SECUREWDT_CFG_CLKSEL_Enum;

/* =========================================================  RSTRT  ========================================================= */
/* =============================================  SECUREWDT RSTRT RSTRT [0..7]  ============================================== */
typedef enum {                                  /*!< SECUREWDT_RSTRT_RSTRT                                                     */
  SECUREWDT_RSTRT_RSTRT_KEYVALUE       = 178,   /*!< KEYVALUE : This is the key value to write to WDTRSTRT to restart
                                                     the WDT. This is a write only register.                                   */
  SECUREWDT_RSTRT_RSTRT_DEFAULT        = 0,     /*!< DEFAULT : Default/Reset value. This is a write only register.             */
} SECUREWDT_RSTRT_RSTRT_Enum;

/* =========================================================  LOCK  ========================================================== */
/* ==============================================  SECUREWDT LOCK LOCK [0..7]  =============================================== */
typedef enum {                                  /*!< SECUREWDT_LOCK_LOCK                                                       */
  SECUREWDT_LOCK_LOCK_KEYVALUE         = 58,    /*!< KEYVALUE : This is the key value to write to WDTLOCK to lock
                                                     the WDT.                                                                  */
  SECUREWDT_LOCK_LOCK_DEFAULT          = 0,     /*!< DEFAULT : Default/Reset value.                                            */
} SECUREWDT_LOCK_LOCK_Enum;

/* =========================================================  COUNT  ========================================================= */
/* =======================================================  WDTIEREN  ======================================================== */
/* ======================================================  WDTIERSTAT  ======================================================= */
/* =======================================================  WDTIERCLR  ======================================================= */
/* =======================================================  WDTIERSET  ======================================================= */


/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* =============================================  SECURITY CTRL FUNCTION [4..7]  ============================================= */
typedef enum {                                  /*!< SECURITY_CTRL_FUNCTION                                                    */
  SECURITY_CTRL_FUNCTION_CRC32         = 0,     /*!< CRC32 : Perform CRC32 operation                                           */
  SECURITY_CTRL_FUNCTION_RAND          = 1,     /*!< RAND : DMA pseudo-random number stream based on CRC value                 */
  SECURITY_CTRL_FUNCTION_GENADDR       = 2,     /*!< GENADDR : Generate DMA stream based on address                            */
} SECURITY_CTRL_FUNCTION_Enum;

