zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* ================================================  UART0 DR PEDATA [9..9]  ================================================= */
typedef enum {                                  /*!< UART0_DR_PEDATA                                                           */
  UART0_DR_PEDATA_NOERR                = 0,     /*!< NOERR : No error on UART PEDATA, parity error indicator.                  */
  UART0_DR_PEDATA_ERR                  = 1,     /*!< ERR : Error on UART PEDATA, parity error indicator.                       */
} UART0_DR_PEDATA_Enum;

/* ================================================  UART0 DR FEDATA [8..8]  ================================================= */
typedef enum {                                  /*!< UART0_DR_FEDATA                                                           */
  UART0_DR_FEDATA_NOERR                = 0,     /*!< NOERR : No error on UART FEDATA, framing error indicator.                 */
  UART0_DR_FEDATA_ERR                  = 1,     /*!< ERR : Error on UART FEDATA, framing error indicator.                      */
} UART0_DR_FEDATA_Enum;

/* ==========================================================  RSR  ========================================================== */
/* ================================================  UART0 RSR DMAERR [5..5]  ================================================ */
typedef enum {                                  /*!< UART0_RSR_DMAERR                                                          */
  UART0_RSR_DMAERR_NOERR               = 0,     /*!< NOERR : DMA transfer no error indicator.                                  */
  UART0_RSR_DMAERR_ERROR               = 1,     /*!< ERROR : DMA transfer error indicator.                                     */
} UART0_RSR_DMAERR_Enum;

/* ================================================  UART0 RSR DMACPL [4..4]  ================================================ */
typedef enum {                                  /*!< UART0_RSR_DMACPL                                                          */
  UART0_RSR_DMACPL_NOCPL               = 0,     /*!< NOCPL : DMA transfer not complete indicator.                              */
  UART0_RSR_DMACPL_CPL                 = 1,     /*!< CPL : DMA transfer complete indicator.                                    */
} UART0_RSR_DMACPL_Enum;

/* ================================================  UART0 RSR OESTAT [3..3]  ================================================ */
typedef enum {                                  /*!< UART0_RSR_OESTAT                                                          */
  UART0_RSR_OESTAT_NOERR               = 0,     /*!< NOERR : No error on UART OESTAT, overrun error indicator.                 */
  UART0_RSR_OESTAT_ERR                 = 1,     /*!< ERR : Error on UART OESTAT, overrun error indicator.                      */
} UART0_RSR_OESTAT_Enum;

/* ================================================  UART0 RSR BESTAT [2..2]  ================================================ */
typedef enum {                                  /*!< UART0_RSR_BESTAT                                                          */
  UART0_RSR_BESTAT_NOERR               = 0,     /*!< NOERR : No error on UART BESTAT, break error indicator.                   */
  UART0_RSR_BESTAT_ERR                 = 1,     /*!< ERR : Error on UART BESTAT, break error indicator.                        */
} UART0_RSR_BESTAT_Enum;

/* ================================================  UART0 RSR PESTAT [1..1]  ================================================ */
typedef enum {                                  /*!< UART0_RSR_PESTAT                                                          */
  UART0_RSR_PESTAT_NOERR               = 0,     /*!< NOERR : No error on UART PESTAT, parity error indicator.                  */
  UART0_RSR_PESTAT_ERR                 = 1,     /*!< ERR : Error on UART PESTAT, parity error indicator.                       */
} UART0_RSR_PESTAT_Enum;

/* ================================================  UART0 RSR FESTAT [0..0]  ================================================ */
typedef enum {                                  /*!< UART0_RSR_FESTAT                                                          */
  UART0_RSR_FESTAT_NOERR               = 0,     /*!< NOERR : No error on UART FESTAT, framing error indicator.                 */
  UART0_RSR_FESTAT_ERR                 = 1,     /*!< ERR : Error on UART FESTAT, framing error indicator.                      */
} UART0_RSR_FESTAT_Enum;

/* ==========================================================  FR  =========================================================== */
/* ================================================  UART0 FR TXBUSY [8..8]  ================================================= */
typedef enum {                                  /*!< UART0_FR_TXBUSY                                                           */
  UART0_FR_TXBUSY_XMT_BUSY             = 1,     /*!< XMT_BUSY : Indicates that a transmit operation is in progress.
                                                     That is, the transmit FIFO is not empty or the last character
                                                     has not yet been shifted out. TXBUSY is only cleared when
                                                     the transmit buffer is empty and the final character has
                                                     been fully sent.                                                          */
  UART0_FR_TXBUSY_XMT_AVAILABLE        = 0,     /*!< XMT_AVAILABLE : Indicates that no transmit operation is in progress.
                                                     That is, the transmit FIFO is empty and the last bit of
                                                     the last character, including the stop bit, has been transmitted.
                                                     Clearing of TXBUSY will trigger a TXCMP (transmit complete)
                                                     interrupt when enabled.                                                   */
} UART0_FR_TXBUSY_Enum;

