zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =================================================  UART0 FR TXFE [7..7]  ================================================== */
typedef enum {                                  /*!< UART0_FR_TXFE                                                             */
  UART0_FR_TXFE_XMTFIFO_EMPTY          = 1,     /*!< XMTFIFO_EMPTY : Transmit fifo is empty.                                   */
  UART0_FR_TXFE_XMTFIFO_NOTEMPTY       = 0,     /*!< XMTFIFO_NOTEMPTY : Transmit fifo is not empty.                            */
} UART0_FR_TXFE_Enum;

/* =================================================  UART0 FR RXFF [6..6]  ================================================== */
typedef enum {                                  /*!< UART0_FR_RXFF                                                             */
  UART0_FR_RXFF_RCVFIFO_FULL           = 1,     /*!< RCVFIFO_FULL : Receive fifo is full.                                      */
  UART0_FR_RXFF_RCVFIFO_NOTFULL        = 0,     /*!< RCVFIFO_NOTFULL : Receive fifo is not full.                               */
} UART0_FR_RXFF_Enum;

/* =================================================  UART0 FR TXFF [5..5]  ================================================== */
typedef enum {                                  /*!< UART0_FR_TXFF                                                             */
  UART0_FR_TXFF_XMTFIFO_FULL           = 1,     /*!< XMTFIFO_FULL : Transmit fifo is full.                                     */
  UART0_FR_TXFF_XMTFIFO_NOTFULL        = 0,     /*!< XMTFIFO_NOTFULL : Transmit fifo is not full.                              */
} UART0_FR_TXFF_Enum;

/* =================================================  UART0 FR RXFE [4..4]  ================================================== */
typedef enum {                                  /*!< UART0_FR_RXFE                                                             */
  UART0_FR_RXFE_RCVFIFO_EMPTY          = 1,     /*!< RCVFIFO_EMPTY : Receive fifo is empty.                                    */
  UART0_FR_RXFE_RCVFIFO_NOTEMPTY       = 0,     /*!< RCVFIFO_NOTEMPTY : Receive fifo is not empty.                             */
} UART0_FR_RXFE_Enum;

/* =================================================  UART0 FR BUSY [3..3]  ================================================== */
typedef enum {                                  /*!< UART0_FR_BUSY                                                             */
  UART0_FR_BUSY_BUSY                   = 1,     /*!< BUSY : UART busy indicator.                                               */
  UART0_FR_BUSY_NOTBUSY                = 0,     /*!< NOTBUSY : UART not busy.                                                  */
} UART0_FR_BUSY_Enum;

/* ==================================================  UART0 FR DCD [2..2]  ================================================== */
typedef enum {                                  /*!< UART0_FR_DCD                                                              */
  UART0_FR_DCD_DETECTED                = 1,     /*!< DETECTED : Data carrier detect detected.                                  */
  UART0_FR_DCD_DEFAULT                 = 0,     /*!< DEFAULT : Data carrier detect not detected/default.                       */
} UART0_FR_DCD_Enum;

/* ==================================================  UART0 FR DSR [1..1]  ================================================== */
typedef enum {                                  /*!< UART0_FR_DSR                                                              */
  UART0_FR_DSR_READY                   = 1,     /*!< READY : Data set ready.                                                   */
  UART0_FR_DSR_NOTREADY                = 0,     /*!< NOTREADY : Data set not ready/default.                                    */
} UART0_FR_DSR_Enum;

/* ==================================================  UART0 FR CTS [0..0]  ================================================== */
typedef enum {                                  /*!< UART0_FR_CTS                                                              */
  UART0_FR_CTS_CLEARTOSEND             = 1,     /*!< CLEARTOSEND : Clear to send is indicated.                                 */
  UART0_FR_CTS_DEFAULT                 = 0,     /*!< DEFAULT : Clear to send default value.                                    */
} UART0_FR_CTS_Enum;

/* =========================================================  ILPR  ========================================================== */
/* =========================================================  IBRD  ========================================================== */
/* =========================================================  FBRD  ========================================================== */
/* =========================================================  LCRH  ========================================================== */
/* ==========================================================  CR  =========================================================== */
/* =========================================================  IFLS  ========================================================== */
/* ==========================================================  IER  ========================================================== */
/* ==========================================================  IES  ========================================================== */
/* ==========================================================  MIS  ========================================================== */
/* ==========================================================  IEC  ========================================================== */
/* ==========================================================  DCR  ========================================================== */
/* ================================================  UART0 DCR DMAPRI [3..3]  ================================================ */
typedef enum {                                  /*!< UART0_DCR_DMAPRI                                                          */
  UART0_DCR_DMAPRI_LOW                 = 0,     /*!< LOW : Low Priority (service as best effort).                              */
  UART0_DCR_DMAPRI_HIGH                = 1,     /*!< HIGH : High Priority (service immediately).                               */
} UART0_DCR_DMAPRI_Enum;

/* =======================================================  TARGADDR  ======================================================== */
/* =========================================================  COUNT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          USBPHY                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  REG00  ========================================================= */
/* =========================================================  REG04  ========================================================= */
/* =========================================================  REG08  ========================================================= */
/* =========================================================  REG0C  ========================================================= */
/* =========================================================  REG10  ========================================================= */
/* =========================================================  REG14  ========================================================= */
/* =========================================================  REG18  ========================================================= */
/* =========================================================  REG1C  ========================================================= */
/* =========================================================  REG20  ========================================================= */
/* =========================================================  REG24  ========================================================= */
/* =========================================================  REG28  ========================================================= */
/* =========================================================  REG2C  ========================================================= */
/* =========================================================  REG30  ========================================================= */
/* =========================================================  REG34  ========================================================= */
/* =========================================================  REG38  ========================================================= */
/* =========================================================  REG3C  ========================================================= */
/* =========================================================  REG40  ========================================================= */
/* =========================================================  REG44  ========================================================= */
/* =========================================================  REG48  ========================================================= */
/* =========================================================  REG4C  ========================================================= */
/* =========================================================  REG50  ========================================================= */
/* =========================================================  REG54  ========================================================= */
/* =========================================================  REG58  ========================================================= */
/* =========================================================  REG5C  ========================================================= */
/* =========================================================  REG60  ========================================================= */
/* =========================================================  REG64  ========================================================= */
/* =========================================================  REG68  ========================================================= */
/* =========================================================  REG6C  ========================================================= */
/* =========================================================  REG70  ========================================================= */
/* =========================================================  REG74  ========================================================= */
/* =========================================================  REG78  ========================================================= */
/* =========================================================  REG7C  ========================================================= */
/* =========================================================  REG80  ========================================================= */
/* =========================================================  REG84  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CFG0  ========================================================== */
/* ============================================  USB CFG0 EP5InIntStat [21..21]  ============================================= */
typedef enum {                                  /*!< USB_CFG0_EP5InIntStat                                                     */
  USB_CFG0_EP5InIntStat_INACTIVE       = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG0_EP5InIntStat_ACTIVE         = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG0_EP5InIntStat_Enum;

/* ============================================  USB CFG0 EP4InIntStat [20..20]  ============================================= */
typedef enum {                                  /*!< USB_CFG0_EP4InIntStat                                                     */
  USB_CFG0_EP4InIntStat_INACTIVE       = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG0_EP4InIntStat_ACTIVE         = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG0_EP4InIntStat_Enum;

/* ============================================  USB CFG0 EP3InIntStat [19..19]  ============================================= */
typedef enum {                                  /*!< USB_CFG0_EP3InIntStat                                                     */
  USB_CFG0_EP3InIntStat_INACTIVE       = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG0_EP3InIntStat_ACTIVE         = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG0_EP3InIntStat_Enum;

