zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510L.h
/* =========================================================  IDX2  ========================================================== */
/* ========================================================  FIFOADD  ======================================================== */
/* =========================================================  FIFO0  ========================================================= */
/* =========================================================  FIFO1  ========================================================= */
/* =========================================================  FIFO2  ========================================================= */
/* =========================================================  FIFO3  ========================================================= */
/* =========================================================  FIFO4  ========================================================= */
/* =========================================================  FIFO5  ========================================================= */
/* ========================================================  HWVERS  ========================================================= */
/* =========================================================  INFO  ========================================================== */
/* ===============================================  USB INFO EDMAIN [25..25]  ================================================ */
typedef enum {                                  /*!< USB_INFO_EDMAIN                                                           */
  USB_INFO_EDMAIN_DEASSERT_MAXPAYLOAD  = 0,     /*!< DEASSERT_MAXPAYLOAD : DMA_REQ signal for all IN Endpoints will
                                                     be de-asserted when MAXPAYLOAD bytes have been written
                                                     to an endpoint.                                                           */
  USB_INFO_EDMAIN_DEASSERT_MAXPAYLOADMINUS8 = 1,/*!< DEASSERT_MAXPAYLOADMINUS8 : DMA_REQ signal for all IN Endpoints
                                                     will be de-asserted when MAXPAYLOAD-8 bytes have been written
                                                     to an endpoint.                                                           */
} USB_INFO_EDMAIN_Enum;

/* ===============================================  USB INFO EDMAOUT [24..24]  =============================================== */
typedef enum {                                  /*!< USB_INFO_EDMAOUT                                                          */
  USB_INFO_EDMAOUT_DEASSERT_MAXPAYLOAD = 0,     /*!< DEASSERT_MAXPAYLOAD : DMA_REQ signal for all OUT Endpoints will
                                                     be de-asserted when MAXPAYLOAD bytes have been read to
                                                     an endpoint. When 1 byte early.                                           */
  USB_INFO_EDMAOUT_DEASSERT_MAXPAYLOADMINUS8 = 1,/*!< DEASSERT_MAXPAYLOADMINUS8 : DMA_REQ signal for all OUT Endpoints
                                                     will be de-asserted when MAXPAYLOAD-8 bytes have been read
                                                     to an endpoint. When 1 byte early.                                        */
} USB_INFO_EDMAOUT_Enum;

/* =======================================================  TIMEOUT1  ======================================================== */
/* =======================================================  TIMEOUT2  ======================================================== */
/* ========================================================  CLKCTRL  ======================================================== */
/* =======================================================  SRAMCTRL  ======================================================== */
/* ===============================================  USB SRAMCTRL RAWLM [7..8]  =============================================== */
typedef enum {                                  /*!< USB_SRAMCTRL_RAWLM                                                        */
  USB_SRAMCTRL_RAWLM_INCDLY            = 3,     /*!< INCDLY : Increased margin adjustment, increased delay for enabling
                                                     write assist.                                                             */
  USB_SRAMCTRL_RAWLM_MBINCDLY          = 2,     /*!< MBINCDLY : Minimum boost level with increased delay for enabling
                                                     write assist.                                                             */
  USB_SRAMCTRL_RAWLM_IMNB              = 1,     /*!< IMNB : Increased margin adjustment with more negative boost.              */
  USB_SRAMCTRL_RAWLM_MMNB              = 0,     /*!< MMNB : Minimum margin adjustment with lowest negative boost
                                                     level.                                                                    */
} USB_SRAMCTRL_RAWLM_Enum;

/* ===================================================  UTMISTICKYSTATUS  ==================================================== */
/* =======================================  USB UTMISTICKYSTATUS OBSPORTSTICKY [0..1]  ======================================= */
typedef enum {                                  /*!< USB_UTMISTICKYSTATUS_OBSPORTSTICKY                                        */
  USB_UTMISTICKYSTATUS_OBSPORTSTICKY_OBS3 = 3,  /*!< OBS3 : bit 1:HS BIST results, bit 0:FS BIST results                       */
  USB_UTMISTICKYSTATUS_OBSPORTSTICKY_OBS2 = 2,  /*!< OBS2 : bit 1: ODT calibration state, bit 0: Current calibration
                                                     state                                                                     */
  USB_UTMISTICKYSTATUS_OBSPORTSTICKY_OBS1 = 1,  /*!< OBS1 : bit 1: Rx squelch signal, bit 0: Rx datap                          */
  USB_UTMISTICKYSTATUS_OBSPORTSTICKY_OBS0 = 0,  /*!< OBS0 : bit 1: PLL lock signal, bit 0: Host Disconnect                     */
} USB_UTMISTICKYSTATUS_OBSPORTSTICKY_Enum;

